{"BIOA02H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA11H3"], "str": "[Grade 12 Biology or BIOA11H3] and [Grade 12 Advanced Functions or Grade 12 Calculus and Vectors or the Online Mathematics Preparedness Course]"}, "title": "BIOA02H3  Life on Earth: Form, Function and Interactions ", "exclusions": {"list": ["BIO120H", "BIO130H", "BIO150Y"], "str": "BIO120H, BIO130H, (BIO150Y)"}, "description": "A lecture and laboratory course providing an overview of the anatomy and physiology of plants and animals, population biology, ecology and biodiversity. Note: that both BIOA01H3 and BIOA02H3 must be completed prior to taking any other Biology course.", "code": "BIOA02H3"}, "BIOA11H3": {"breath_req": "Natural Sciences", "description": "An exploration of how molecules and cells come together to build and regulate human organ systems. The course provides a foundation for understanding genetic principles and human disease, and applications of biology to societal needs. This course is intended for non-biology students.", "exclusions": {"list": ["BIOA01H3", "BIOA02H3", "CSB201H1"], "str": "Grade 12 Biology, BIOA01H3, BIOA02H3, CSB201H1"}, "title": "BIOA11H3  Introduction to the Biology of Humans ", "code": "BIOA11H3"}, "BIOB50H3": {"breath_req": "Natural Sciences", "description": "An introduction to the main principles of ecology, the science of the interactions of organisms with each other and with their environment. The course covers community and population ecology, and provides an emphasis on how ecology relates to other areas of biology, and to contemporary human and environmental issues.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "BIOB50H3  Ecology ", "code": "BIOB50H3"}, "BIOB52H3": {"breath_req": "Natural Sciences", "description": "An introduction to field, lab and computational approaches to ecology and evolution. Laboratories will explore a variety of topics, ranging from population genetics to community ecology and biodiversity. Some lab exercises will involve outdoor field work.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "BIOB52H3  Ecology and Evolutionary Biology Laboratory ", "code": "BIOB52H3"}, "BIOB98H3": {"description": "A course designed to facilitate introduction to, and experience in, ongoing laboratory or field research in biology. Supervision of the work is arranged by mutual agreement between student and instructor. Students must obtain a permission form from SW420B that is to be completed and signed by the student and supervisor (and which will include an outline of the work to be completed) and then returned to SW420B.Note: This course DOES NOT satisfy any Biological Sciences program requirements.Note:This course is a credit/no credit course.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "At least 4.0 credits including BIOA01H3 and BIOA02H3 and enrolment in a Biology program."}, "exclusions": {"list": ["BIOB98H3", "BIOB99H3", "BIOD95H3", "BIOD98Y3", "BIOD99Y3"], "str": "BIOB98H3 may not be taken after or concurrently with BIOB99H3, BIOD95H3, BIOD98Y3 or BIOD99Y3."}, "title": "BIOB98H3  Supervised Introductory Research in Biology ", "code": "BIOB98H3"}, "BIOD66H3": {"breath_req": "Natural Sciences", "description": "This course will combine lecture and student paper projects and presentations to explore the evolutionary and ecological processes that generate patterns of biological diversity as well as how species interactions and ecosystem function are affected by diversity. Of key interest will be how invasions, climate change, and habitat destruction affects diversity and function.", "prerequisite": {"list": ["BIOB51H3", "BIOC59H3", "BIOC61H3"], "str": "BIOB51H3 and [BIOC59H3 or BIOC61H3]"}, "title": "BIOD66H3  Causes and Consequences of Biodiversity ", "code": "BIOD66H3"}, "BIOD54H3": {"breath_req": "Natural Sciences", "description": "Canada has a complex conservation landscape. Through lectures and interactive discussions with leading Canadian conservation practitioners, this course will examine how conservation theory is put into practice in Canada from our international obligations to federal and provincial legislation and policies.", "prerequisite": {"list": ["BIOC62H3", "BIOC63H3"], "str": "BIOC62H3 or BIOC63H3"}, "title": "BIOD54H3  Applied Conservation Biology ", "code": "BIOD54H3"}, "BIOA01H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA11H3"], "str": "[Grade 12 Biology or BIOA11H3] and [Grade 12 Advanced Functions or Grade 12 Calculus and Vectors or the Online Mathematics Preparedness Course]"}, "title": "BIOA01H3  Life on Earth: Unifying Principles ", "exclusions": {"list": ["BIO120H", "BIO130H", "BIO150Y"], "str": "BIO120H, BIO130H, (BIO150Y)"}, "description": "A lecture and laboratory course providing an overview of the origins and cellular basis of life, genetics and molecular biology, evolution and the diversity of microorganisms. Note: that both BIOA01H3 and BIOA02H3 must be completed prior to taking any other Biology course.", "code": "BIOA01H3"}, "BIOD21H3": {"breath_req": "Natural Sciences", "description": "Applications of molecular technology continue to revolutionize our understanding of all areas of life sciences from biotechnology to human disease. This intensive laboratory, lecture / tutorial course provides students with essential information and practical experience in recombinant DNA technology, molecular biology and bio-informatics.", "prerequisite": {"list": ["BIOB12H3", "BIOC15H3", "BIOC17H3"], "str": "BIOB12H3 and BIOC15H3 and BIOC17H3"}, "title": "BIOD21H3  Advanced Molecular Biology Laboratory ", "code": "BIOD21H3"}, "BIOD35H3": {"breath_req": "Natural Sciences", "description": "In this practical introduction to sports science, students will explore how basic science is used to enhance athlete performance. Modules will focus on basic and applied aspects of physiology, biomechanics, strength and conditioning, sports medicine, sports nutrition, and sports psychology. Taught at the Toronto Pan-Am Sports Centre (TPASC).", "prerequisite": {"list": ["BIOC33H3", "BIOC34H3"], "str": "BIOC33H3 or BIOC34H3"}, "title": "BIOD35H3  Sports Science ", "code": "BIOD35H3"}, "BIOC54H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 and BIOB51H3"}, "title": "BIOC54H3  Animal Behaviour ", "exclusions": {"list": ["EEB322H", "ZOO322H"], "str": "EEB322H, (ZOO322H)"}, "description": "Survey of the study of animal behaviour, emphasis on understanding behavioural patterns in the context of evolutionary theory. Topics include sexual selection, parental care, social behaviour, conflict and hypothesis testing in behavioural research.", "code": "BIOC54H3"}, "BIOC23H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB12H3", "BIOC12H3"], "str": "BIOB12H3 and BIOC12H3"}, "title": "BIOC23H3  Practical Approaches to Biochemistry ", "exclusions": {"list": ["BCH370H", "BCH371H", "BCH377H", "BCH378H"], "str": "BCH370H, BCH371H, BCH377H, BCH378H"}, "description": "A lecture and laboratory course that introduces students to experimental approaches used in biochemical research. Topics include practical and theoretical aspects of: spectrophotometry; chromatography; electrophoresis; radioisotopes; enzyme assays, protein purification and approaches to identify protein-protein interactions. Students are expected to solve numerical problems involving these and related procedures.", "code": "BIOC23H3"}, "BIOC65H3": {"breath_req": "Natural Sciences", "description": "An introduction to the scientific study of the effects of toxic chemicals on biological organisms. Standard methods of assessing toxicant effects on individuals, populations, and communities are discussed. Special emphasis is placed on the chemistry of major toxicant classes, and on how toxicants are processed by the human body.", "prerequisite": {"list": ["BIOB50H3", "CHMA10H3", "CHMA11H3"], "str": "BIOB50H3 and CHMA10H3 and CHMA11H3"}, "title": "BIOC65H3  Environmental Toxicology ", "code": "BIOC65H3"}, "BIOD48H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3", "BIOC50H3", "BIOC54H3", "BIOC61H3"], "str": "BIOB50H3, BIOB51H3 and one of the following: BIOC50H3; BIOC54H3 or BIOC61H3"}, "title": "BIOD48H3  Ornithology ", "exclusions": {"list": ["EEB386H", "EEB384H"], "str": "EEB386H, EEB384H"}, "description": "An overview of the evolution, ecology, behaviour, and conservation of birds. Field projects and laboratories will emphasize identification of species in Ontario.", "code": "BIOD48H3"}, "BIOC31H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[BIOB10H3 and BIOB11H3] or BIOB10Y3"}, "title": "BIOC31H3  Plant Development and Biotechnology ", "exclusions": {"list": ["CSB340H", "BOT340H"], "str": "CSB340H, (BOT340H)"}, "description": "A central question of developmental biology is how does a single cell become a complex organism. This lecture course focuses on molecular and cellular mechanisms that control developmental processes in plants, including embryonic, vegetative, reproductive development; hormone signal transduction pathways; analysis of mutants, transgenic plants and their connection to biotechnology.", "code": "BIOC31H3"}, "BIOD99Y3": {"description": "Identical to BIOD98Y3 but intended as a second research experience. In order to be eligible for BIOD99Y3, with the same instructor, the student and the instructor will have to provide a plan of study that goes beyond the work of BIOD98Y3.", "prerequisite": {"list": [], "str": "Satisfactory completion of 13.5 full credits, of which at least four must be Biology B- or C-level courses and permission of the instructor."}, "exclusions": {"list": ["CSB498Y", "EEB498Y", "BOT460Y", "ZOO498Y"], "str": "CSB498Y, EEB498Y, (BOT460Y), (ZOO498Y)"}, "title": "BIOD99Y3  Directed Research in Biology ", "code": "BIOD99Y3"}, "BIOC39H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[BIOB10H3 and BIOB11H3] or BIOB10Y3"}, "title": "BIOC39H3  Immunology ", "exclusions": {"list": ["IMM340H", "IMM341H", "IMM350H", "IMM351H", "IMM334Y", "IMM335Y"], "str": "IMM340H, IMM341H, IMM350H, IMM351H, (IMM334Y), (IMM335Y)"}, "description": "This course introduces the molecular and cellular basis of the immune system. Topics include self versus non-self recognition, humoral and cell-mediated immune responses, and the structure and function of antibodies. The importance of the immune system in health and disease will be emphasized and topics include vaccination, autoimmunity, and tumour immunology.", "code": "BIOC39H3"}, "BIOD22H3": {"breath_req": "Natural Sciences", "description": "This course is organized around a central theme, namely the expression of heat shock (stress) genes encoding proteins is important in cellular repair/protective mechanisms. Topics include heat shock transcription factors, heat shock proteins as 'protein repair agents' that correct protein misfolding, and diseases triggered by protein misfolding such as neurodegenerative disorders.", "prerequisite": {"list": ["BIOC10H3", "BIOC12H3", "BIOC15H3"], "str": "BIOC10H3 or BIOC12H3 or BIOC15H3 "}, "title": "BIOD22H3  Molecular Biology of the Stress Response ", "code": "BIOD22H3"}, "BIOC40H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[BIOB10H3 and BIOB11H3] or BIOB10Y3 "}, "title": "BIOC40H3  Plant Physiology ", "exclusions": {"list": ["BIOB31H3", "BIO251H"], "str": "(BIOB31H3), BIO251H"}, "description": "An introduction to plant biology. Topics include plant and cell structure, water balance, nutrition, transport processes at the cell and whole plant level, physiological and biochemical aspects of photosynthesis, and growth and development in response to hormonal and environmental cues.", "code": "BIOC40H3"}, "BIOD23H3": {"breath_req": "Natural Sciences", "description": "A lecture/seminar/discussion class on contemporary topics in Cell Biology. Students will explore the primary literature becoming familiar with experimental design and methodologies used to decipher cell biology phenomena. Student seminars will follow a series of lectures and journal club discussions.", "prerequisite": {"list": ["BIOC12H3"], "str": "BIOC12H3"}, "title": "BIOD23H3  Special Topics in Cell Biology ", "code": "BIOD23H3"}, "BIOD52H3": {"breath_req": "Natural Sciences", "description": "A seminar exploration of current topics in biodiversity and conservation, including genetic, organismal, and community levels. Examples include DNA barcoding, adaptive radiations, phylogenetic trees, and biodiversity hotspots.  Skills development in critical thinking and interpretation of the primary literature is emphasized, with coursework involving group presentations, discussions, and written analyses.", "prerequisite": {"list": ["BIOC50H3", "BIOC63H3"], "str": "BIOC50H3 or BIOC63H3"}, "title": "BIOD52H3  Biodiversity and Conservation ", "code": "BIOD52H3"}, "BIOC62H3": {"breath_req": "Natural Sciences", "description": "This lecture and tutorial course explores strategic and operational aspects of zoos in conservation. Emphasis is on contemporary issues, including balance between animal welfare and species conservation; nutrition, health and behavioural enrichment for captive animals; in situ conservation by zoos; captive breeding and species reintroductions; and public outreach/education.", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 and BIOB51H3"}, "title": "BIOC62H3  Role of Zoos in Conservation ", "code": "BIOC62H3"}, "BIOC15H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3", "PSYB07H3", "STAB22H3"], "str": "[[BIOB10H3 and BIOB11H3] or BIOB10Y3] and [PSYB07H3 or STAB22H3]"}, "title": "BIOC15H3  Genetics ", "exclusions": {"list": ["BIO260H", "HMB265H"], "str": "BIO260H, HMB265H"}, "description": "Topics for this lecture and laboratory (or project) course include: a brief review of DNA structure, transcription, and translation; inheritance and its chromosomal basis; gene interactions; sources and types of mutations and the relationship of mutation to genetic disease and evolution; genetic dissection of biological processes; genetic technologies and genomic approaches.", "code": "BIOC15H3"}, "BIOC99H3": {"description": "In this introduction to academic research, a group of 3-5 students work with a faculty supervisor and TA to develop a research proposal or implement a research project. Prior to registering, students must find a faculty supervisor, form a group, then submit a permission form to the department.", "prerequisite": {"list": [], "str": "(1) Enrolment in a UTSC Major or Specialist Subject POSt offered by Biological Sciences and (2) completion of all second year core program requirements and (3) have at least 10.0 full credits and (4) a cumulative GPA of at least 3.0 and (5) a commitment from a Biology faculty member to serve as supervisor and (6) formation of a group that includes at least 2 other students"}, "title": "BIOC99H3  Biology Team Research ", "code": "BIOC99H3"}, "BIOC51H3": {"breath_req": "Natural Sciences", "description": "A course with preparatory lectures on the UTSC campus and 1 week at a field station in Costa Rica where ecological, evolutionary, and practical aspects of tropical biodiversity will be explored. Field work will involve outdoor activities in challenging conditions.", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3", "BIOB52H3"], "str": "BIOB50H3 and BIOB51H3 and BIOB52H3 and permission of instructor. "}, "title": "BIOC51H3  Tropical Biodiversity Field Course ", "code": "BIOC51H3"}, "BIOD25H3": {"breath_req": "Natural Sciences", "description": "A course considering the principles of genome organization and the utilization of genomic approaches to studying a wide range of problems in biology. Topics to be presented will include innovations in instrumentation and automation, a survey of genome projects, genomic variation, functional genomics, transcription profiling (microarrays), database mining and extensions to human and animal health and biotechnology.", "prerequisite": {"list": ["BIOC15H3"], "str": "BIOC15H3"}, "title": "BIOD25H3  Genomics ", "code": "BIOD25H3"}, "BIOC19H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[BIOB10H3 and BIOB11H3] or BIOB10Y3"}, "title": "BIOC19H3  Animal Developmental Biology ", "exclusions": {"list": ["CSB328H"], "str": "CSB328H"}, "description": "Following a discussion of cellular and molecular events in early embryonic life, the development of several model systems will be analyzed such as erythropoiesis, lens development in the eye, spermatogenesis and myogenesis. Particular reference will be given to the concept that regulation of gene expression is fundamental to development.", "code": "BIOC19H3"}, "BIOD17H3": {"breath_req": "Natural Sciences", "description": "An overview of the most significant advances in cellular microbiology. Relevant scientific literature will be presented and discussed by the students in class and assignments. The curriculum will include cellular mechanisms of bacterial pathogenesis, invasion and intracellular survival of bacteria, and recognition and elimination of pathogenic bacteria by cells.", "prerequisite": {"list": ["BIOC17H3", "BIOC39H3"], "str": "BIOC17H3 or BIOC39H3"}, "title": "BIOD17H3  Seminars in Cellular Microbiology ", "code": "BIOD17H3"}, "BIOC32H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB34H3", "NROB60H3"], "str": "BIOB34H3 or NROB60H3"}, "title": "BIOC32H3  Human Physiology I ", "exclusions": {"list": ["BIOB30H3", "PSL300H"], "str": "(BIOB30H3), PSL300H"}, "description": "An introduction to Human Physiology covering the function of neurons, the brain, hormones and our immune systems in both healthy and diseased states.", "code": "BIOC32H3"}, "BIOD65H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB11H3", "BIOB10Y3", "BIOC32H3", "NROC61H3", "NROC64H3", "NROC69H3"], "str": "[BIOB11H3 or BIOB10Y3] and [one of: BIOC32H3, NROC61H3, NROC64H3 or NROC69H3]"}, "title": "BIOD65H3  Pathologies of the Nervous System ", "exclusions": {"list": ["NROD65H3"], "str": "(NROD65H3)"}, "description": "An intensive examination of selected pathologies affecting the nervous system such as Alzheimer's and Parkinson's disease, multiple sclerosis, and stroke. These pathologies will be examined from an integrative perspective encompassing the pathogeneses, resulting symptoms, and current therapeutic approaches. This course requires critical examination of research articles.", "code": "BIOD65H3"}, "BIOC10H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[BIOB10H3 and BIOB11H3] or BIOB10Y3"}, "title": "BIOC10H3  Cell Biology: Proteins from Life to Death ", "exclusions": {"list": ["CSB428H", "BIO315H"], "str": "CSB428H, BIO315H"}, "description": "This course builds on fundamental cell biology concepts using primary literature. This course will examine specific organelles and their functions in protein biogenesis, modification, trafficking, and quality control within eukaryotic cells. The experimental basis of knowledge will be emphasized and students will be introduced to hypothesis-driven research in cell biology.", "code": "BIOC10H3"}, "BIOD62H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOC16H3", "BIOC50H3"], "str": "BIOC16H3 or BIOC50H3"}, "title": "BIOD62H3  Species and Speciation ", "exclusions": {"list": ["EEB340H"], "str": "EEB340H"}, "description": "A species is the basic unit of evolution and this course focuses on the process of how species evolve and what keeps established species apart. This course thus provides the student with a deeper understanding of how Earth's biodiversity evolved and is maintained under natural conditions.", "code": "BIOD62H3"}, "BIOB38H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "BIOB38H3  Plants and Society ", "exclusions": {"list": ["BIOC38H3", "EEB202H"], "str": "(BIOC38H3), EEB202H"}, "description": "How do plants feed humans? What are the agricultural origins and what plant traits changed in domesticated plants? Human population is at 7 billion, but will climb to 10 billion in 2050. This will tax our planets ability to sustain life and environmentally sustainable food production will become more integral.", "code": "BIOB38H3"}, "BIOC17H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3"], "str": "[[BIOB10H3 and BIOB11H3] or BIOB10Y3]"}, "title": "BIOC17H3  Microbiology ", "exclusions": {"list": ["MGY377H", "MBY377H"], "str": "MGY377H, (MBY377H)"}, "description": "This course presents an overview of the microbial world and introduces the students, in more detail, to the physiological, cellular and molecular aspects of bacteria. The laboratories illustrate principles and provide training in basic microbiological techniques essential to microbiology and to any field where recombinant DNA technology is used.", "code": "BIOC17H3"}, "BIOB12H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "CHMA10H3 and CHMA11H3"}, "title": "BIOB12H3  Cell and Molecular Biology Laboratory ", "exclusions": {"list": ["BIO215H"], "str": "BIO215H"}, "description": "A practical introduction to experimentation in cell and molecular biology. Lab modules will introduce students to concepts and techniques in the general preparation of solutions and buffers, microbiology, molecular biology, biochemistry, microscopy and data manipulation and communication skills. This core laboratory course is the gateway for Cell & Molecular biology specialists to upper level laboratory offerings.", "code": "BIOB12H3"}, "BIOB51H3": {"breath_req": "Natural Sciences", "description": "Students learn about development of evolutionary theory, maintenance of genetic variation, mechanisms of evolutionary change, adaptation, and current research topics in evolution.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "BIOB51H3  Evolutionary Biology ", "code": "BIOB51H3"}, "BIOB11H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3"], "str": "BIOB10H3"}, "title": "BIOB11H3  Molecular Aspects of Cellular and Genetic Processes ", "exclusions": {"list": ["BIOB10Y3", "BIO230H", "BIO250Y"], "str": "BIOB10Y3, BIO230H, (BIO250Y)"}, "description": "A course focusing on the central dogma of genetics and how molecular techniques are used to investigate cellular processes. Topics include structure and function of the nucleus, DNA replication and cell cycle control, transcription and translation, gene regulation and signal transduction.", "code": "BIOB11H3"}, "BIOD67H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "Varies by module (Permission of course co-ordinator required)"}, "title": "BIOD67H3  Inter-University Biology Field Course ", "exclusions": {"list": ["BIOC67H3"], "str": "(BIOC67H3)"}, "description": "Field courses offered by the Ontario Universities Program in Field Biology (OUPFB) in a variety of habitats and countries, usually during the summer. OUPFB modules (courses) are posted online in January, and students must apply by the indicated deadline.", "code": "BIOD67H3"}, "BIOD30H3": {"breath_req": "Natural Sciences", "description": "Plant scientists working to address pressing global challenges will give presentations. In advance students will identify terminologies and methodologies needed to engage with the speaker and think critically about the research. Student teams will identify and develop background knowledge and go beyond speaker's presentations with new questions and/or applications.", "prerequisite": {"list": ["BIOB38H3", "BIOC15H3", "BIOC31H3", "BIOC37H3", "BIOC40H3"], "str": "BIOB38H3 an [one of BIOC15H3, BIOC31H3, BIOC37H3 or BIOC40H3]"}, "title": "BIOD30H3  Plant Research and Biotechnology: Addressing Global Problems ", "code": "BIOD30H3"}, "BIOD59H3": {"breath_req": "Natural Sciences", "description": "Modelling is a critical tool used to address urgent resource management questions in ecology, epidemiology and conservation. This practical introduction includes approaches for modelling individuals, populations, species interactions, and communities. Applications include population viability assessments, disease eradication and climate change mitigation. ", "prerequisite": {"list": ["MATA29H3", "BIOB50H3"], "str": " MATA29H3 and BIOB50H3"}, "title": "BIOD59H3  Models in Ecology and Conservation ", "code": "BIOD59H3"}, "BIOD98Y3": {"description": "A course designed to permit laboratory or field research or intensive examination of a selected topic in biology. Supervision of the work is arranged by mutual agreement between student and instructor.Students must obtain a permission form from SW420B that is to be completed and signed by the intended supervisor, and returned SW420B. At that time, the student will be provided with an outline of the schedule and general requirements for the course. 10 sessions of group instruction will form part of the coursework.", "prerequisite": {"list": [], "str": "Satisfactory completion of 13.5 full credits, of which at least four must be Biology B- or C-level courses and permission of the instructor."}, "exclusions": {"list": ["CSB498Y", "EEB498Y", "BOT460Y", "ZOO498Y"], "str": "CSB498Y, EEB498Y,(BOT460Y), (ZOO498Y)"}, "title": "BIOD98Y3  Directed Research in Biology ", "code": "BIOD98Y3"}, "BIOC58H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 and BIOB51H3"}, "title": "BIOC58H3  Biological Consequences of Global Change ", "exclusions": {"list": ["EEB428H", "GGR314H", "BIO428H"], "str": "EEB428H, GGR314H, (BIO428H)"}, "description": "A lecture and tutorial course that addresses the key environmental factor that will dominate the 21st Century and life on the planet: Global Climate Change. The course will examine the factors that influence climate, from the formation of the earth to the present time, how human activities are driving current and future change, and how organisms, populations, and ecosystems are and will respond to this change. Finally, it will cover human responses and policies that can permit an adaptive response to this change.", "code": "BIOC58H3"}, "BIOD27H3": {"breath_req": "Natural Sciences", "description": "A lecture/seminar/discussion class on contemporary topics in endocrinology. The course provides a basic knowledge of endocrine systems encompassing hormone biosynthesis, metabolism, and physiologic actions. Signal transduction from growth factors and their receptors will be emphasized. Specific topics and advances in hormone and growth factor research will be examined.", "prerequisite": {"list": ["BIOB30H3", "BIOB34H3", "BIOC32H3"], "str": "(BIOB30H3) or BIOB34H3 or BIOC32H3"}, "title": "BIOD27H3  Molecular Endocrinology ", "code": "BIOD27H3"}, "BIOC37H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB38H3", "BIOB50H3", "BIOB51H3"], "str": "BIOB38H3 or BIOB50H3 or BIOB51H3"}, "title": "BIOC37H3  Plants: Life on the Edge ", "exclusions": {"list": ["EEB340H"], "str": "EEB340H"}, "description": "Plants have evolved adaptations to maximize growth, survival and reproduction under various taxing environmental conditions. This course covers the great diversity of plant structures and function in relation to ecology, focusing mainly on the anatomy of flowering plants.", "code": "BIOC37H3"}, "BIOB10Y3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3", "CHMA10H3", "CHMA11H3"], "str": "BIOA01H3 and BIOA02H3 and CHMA10H3 and CHMA11H3"}, "title": "BIOB10Y3  Cell Biology and Molecular Aspects of Genetic Processes ", "exclusions": {"list": ["BIOB10H3", "BIOB11H3", "BIO240H", "BIO241H", "BIO250Y"], "str": "BIOB10H3, BIOB11H3, BIO240H, BIO241H, (BIO250Y)"}, "description": "A course designed to introduce theory and modern experimental techniques in cell and molecular genetics. Emphasis will be on eukaryotic cells. First half topics include: Structure and function of major animal and plant organelles, the role of the cytoskeleton, the role of the plasma membrane and extracellular matrix in the context of cellular interactions with the environment. In the second half of the course topics will include structure and function of the nucleus, DNA replication and cell cycle control, transcription and translation, gene regulation, signal transduction and basic aspects of immunology. Please note this course contains the content of both BIOB10H3 and BIOB11H3.", "code": "BIOB10Y3"}, "BIOC16H3": {"breath_req": "Natural Sciences", "description": "This course will discuss modern genetic and genomic techniques used to understand the maintenance of genetic variation in nature. Topics include DNA sequence evolution, molecular phylogenetics, methods of detecting selection, sequence alignments, and comparative genomics.", "prerequisite": {"list": ["BIOB51H3"], "str": "BIOB51H3"}, "title": "BIOC16H3  Evolutionary Genetics and Genomics ", "code": "BIOC16H3"}, "BIOC63H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 and BIOB51H3"}, "title": "BIOC63H3  Conservation Biology ", "exclusions": {"list": ["EEB365H", "BIO365H"], "str": "EEB365H, (BIO365H)"}, "description": "A lecture and tutorial course offering an introduction to the scientific foundation and practice of conservation biology. It reviews ecological and genetic concepts constituting the basis for conservation including patterns and causes of global biodiversity, the intrinsic and extrinsic value of biodiversity, the main causes of the worldwide decline of biodiversity and the approaches to save it.", "code": "BIOC63H3"}, "BIOD53H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOC54H3"], "str": "BIOC54H3"}, "title": "BIOD53H3  Special Topics in Behavioural Ecology ", "exclusions": {"list": ["EEB496Y", "BIO496Y"], "str": "EEB496Y, (BIO496Y)"}, "description": "An exploration into current topics in the field of behavioural ecology, the study of the evolutionary and ecological influences on animal behaviour. Topics may include sexual selection and conflict, social behaviour, communication, and behavioural mechanisms. Emphasis will be on current research and the quantitative and qualitative reasoning underlying behavioural ecological theory.", "code": "BIOD53H3"}, "BIOD19H3": {"breath_req": "Natural Sciences", "description": "A lecture/seminar/discussion class on the emerging field of environmental epigenetics. Course will cover basic epigenetic mechanisms, methods in epigenetic research, epigenetic control of gene function, and the role of epigenetics in normal development and human disease.", "prerequisite": {"list": ["BIOC14H3"], "str": "BIOC14H3"}, "title": "BIOD19H3  Epigenetics in Health and Disease ", "code": "BIOD19H3"}, "BIOD60H3": {"breath_req": "Natural Sciences", "description": "The study of how space and scale influence ecological patterns and species coexistence. The course will cover three main topics: 1) spatial dynamics, such as spatial spread and dispersal models; 2) species coexistence with metapopulation/metacommunity, neutral and lottery models; and 3) spatial analysis of ecological communities. Basic concepts will be applied to ecological problems such as: species invasions, reserve design and understanding threats to island biodiversity.Priority will be given to students enrolled in the specialist program in Biodiversity, Ecology and Evolution.", "prerequisite": {"list": ["BIOB50H3", "STAB22H3", "BIOC59H3", "BIOC61H3"], "str": "BIOB50H3 and STAB22H3 and [BIOC59H3 or BIOC61H3]"}, "title": "BIOD60H3  Spatial Ecology ", "code": "BIOD60H3"}, "BIOC13H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3", "CHMB41H3"], "str": "[[BIOB10H3 and BIOB11H3] or BIOB10Y3] and CHMB41H3"}, "title": "BIOC13H3  Biochemistry II: Bioenergetics and Metabolism ", "exclusions": {"list": ["CHMB62H3", "BCH210H", "BCH242Y", "BCH310H"], "str": "CHMB62H3, BCH210H, BCH242Y, BCH310H"}, "description": "A lecture course that introduces cellular metabolism, the process by which living organisms extract and utilize energy from their environment. Topics include: bioenergetics; oxidative phosphorylation; aspects of carbohydrate, lipid and amino acid metabolism; regulation of metabolism; and, the integration of metabolic pathways.", "code": "BIOC13H3"}, "BIOD08H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROC34H3", "NROC64H3", "NROC69H3", "MATA29H3", "MATA31H3", "PSYB07H3", "STAB22H3"], "str": "[NROC34H3 or NROC64H3 or NROC69H3] and [MATA29H3 or MATA31H3] and [PSYB07H3 or STAB22H3]"}, "title": "BIOD08H3  Theoretical Neuroscience ", "exclusions": {"list": ["NROD08H3"], "str": "NROD08H3"}, "description": "A seminar covering topics in the theory of neural information processing, focused on perception, movement, learning and memory. Through reading, discussion and working with computer models students will learn fundamental concepts underlying current theories of brain function including information theory, spike-time/rate coding, population codes, deep learning architectures, liquid state-machines and Bayesian optimality.Same as NROD08H3", "code": "BIOD08H3"}, "BIOD29H3": {"breath_req": "Natural Sciences", "description": "This lecture/seminar format course will critically examine selected topics in human disease pathogenesis. Infectious and inherited diseases including those caused by human retroviruses, genetic defects and bioterrorism agents will be explored. Discussions of primary literature will encompass pathogen characteristics, genetic mutations, disease progression and therapeutic strategies.", "prerequisite": {"list": ["BIOC10H3", "BIOC17H3", "BIOC39H3"], "str": "BIOC10H3 or BIOC17H3 or BIOC39H3"}, "title": "BIOD29H3  Pathobiology of Human Disease ", "code": "BIOD29H3"}, "BIOD43H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOC33H3", "BIOC34H3"], "str": "BIOC33H3 or BIOC34H3"}, "title": "BIOD43H3  Animal Movement and Exercise ", "exclusions": {"list": ["HMB472H"], "str": "HMB472H"}, "description": "A lecture and seminar/discussion course covering integrative, comparative animal locomotion and exercise physiology. Topics will include muscle physiology, neurophysiology, metabolism, energetics, thermoregulation and biomechanics. These topics will be considered within evolutionary and ecological contexts. Students will be expected to give a brief oral presentation on recently published basic research involving animal locomotion and/or exercise physiology.", "code": "BIOD43H3"}, "BIOC14H3": {"breath_req": "Natural Sciences", "description": "This class will provide an overview of the role of genes in behaviour, either indirectly as structural elements or as direct participants in behavioural regulation. Topics to be covered are methods to investigate complex behaviours, specific examples of genetic effects on behaviour in animals and humans, and studies of gene-environment interactions.", "prerequisite": {"list": ["BIOB11H3", "BIOB10Y3"], "str": "BIOB11H3 or BIOB10Y3"}, "title": "BIOC14H3  Genes, Environment and Behaviour ", "code": "BIOC14H3"}, "BIOD37H3": {"breath_req": "Natural Sciences", "description": "This course examines resistance mechanisms (anatomical, cellular, biochemical, molecular) allowing plants to avoid or tolerate diverse abiotic and biotic stresses. Topics include: pathogen defence; responses to temperature, light, water and nutrient availability, salinity, and oxygen deficit; stress perception and signal transduction; methods to study stress responses; and strategies to improve stress resistance.", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3", "BIOC40H3", "BIOB31H3"], "str": "[[BIOB10H3 and BIOB11H3] or BIOB10Y3]] and [BIOC40H3 or (BIOB31H3)]"}, "title": "BIOD37H3  Biology of Plant Stress ", "code": "BIOD37H3"}, "BIOB34H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3", "CHMA10H3", "CHMA11H3"], "str": "BIOA01H3 and BIOA02H3 and CHMA10H3 and CHMA11H3"}, "title": "BIOB34H3  Animal Physiology ", "exclusions": {"list": ["BIOB30H3", "BIO270H", "BIO204H"], "str": "(BIOB30H3), BIO270H, BIO204H"}, "description": "An introduction to the principles of animal physiology rooted in energy usage and cellular physiology. A comparative approach is taken, which identifies both the universal and unique mechanisms present across the animal kingdom. Metabolism, respiration, circulation, water regulation, movement and neural circuits are the areas of principal focus.", "code": "BIOB34H3"}, "BIOD26H3": {"breath_req": "Natural Sciences", "description": "A lecture and tutorial based course designed to provide an overview of the fungal kingdom and the properties of major fungal pathogens that contribute to disease in animals (including humans) and plants. This course will address the mechanisms and clinical implications of fungal infections and host defence mechanisms. Topics include virulence factors and the treatment and diagnosis of infection.", "prerequisite": {"list": ["BIOC17H3", "BIOC39H3"], "str": "BIOC17H3 or BIOC39H3"}, "title": "BIOD26H3  Fungal Biology and Pathogenesis ", "code": "BIOD26H3"}, "BIOB99H3": {"description": "A course designed to facilitate introduction to, and experience in, ongoing laboratory or field research in biology. Supervision of the work is arranged by mutual agreement between student and instructor. Students must obtain a permission form from SW420B that is to be completed and signed by the student and supervisor (and which will include an outline of the work to be completed) and then returned to SW420B.Note: BIOB99H3 is identical to BIOB98H3 but is intended as a second research experience. In order to be eligible for BIOB99H3, with the same instructor, the student and the instructor will have to provide a plan of study, the scope of which goes beyond the work of BIOB98H3.Note:This course DOES NOT satisfy any Biological Sciences program requirements.", "prerequisite": {"list": ["BIOB98H3"], "str": "BIOB98H3"}, "exclusions": {"list": ["BIOB99H3", "BIOD95H3", "BIOD98Y3", "BIOD99Y3"], "str": "BIOB99H3 may not be taken after or concurrently with BIOD95H3, BIOD98Y3 or BIOD99Y3."}, "title": "BIOB99H3  Supervised Introductory Research in Biology ", "code": "BIOB99H3"}, "BIOC59H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3"], "str": "BIOB50H3"}, "title": "BIOC59H3  Advanced Population Ecology ", "exclusions": {"list": ["EEB319H", "BIO319H"], "str": "EEB319H, (BIO319H)"}, "description": "The study of the interactions that determine the distribution and abundance of organisms on the earth. The topics will include an understanding of organism abundance and the factors that act here: population parameters, demographic techniques, population growth, species interactions (competition, predation, herbivory, disease), and population regulation. It will include an understanding of organism distribution and the factors that act here: dispersal, habitat selection, species interactions, and physical factors.", "code": "BIOC59H3"}, "BIOC34H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB30H3", "BIOB34H3", "NROB60H3", "BIO271H"], "str": "(BIOB30H3) or BIOB34H3 or NROB60H3 or BIO271H"}, "title": "BIOC34H3  Human Physiology II: Lecture ", "exclusions": {"list": ["BIOC33H3", "PSL302Y", "PSL301H"], "str": "BIOC33H3, (PSL302Y), PSL301H"}, "description": "The lecture component of BIOC34H3 is identical to that described above for BIOC33H3. Students will complete a series of computer-simulated laboratory exercises (on their own time) instead of practical lab sessions.", "code": "BIOC34H3"}, "BIOC21H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB10Y3", "BIOB30H3", "BIOB34H3"], "str": "[BIOB10H3 or BIOB10Y3] and (BIOB30H3) or BIOB34H3"}, "title": "BIOC21H3  Vertebrate Histology: Cells and Tissues ", "exclusions": {"list": ["ANA300Y"], "str": "ANA300Y"}, "description": "A study of the structure of cells and the various tissue types which make up the vertebrate body; epithelial, connective, muscle, nervous, blood, and lymphatic. Emphasis is placed on how form is influenced by function of the cells and tissues.", "code": "BIOC21H3"}, "BIOC50H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 and BIOB51H3"}, "title": "BIOC50H3  Macroevolution ", "exclusions": {"list": ["EEB362H"], "str": "EEB362H"}, "description": "An overview of recent developments in evolutionary biology that focus on large-scale patterns and processes of evolution. Areas of emphasis may include the evolutionary history of life on earth, phylogenetic reconstruction, patterns of diversification and extinction in the fossil record, the geography of evolution, the evolution of biodiversity, and the process of speciation.", "code": "BIOC50H3"}, "BIOB32H3": {"breath_req": "Natural Sciences", "description": "This course examines physiological mechanisms that control and co-ordinate the function of various systems within the body. The laboratory exercises examine properties of digestive enzymes, characteristics of blood, kidney function, metabolic rate and energetics, nerve function and action potentials, synaptic transmission, skeletal muscle function and mechanoreception.", "exclusions": {"list": ["BIO252Y", "BIO270H", "BIO271H", "ZOO252Y"], "str": "BIO252Y, BIO270H, BIO271H, (ZOO252Y)"}, "title": "BIOB32H3  Animal Physiology Laboratory ", "code": "BIOB32H3"}, "BIOC12H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB10H3", "BIOB11H3", "BIOB10Y3", "CHMB41H3"], "str": "[[BIOB10H3 and BIOB11H3] or BIOB10Y3] and CHMB41H3"}, "title": "BIOC12H3  Biochemistry I: Proteins and Enzymes ", "exclusions": {"list": ["CHMB62H3", "BCH210H", "BCH242Y", "BCH310H"], "str": "CHMB62H3, BCH210H, BCH242Y, BCH310H"}, "description": "A lecture course describing factors involved in determining protein structures and the relationship between protein structure and function. Topics include: amino acids; the primary, secondary, tertiary and quaternary structures of proteins; protein motifs and protein domains; glycoproteins; membrane proteins; classical enzyme kinetics and allosteric enzymes; mechanisms of enzyme action.", "code": "BIOC12H3"}, "BIOB10H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3", "CHMA10H3", "CHMA11H3"], "str": "BIOA01H3 and BIOA02H3 and CHMA10H3 and CHMA11H3"}, "title": "BIOB10H3  Cell Biology ", "exclusions": {"list": ["BIOB10Y3", "BIO241H", "BIO250Y"], "str": "BIOB10Y3, BIO241H, (BIO250Y)"}, "description": "This course is designed to introduce theory and modern experimental techniques in cell biology. Emphasis will be on eukaryotic cells. Structure and function of major animal and plant organelles will be covered. Subsequent topics include the role of the cytoskeleton. Plasma membrane and extracellular matrix will also be detailed in the context of cell interactions with the environment.", "code": "BIOB10H3"}, "BIOB33H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "BIOB33H3  Human Development and Anatomy ", "exclusions": {"list": ["ANA300Y", "ANA301H", "PMDB33H3"], "str": "ANA300Y, ANA301H, PMDB33H3"}, "description": "A lecture and laboratory course which deals with the functional morphology of the human organism. The subject matter extends from early embryo-genesis through puberty to late adult life.Priority will be given to students in the Human Biology programs. Additional students will be admitted as space permits.", "code": "BIOB33H3"}, "BIOD96Y3": {"description": "This course is designed to permit critical analysis of current topics relevant to the broad topic of paramedicine. Students will work independently but under the supervision of an industry leader, practitioner and/or researcher involved in paramedicine, who will guide the in-depth study/research. Students must also report to the course instructor and paramedicine program supervisor. Students must obtain a permission form from SW420B. At that time the student will be provided with an outline of the general schedule and general requirements for the course. Students are required to meet with the course instructor and program supervisor for complete course information and to complete their formal registration.", "prerequisite": {"list": ["PMDC54Y3", "PMDC56H3", "PSYB07H3", "STAB22H3"], "str": "Minimum of 14.0 credits including PMDC54Y3 and PMDC56H3 and [PSYB07H3 or STAB22H3]"}, "title": "BIOD96Y3  Directed Research in Paramedicine ", "code": "BIOD96Y3"}, "BIOC52H3": {"breath_req": "Natural Sciences", "description": "This course provides students with the opportunity to experience hands-on learning through informal natural history walks, and group and individual research projects, in a small-class setting. The course covers basic principles and selected techniques of field ecology and ecological questions related to plants in their natural settings. Most of the field work takes place in the Highland Creek ravine.", "exclusions": {"list": ["EEB305H"], "str": "(EEB305H)"}, "title": "BIOC52H3  Ecology Field Course ", "code": "BIOC52H3"}, "BIOC60H3": {"breath_req": "Natural Sciences", "description": "Canada is characterized by its long and harsh winters. Any Canadian plant or animal has evolved one of three basic survival strategies: (1) migration (avoidance), (2) hibernation, and (3) resistance. These evolutionary adaptations are discussed by the example of organisms from across the GTA through indoor and outdoor activities.", "prerequisite": {"list": ["BIOB50H3", "BIOB51H3"], "str": "BIOB50H3 or BIOB51H3"}, "title": "BIOC60H3  Winter Ecology ", "code": "BIOC60H3"}, "BIOD45H3": {"breath_req": "Natural Sciences", "description": "Theoretical and biological aspects of communication in non-human animals; communication behaviour; decision-making and signal design; evolution of communication.", "prerequisite": {"list": ["BIOC54H3", "NROC34H3"], "str": " BIOC54H3 or NROC34H3"}, "title": "BIOD45H3  Animal Communication ", "code": "BIOD45H3"}, "BIOD95H3": {"description": "This course is designed to permit intensive examination of the primary literature of a select topic. Frequent consultation with the supervisor is necessary and extensive library research is required. The project will culminate in a written report.Students must obtain a permission form from SW420B that is to be completed and signed by the intended supervisor, then returned to SW420B. At that time, the student will be provided with an outline of the schedule and general requirements for the course. 5 sessions of group instruction will form part of the coursework.", "prerequisite": {"list": ["BIOD95H3", "BIOD98Y3", "BIOD99Y3"], "str": "Satisfactory completion of 12.5 full credits, of which at least four must be Biology B- or C-level courses. Students must have permission of the instructor. In order to be eligible for BIOD95H3, with the same instructor as for BIOD98Y3 or BIOD99Y3, the student and instructor must provide a plan that goes beyond the work of those courses."}, "title": "BIOD95H3  Supervised Study in Biology ", "code": "BIOD95H3"}, "BIOD33H3": {"breath_req": "Natural Sciences", "description": "This course will examine how various physiological systems and anatomical features are specialised to meet the environmental challenges encountered by terrestrial and aquatic animals. Topics include respiratory systems and breathing, hearts and cardiovascular systems, cardiorespiratory control, animal energetics, metabolic rate, thermoregulation, defenses against extreme temperatures, hibernation and osmotic/ionic/volume regulation.", "prerequisite": {"list": ["BIOC33H3", "BIOC34H3"], "str": "BIOC33H3 or BIOC34H3"}, "title": "BIOD33H3  Comparative Animal Physiology ", "code": "BIOD33H3"}, "BIOC61H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB50H3"], "str": "BIOB50H3"}, "title": "BIOC61H3  Community Ecology and Environmental Biology ", "exclusions": {"list": ["EEB321H", "BIO321H"], "str": "EEB321H, (BIO321H)"}, "description": "An examination of the theory and methodology of community analysis, with an emphasis on the factors regulating the development of ecosystems. The application of ecological theory to environmental problems is emphasized. Topics include: succession, primary productivity, nutrient supply, predation, competition, trophic dynamics, stability and disturbance, and effects of global change.", "code": "BIOC61H3"}, "BIOC33H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOB30H3", "BIOB34H3", "NROB60H3", "BIO271H"], "str": "(BIOB30H3) or BIOB34H3 or NROB60H3 or BIO271H"}, "title": "BIOC33H3  Human Physiology II: Lecture and Laboratory ", "exclusions": {"list": ["BIOC34H3", "PSL301H", "PSL302Y"], "str": "BIOC34H3, PSL301H, (PSL302Y)"}, "description": "This course will cover the physiology of the human respiratory, cardiovascular, renal and digestive systems. Topics include cardiac function, ECG, blood flow/pressure regulation, pulmonary mechanics, gas transfer and transport, the control of breathing, sleep-related breathing disorders, kidney function, ion regulation, water balance, acid-base balance and digestive function/regulation.", "code": "BIOC33H3"}}