{"EESA11H3": {"breath_req": "Natural Sciences", "description": "This course illustrates the environmental effects of urban expansion, changing methods of agriculture, industrialization, recreation, resource extraction, energy needs and the devastation of war. Drawing on information from a wide spectrum of topics - such as waste disposal, tourism, the arctic, tropical forests and fisheries - it demonstrates what we know about how pollutants are produced, the pathways they take through the global environment and how we can measure them. The course will conclude with an examination of the state of health of Canada's environments highlighting areas where environmental contamination is the subject of public discussion and concern. No prior knowledge of environmental science is required.", "title": "EESA11H3  Environmental Pollution ", "code": "EESA11H3"}, "EESA01H3": {"breath_req": "Natural Sciences", "description": "The scientific method and its application to natural systems. The physical and biological processes which drive ecosystem functions. Anthropogenic changes in ecosystem functions at local and global scales. Emphasis on the degradation of the atmosphere, soil, water and biological resources caused by human activity. Renewable and non-renewable resource sustainability. Laboratories will include hands-on field and lab related practical experience.", "exclusions": {"list": ["ENV100Y"], "str": "ENV100Y"}, "title": "EESA01H3  Introduction to Environmental Science ", "code": "EESA01H3"}, "MGEB60H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3"], "str": "[MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] or [MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)]"}, "title": "MGEB60H3  Comparative Economic Systems ", "exclusions": {"list": ["ECMB68H3"], "str": "(ECMB68H3)"}, "description": "A research-oriented course focused on the application of general systems theory to comparative analysis of alternative economic systems, capitalist, socialist and other. Half of the course will focus on general theoretical systems models; the other half will empirically study Russia, China and other systems.", "code": "MGEB60H3"}, "ENGB28H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the historical and cultural developments that have impacted the study of literature in English from 1700 to our contemporary moment. This course will familiarize students with the eighteenth century, Romanticism, the Victorian period, Modernism, and Postmodernism, and will attend to the significance of postcolonial and world literatures in shaping the notions of literary history and the literary canon.Pre-1900 course", "title": "ENGB28H3  Charting Literary History II ", "code": "ENGB28H3"}, "STEB21H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA11H3"], "str": "CHMA11H3"}, "title": "STEB21H3  Organic Chemistry and Applications ", "exclusions": {"list": ["CHMB41H3", "CHMB42H3", "CHMB41H3", "CHMB42H3", "STEB21H3", "STEB21H3", "CHMB41H3", "CHMB42H3"], "str": "CHMB41H3 and CHMB42H3  Note:  CHMB41H3 and CHMB42H3 may be taken after STEB21H3, but STEB21H3 may not be taken after CHMB41H3 or CHMB42H3."}, "description": "An introduction to the theory and practical applications of organic chemistry. An introduction to the principles of structure, properties identification and reactions of organic compounds as related to biology and other areas of science. Enrolment is limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "code": "STEB21H3"}, "ESTB01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course introduces the Environmental Studies major and the interdisciplinary study of the environment through a team-teaching format. Students will explore both physical and social science perspectives on the environment, sustainability, environmental problems and their solutions. Emphasis will be on critical thinking, problem solving, and experiential learning.", "prerequisite": {"list": [], "str": "Enrolment in the Environmental Studies major program"}, "title": "ESTB01H3  Introduction to Environmental Studies ", "code": "ESTB01H3"}, "MGEB32H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3"], "str": "[MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] or [MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)]"}, "title": "MGEB32H3  Economic Aspects of Public Policy ", "exclusions": {"list": ["ECMB36H3"], "str": "(ECMB36H3)"}, "description": "Cost-Benefit Analysis (CBA) is a key policy-evaluation tool developed by economists to assess government policy alternatives and provide advice to governments. In this course, we learn the key assumption behind and techniques used by CBA and how to apply these methods in practice.", "code": "MGEB32H3"}, "MGEB01H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3"], "str": "[MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] or [MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)]"}, "title": "MGEB01H3  Price Theory ", "exclusions": {"list": ["MGEB02H3", "ECMB02H3", "ECMB01H3", "ECO200Y", "ECO204Y", "ECO206Y"], "str": "MGEB02H3/(ECMB02H3), (ECMB01H3), ECO200Y, ECO204Y, ECO206Y"}, "description": "This course covers the intermediate level development of the principles of microeconomic theory. The emphasis is on static partial equilibrium analysis. Topics covered include: consumer theory, theory of production, theory of the firm, perfect competition and monopoly. This course does not qualify as a credit for either the Major in Economics for Management Studies or the B.B.A.", "code": "MGEB01H3"}, "MGEB02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MATA32H3", "MATA33H3", "MATA27H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3", "MATA32H3", "MATA33H3"], "str": "MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3) and [[MATA32H3 and MATA33H3] (or equivalents) or (MATA27H3)]. Students who have completed MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3) and [MATA32H3 and MATA33H3] (or equivalents) may be admitted with the permission of the Supervisor of Studies."}, "title": "MGEB02H3  Price Theory: A Mathematical Approach ", "exclusions": {"list": ["MGEB01H3", "ECMB01H3", "ECMB02H3", "ECO200Y", "ECO204Y", "ECO206Y"], "str": "MGEB01H3/(ECMB01H3), (ECMB02H3), ECO200Y, ECO204Y, ECO206Y"}, "description": "Intermediate level development of the principles of microeconomic theory. The course will cover the same topics as MGEB01H3/(ECMB01H3), but will employ techniques involving calculus so as to make the theory clearer to students. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEB02H3"}, "ENGC48H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC48H3  Satire ", "exclusions": {"list": ["ENGD67H3"], "str": "(ENGD67H3)"}, "description": "An investigation of the literatures and theories of the unthinkable, the reformist, the iconoclastic, and the provocative. Satire can be conservative or subversive, corrective or anarchic. This course will address a range of satire and its theories. Writers may range from Juvenal, Horace, Lucian, Erasmus, Donne, Jonson, Rochester, Dryden, Swift, Pope, Gay, Haywood, and Behn to Pynchon, Nabokov and Atwood.Pre-1900 course", "code": "ENGC48H3"}, "ENGC47H3": {"breath_req": "Arts, Literature & Language", "description": "A study of poetry written roughly between the World Wars. Poets from several nations may be considered. Topics to be treated include Modernist difficulty, formal experimentation, and the politics of verse. Literary traditions from which Modernist poets drew will be discussed, as will the influence of Modernism on postmodern writing.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC47H3  Modernist Poetry ", "code": "ENGC47H3"}, "ENGC90H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB30H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)] and ENGB30H3"}, "title": "ENGC90H3  Topics in Classical Myth and Literature ", "exclusions": {"list": ["CLAC01H3", "ENGC58H3", "ENGC60H3", "ENGC61H3"], "str": "CLAC01H3, (ENGC58H3), (ENGC60H3), (ENGC61H3)"}, "description": "This course pursues the in-depth study of a small set of myths. We will explore how a myth or mythological figure is rendered in a range of literary texts ancient and modern, and examine each text as both an individual work of art and a strand that makes up the fabric of each given myth.Pre-1900 course", "code": "ENGC90H3"}, "EESB19H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "EESA06H3"], "str": "CHMA10H3, CHMA11H3, EESA06H3"}, "title": "EESB19H3  Mineralogy ", "exclusions": {"list": ["EESC32H3", "EESC35H3", "GLG423H"], "str": "(EESC32H3), (EESC35H3), GLG423H"}, "description": "A comprehensive introduction to crystalline structure, crystal chemistry, bonding in rock forming minerals, and optical properties of minerals. The course includes laboratory exercises on the identification of minerals in hand specimen, and identification of minerals using polarizing microscopes.", "code": "EESB19H3"}, "EESC36H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESB19H3", "EESC35H3"], "str": "EESB19H3 or (EESC35H3)"}, "title": "EESC36H3  Petrology ", "exclusions": {"list": ["EESC32H3", "GLG207H", "ERS203H"], "str": "(EESC32H3), GLG207H, ERS203H"}, "description": "This course surveys the processes that produce the chemical and mineralogical diversity of igneous, sedimentary, and metamorphic rocks including: the distribution, chemical and mineral compositions of rocks of the mantel and crust, their physical properties, and their relation to geological environments. Descriptive petrology for various rocks will also be covered.", "code": "EESC36H3"}, "MGED90H3": {"description": "These courses will normally be made available only to upper-level students whose interests are not covered by other courses and whose performance in Economics courses has been well above average. Not all faculty will be available for these courses in any single session.Note: Students must obtain consent from the Supervisor of Studies, supervising instructor and the Department of Management before registering for this course.", "exclusions": {"list": ["ECMD11H3"], "str": "(ECMD11H3)"}, "title": "MGED90H3  Supervised Reading ", "code": "MGED90H3"}, "ENGD12H3": {"description": "A detailed study of some aspect or aspects of life-writing. Topics may include life-writing and fiction, theory, criticism, self, and/or gender.Can count as a pre-1900 course depending on the topic.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD12H3  Topics in Life Writing ", "code": "ENGD12H3"}, "ENGC08H3": {"breath_req": "Arts, Literature & Language", "description": "This multi-genre creative writing course, designed around a specific theme or topic, will encourage interdisciplinary practice, experiential adventuring, and rigorous theoretical reflection through readings, exercises, field trips, projects, etc. Admission by portfolio. The portfolio should contain 10-20 pages of your best writing (any genre). Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": ["ENGB60H3", "ENGB61H3"], "str": "ENGB60H3 or ENGB61H3"}, "title": "ENGC08H3  Special Topics in Creative Writing I ", "code": "ENGC08H3"}, "ENGB12H3": {"breath_req": "Arts, Literature & Language", "description": "Life-writing, whether formal biography, chatty memoir, postmodern biotext, or published personal journal, is popular with writers and readers alike. This course introduces students to life-writing as a literary genre and explores major issues such as life-writing and fiction, life-writing and history, the contract between writer and reader, and gender and life-writing.", "exclusions": {"list": ["ENG232H"], "str": "ENG232H"}, "title": "ENGB12H3  Life Writing ", "code": "ENGB12H3"}, "ENGC04H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the craft of screenwriting undertaken through discussions, readings, and workshop sessions. Admission by portfolio. The portfolio should contain 10-20 pages of a complete screenplay or a screenplay in progress. Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": ["ENGB61H3"], "str": "ENGB61H3"}, "title": "ENGC04H3  Creative Writing: Screenwriting ", "code": "ENGC04H3"}, "EESB02H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3"}, "title": "EESB02H3  Principles of Geomorphology ", "exclusions": {"list": ["GGR201H"], "str": "GGR201H"}, "description": "The physical and chemical processes responsible for the development of regolith at the surface of the earth and the mechanics of entrainment, transport and deposition of mass by rivers, wind, glaciers, water waves, gravitational stresses, etc., which control the evolution of surface morphology.Field excursions and laboratory exercises will allow students to apply theory to natural systems and to understand the dynamics of one man-modified geomorphic system.", "code": "EESB02H3"}, "ENGB27H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the historical and cultural developments that have shaped the study of literature in English before 1700. Focusing on the medieval, early modern, and Restoration periods, this course will examine the notions of literary history and the literary \"canon\" and explore how contemporary critical approaches impact our readings of literature in English in specific historical and cultural settings.\nPre-1900 course", "exclusions": {"list": ["ENG202Y"], "str": "ENG202Y"}, "title": "ENGB27H3  Charting Literary History I ", "code": "ENGB27H3"}, "EESC30H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "BIOB50H3", "BIOB51H3"], "str": "CHMA10H3 and CHMA11H3 and BIOB50H3 and BIOB51H3"}, "title": "EESC30H3  Environmental Microbiology ", "exclusions": {"list": ["BGYC55H3"], "str": "(BGYC55H3)"}, "description": "This course examines the diversity of microorganisms, their adaptations to special habitats, and their critical role in the ecosystems and biogeochemical cycles. The course covers microbial phylogeny, physiological diversity, species interactions and state of the art methods of detection and enumeration.", "code": "EESC30H3"}, "EESC18H3": {"breath_req": "Natural Sciences", "description": "North America is endowed with eight of the twelve largestlakes in the world. The origin and geological history, cycles of carbon, nitrogen and phosphorus, and structures of ecosystems of the North American Great Lakes will be used as examples of large lacustrine systems. Fundamental concepts of limnology will be related to features found in the Great Lakes. Topics include: lake origins, lake classification, lake temperature structure and heat budgets, seasonal water circulations, productivity, plankton ecology, food-web dynamics, exotic species invasions, eutrophication-related phenomena and water quality/fisheries management. Specific anthropogenic influences will be illustrated using case studies from the local environment, and students will be allowed to pursue their own interests through a series of short seminars.", "prerequisite": {"list": ["EESB03H3"], "str": "EESB03H3"}, "title": "EESC18H3  Limnology ", "code": "EESC18H3"}, "ENGB04H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the literary analysis of poetry. This course will study closely poems and poetic forms from different periods in order to develop the critical skills to analyse poetry.", "exclusions": {"list": ["ENG201Y"], "str": "ENG201Y"}, "title": "ENGB04H3  Critical Thinking About Poetry ", "code": "ENGB04H3"}, "ENGC43H3": {"breath_req": "Arts, Literature & Language", "description": "An investigation of how nineteenth-century literature is translated into our contemporary world through art forms like music, architecture, film, television, graphic novels, or online and social media. What is it that makes us keep returning to the past, and how does each adaptation re-make the original into something new and relevant? Pre-1900 course.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC43H3  Nineteenth-Century Literature and Contemporary Culture ", "code": "ENGC43H3"}, "ENGC15H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC15H3  Concepts in Literary Criticism ", "exclusions": {"list": ["ENG280H", "ENG267H"], "str": "ENG280H, (ENG267H)"}, "description": "A study of selected topics in literary criticism. Schools of criticism and critical methodologies such as New Criticism, structuralism, poststructuralism, Marxism, psychoanalysis, gender and sexuality studies, New Historicism, and postcolonialism will be covered, both to give students a roughly century-wide survey of the field and to provide them with a range of models applicable to their own critical work as writers and thinkers. Recommended for students planning to pursue graduate study in English literature.", "code": "ENGC15H3"}, "MGEC93H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3", "MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "[MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)] and [MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)]"}, "title": "MGEC93H3  International Economics ", "exclusions": {"list": ["MGEC62H3", "ECMC62H3", "ECMC93H3", "ECO230Y", "ECO328Y"], "str": "MGEC62H3/(ECMC62H3), (ECMC93H3), ECO230Y, ECO328Y"}, "description": "This course provides general understanding on issues related to open economy and studies theories in international trade and international finance. Topics include why countries trade, implications of various trade policies, theories of exchange rate determination, policy implications of different exchange rate regimes and other related topics.Note: This course may be applied to the C-level course requirements of the Minor Program in Economics for Management Studies. It may not, however, be used to meet the requirements of any program that leads to a B.B.A. or of the Major Program in Economics for Management Studies.", "code": "MGEC93H3"}, "EESB04H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA01H3", "EESA06H3"], "str": "EESA01H3 or EESA06H3 or any B-level EES course."}, "title": "EESB04H3  Principles of Hydrology ", "exclusions": {"list": ["GGR206H"], "str": "GGR206H"}, "description": "The water and energy balances; fluxes through natural systems. Process at the drainage basin scale: precipitation, evaporation, evapotranspiration and streamflow generation. The measurement of water fluxes, forecasting of rainfall and streamflow events. Human activity and change in hydrologic processes.", "code": "EESB04H3"}, "MGEC40H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC40H3  Economics of Organization and Management ", "exclusions": {"list": ["ECMC40H3", "ECO310Y", "ECO370Y", "ECO381H", "ECO426H"], "str": "(ECMC40H3), ECO310Y, ECO370Y, ECO381H, ECO426H"}, "description": "This course examines the economics of the internal organization of the firm. Emphasis will be on economic relationships between various parties involved in running a business: managers, shareholders, workers, banks, and government.Topics include the role of organizations in market economies, contractual theory, risk sharing, property rights, corporate financial structure and vertical integration.", "code": "MGEC40H3"}, "ENGB37H3": {"breath_req": "Arts, Literature & Language", "description": "This course considers the creation, marketing, and consumption of popular film and fiction. Genres studied might include bestsellers; detective fiction; mysteries, romance, and horror; fantasy and science fiction; \"chick lit\"; popular song; pulp fiction and fanzines.", "title": "ENGB37H3  Popular Literature and Mass Culture ", "code": "ENGB37H3"}, "MGED02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB12H3", "ECMB12H3", "MGEC02H3", "ECMC02H3"], "str": "MGEB12H3/(ECMB12H3) and MGEC02H3/(ECMC02H3)"}, "title": "MGED02H3  Advanced Microeconomic Theory ", "exclusions": {"list": ["ECO326H", "ECMC13H3", "ECMD13H3"], "str": "ECO326H, (ECMC13H3), (ECMD13H3)"}, "description": "An upper level extension of the ideas studied in MGEC02H3/(ECMC02H3). The course offers a more sophisticated treatment of such topics as equilibrium, welfare economics, risk and uncertainty, strategic and repeated interactions, agency problems, and screening and signalling problems. Enrolment is limited to students registered in programs requiring this course.", "code": "MGED02H3"}, "ENGD48H3": {"breath_req": "Arts, Literature & Language", "description": "Advanced study of a selected Victorian writer or small group of writers. The course will pursue the development of a single author's work over the course of his or her entire career or it may focus on a small group of thematically or historically related writers.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD48H3  Studies in Major Victorian Writers ", "code": "ENGD48H3"}, "ENGC69H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the Gothic tradition in literature since 1760. Drawing on texts such as Horace Walpole's The Castle of Otranto, Jane Austen's Northanger Abbey, Henry James' The Turn of the Screw, and Anne Rice's Interview with the Vampire, this course will consider how the notion of the \"Gothic\" has developed across historical periods and how Gothic texts represent the supernatural, the uncanny, and the nightmares of the unconscious mind.Pre-1900 course", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC69H3  Gothic Literature ", "code": "ENGC69H3"}, "MGEC92H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC92H3  Economics of Markets and Pricing ", "exclusions": {"list": ["MGEC02H3", "ECMC02H3", "MGEC41H3", "ECMC41H3", "ECMC92H3", "ECO200Y", "ECO204Y", "ECO206Y", "ECO310Y"], "str": "MGEC02H3/(ECMC02H3), MGEC41H3/(ECMC41H3), (ECMC92H3), ECO200Y, ECO204Y, ECO206Y, ECO310Y"}, "description": "The course builds on MGEB01H3/(ECMB01H3) [or MGEB02H3/(ECMB02H3)] by exposing students to the economics of market structure and pricing. How and why certain market structures, such as monopoly, oligopoly, perfect competition, etc., arise. Attention will also be given to how market structure, firm size and performance and pricing relate. Role of government will be discussed.Note: This course may be applied to the C-level course requirements of the Minor Program in Economics for Management Studies. It may not, however, be used to meet the requirements of any program that leads to a B.B.A. or of the Major Program in Economics for Management Studies.", "code": "MGEC92H3"}, "STEC11H3": {"breath_req": "Natural Sciences", "description": "The basic principles of Environmental Microbiology, immunology, molecular biology and genetics and toxicity testing using microorganisms. Laboratories are performed using current Ministry of Environment methodologies. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "prerequisite": {"list": ["STEB40H3"], "str": "STEB40H3"}, "title": "STEC11H3  Applied Microbiological Analysis ", "code": "STEC11H3"}, "ENGC23H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC23H3  Fantasy and the Fantastic in Literature and the Other Arts ", "exclusions": {"list": ["ENG239H"], "str": "ENG239H"}, "description": "A study of fantasy and the fantastic from 1800 to the present. Students will consider various theories of the fantastic in order to chart the complex genealogy of modern fantasy across a wide array of literary genres (fairy tales, poems, short stories, romances, and novels) and visual arts (painting, architecture, comics, and film).", "code": "ENGC23H3"}, "ENGB61H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the writing of fiction. This course will provide an introduction to the writing of short fiction through workshop sessions. Admission by portfolio.", "exclusions": {"list": ["ENG369Y"], "str": "(ENG369Y)"}, "title": "ENGB61H3  Creative Writing: Fiction I ", "code": "ENGB61H3"}, "ENGB32H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the poetry and plays of William Shakespeare, this course situates his works in the literary, social and political contexts of early modern England. The main emphasis will be on close readings of Shakespeare's sonnets and plays, to be supplemented by classical, medieval, and renaissance prose and poetry upon which Shakespeare drew.Pre-1900 course.", "exclusions": {"list": ["ENG220Y", "ENGB10H3"], "str": "ENG220Y, (ENGB10H3)"}, "title": "ENGB32H3  Shakespeare in Context I ", "code": "ENGB32H3"}, "EESA09H3": {"breath_req": "Natural Sciences", "description": "A survey of the science, history and applications of wind. Topics include storms including hurricanes, tornadoes and mid-latitude cyclones, global circulation, local circulations, measurement of winds, impact of winds on land surfaces, wind power, winds and pollution, historical and literary winds, and contemporary wind research. No prior knowledge of environmental science is required. ", "title": "EESA09H3  Wind ", "code": "EESA09H3"}, "STEC15H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA11H3", "STEB07H3"], "str": "CHMA11H3 and STEB07H3"}, "title": "STEC15H3  Applied Analytical Instrumentation ", "exclusions": {"list": ["CHMC16H3", "STEC15H3", "CHMC16H3", "CHMC16H3", "STEC15H3"], "str": "CHMC16H3  Note:  STEC15H3 may not be taken after CHMC16H3, but CHMC16H3 may be taken after STEC15H3."}, "description": "The theory and practices of chemical sampling and analysis used by the Ministry of Environment and Energy. The emphasis will be on the analysis of environmental samples using MOEE procedures and College equipment. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "code": "STEC15H3"}, "ENGC35H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the real and imagined multiculturalism of early modern English life. How did English encounters and exchanges with people, products, languages, and material culture from around the globe redefine ideas of national, ethnic, and racial community? In exploring this question, we will consider drama and poetry together with travel writing, language manuals for learning foreign tongues, costume books, and maps. Pre-1900 course", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC35H3  Imagined Communities in Early Modern England, 1500-1700 ", "code": "ENGC35H3"}, "ENGC87H3": {"breath_req": "Arts, Literature & Language", "description": "An intensive study of the writing of fiction through a selected theme, topic, or author. The course will undertake its study through discussions, readings, and workshop sessions. Admission by portfolio. The portfolio should contain 10-15 pages of your best fiction. Please email your portfolio to awestoll@utsc.utoronto.caby the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": ["ENGB61H3"], "str": "ENGB61H3"}, "title": "ENGC87H3  Creative Writing: Fiction II ", "code": "ENGC87H3"}, "ENGC29H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC29H3  Chaucer ", "exclusions": {"list": ["ENG300Y"], "str": "ENG300Y"}, "description": "Selections from The Canterbury Tales and other works by the greatest English writer before Shakespeare. In studying Chaucer's medieval masterpiece, students will encounter a variety of tales and tellers, with subject matter that ranges from broad and bawdy humour through subtle social satire to moral fable.Pre-1900 course", "code": "ENGC29H3"}, "ENGD53H3": {"breath_req": "Arts, Literature & Language", "description": "Advanced study of a genre or genres not typically categorized as literature, including different theoretical approaches and/or the historical development of a genre. Possible topics might include science fiction, fantasy, gothic, horror, romance, childrens or young adult fiction, or comics and graphic novels.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD53H3  Studies in Popular Genres ", "code": "ENGD53H3"}, "ENGB74H3": {"breath_req": "Arts, Literature & Language", "description": "An interdisciplinary exploration of the body in art, film, photography, narrative and popular culture. This course will consider how bodies are written or visualized as \"feminine\" or \"masculine\", as heroic, as representing normality or perversity, beauty or monstrosity, legitimacy or illegitimacy, nature or culture. ", "exclusions": {"list": ["VPAC47H3", "VPHC47H3", "ENGC76H3"], "str": "(VPAC47H3), (VPHC47H3), (ENGC76H3)"}, "title": "ENGB74H3  The Body in Literature and Film ", "code": "ENGB74H3"}, "ENGB76H3": {"breath_req": "Arts, Literature & Language", "description": "An investigation of film genres such as romance, gothic, and science fiction from 1895 to the present alongside examples of twentieth-century prose and poetry. We will look at the way cinema developed and created new mythologies that helped people organize the experience of modern life.", "exclusions": {"list": ["ENG238H"], "str": "(ENG238H)"}, "title": "ENGB76H3  Cinema and Modernity II ", "code": "ENGB76H3"}, "ENGD26Y3": {"description": "Advanced study of the writing of poetry for students who have excelled at the introductory and intermediate levels. Admission by portfolio. The portfolio should contain 15-25 pages of your best poetry and a 500-word description of your project. Please email your portfolio to dtysdal@utsc.utoronto.ca by the last Friday of April (for Independent Studies beginning in either the Fall or Winter semesters).", "prerequisite": {"list": ["ENGB60H3", "ENGC86H3"], "str": "ENGB60H3 and ENGC86H3 and 1 other C-level Creative Writing course and permission of the instructor."}, "title": "ENGD26Y3  Independent Studies in Creative Writing: Poetry ", "code": "ENGD26Y3"}, "ENGB03H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the literary analysis of narrative. This course will study closely a small number of narratives and narrative genres from different periods in order to develop the critical skills to analyse narratives.", "exclusions": {"list": ["ENG110Y"], "str": "ENG110Y"}, "title": "ENGB03H3  Critical Thinking About Narrative ", "code": "ENGB03H3"}, "EESD19H3": {"breath_req": "Natural Sciences", "description": "This course consists of 12 lectures given by senior industry professionals to prepare students for a post-graduate career in environmental consulting. Lectures will convey the full range of consulting activities, including visits to environmental investigation sites in the Toronto area. Technical writing and oral communication skills will be stressed in assignments.", "prerequisite": {"list": [], "str": "Students must be enrolled in the 4th year of their Environmental Science Program."}, "title": "EESD19H3  Professional Development Seminars in Geoscience ", "code": "EESD19H3"}, "STEB07H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["IMCB03H3", "CHMA11H3", "CHMC11H3", "CHMB16H3", "STEB07H3", "STEB07H3", "CHMC11H3", "CHMB16H3"], "str": "IMCB03H3 or CHMA11H3 and permission of instructor Note:  CHMC11H3 or CHMB16H3 may be taken after STEB07H3, but STEB07H3 cannot be taken after CHMC11H3 or CHMB16H3"}, "title": "STEB07H3  Analytical Chemistry and Applications ", "exclusions": {"list": ["CHMC11H3", "CHMB16H3"], "str": "CHMC11H3, CHMB16H3."}, "description": "Quantitative analysis with pharmaceutical precision and accuracy to industrial and environmental protocols. Standard wet chemistry and instrumental techniques, data analysis and presentation. Conformity with health, safety and environmental regulatory requirements. Limited to students enrolled in the Joint Specialist Program in Environmental Science and Technology or the Joint Specialist Program in Applied Microbiology. ", "code": "STEB07H3"}, "ENGC88H3": {"breath_req": "Arts, Literature & Language", "description": "An advanced study of the craft of creative non-fiction. Through in-depth discussion, close reading of exceptional texts and constructive workshop sessions, students will explore special topics in the genre such as: fact versus fiction, writing real people, the moral role of the author, the interview process, and how to get published. Students will also produce, workshop and rewrite an original piece of long-form creative non-fiction and prepare it for potential publication.", "prerequisite": {"list": ["ENGB63H3"], "str": "ENGB63H3"}, "title": "ENGC88H3  Creative Non-Fiction II ", "code": "ENGC88H3"}, "ESTD18H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "ESTD18H3  Environmental Studies Seminar Series ", "exclusions": {"list": ["EESD18H3"], "str": "EESD18H3"}, "description": "This course will be organized around the DPES seminar series, presenting guest lecturers around interdisciplinary environmental themes. Students will analyze major environmental themes and prepare presentations for in-class debate.Same as EESD18H3", "code": "ESTD18H3"}, "ENGD22H3": {"breath_req": "Arts, Literature & Language", "description": "This multi-genre creative writing course, designed around a specific theme or topic, will encourage interdisciplinary practice, experiential adventuring, and rigorous theoretical reflection through readings, exercises, field trips, projects, etc. Admission by portfolio. The portfolio should contain 10-20 pages of your best writing (any genre). Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": [], "str": "[0.5 credit at the B-level in Creative Writing] and [0.5 credit at the C-level in Creative Writing]"}, "title": "ENGD22H3  Special Topics in Creative Writing II ", "code": "ENGD22H3"}, "ENGB50H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of the development of a tradition of women's writing. This course explores the legacy and impact of writers such as Christine de Pizan, Julian of Norwich, Mary Wollstonecraft, Anne Bradstreet, Margaret Cavendish, Jane Austen, Mary Shelley, Emily Dickinson, and Margaret Fuller, and considers how writing by women has challenged and continues to transform the English literary canon.Pre-1900 course", "exclusions": {"list": ["ENG233Y"], "str": "(ENG233Y)"}, "title": "ENGB50H3  Women and Literature: Forging a Tradition ", "code": "ENGB50H3"}, "ENGC56H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of the relationship between written literature and film and television. What happens when literature influences film and vice versa, and when literary works are recast as visual media (including the effects of rewriting, reproduction, adaptation, serialization and sequelization)?", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC56H3  Literature and Media: From Page to Screen ", "code": "ENGC56H3"}, "MGED63H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEC61H3", "ECMC61H3"], "str": "MGEC61H3/(ECMC61H3)"}, "title": "MGED63H3  Financial Crises: Causes, Consequences and Policy Implications ", "exclusions": {"list": ["MGEC63H3", "ECMC63H3"], "str": "(MGEC63H3)/(ECMC63H3)"}, "description": "This course studies the causes, consequences and policy implications of recent financial crises. It studies key theoretical concepts of international finance such as exchange-rate regimes, currency boards, common currency, banking and currency crises. The course will describe and analyze several major episodes of financial crises, such as East Asia, Mexico and Russia in the 1990s, Argentina in the early 2000s, the U.S. and Greece in the late 2000s, and others in recent years.", "code": "MGED63H3"}, "ENGC38H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC38H3  Novel Genres: Fiction, Journalism, News, and Autobiography, 1640-1750 ", "exclusions": {"list": ["ENG322Y"], "str": "ENG322Y"}, "description": "An examination of generic experimentation that began during the English Civil Wars and led to the novel. We will address such authors as Aphra Behn and Daniel Defoe, alongside news, ballads, and scandal sheets; and look at the book trade, censorship, and the growth of the popular press.Pre-1900 course", "code": "ENGC38H3"}, "EESA06H3": {"breath_req": "Natural Sciences", "description": "This general interest course explores the composition, structure and origin of the Earth and the tectonic, chemical and biological processes that have evolved over the last 4.5 billion years. It explains how planet \"works\" as a complex system. It provides a fundamental basis for understanding many of the environmental challenges faced by human societies especially natural hazards, water shortages, and climate change, and the importance of natural resources to our economy.", "exclusions": {"list": ["GGR100Y", "GLG110H"], "str": "GGR100Y, GLG110H"}, "title": "EESA06H3  Introduction to Planet Earth ", "code": "EESA06H3"}, "MGEB05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3"], "str": "[MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] or [MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)]"}, "title": "MGEB05H3  Macroeconomic Theory and Policy ", "exclusions": {"list": ["MGEB06H3", "ECMB06H3", "ECMB05H3", "ECO202Y", "ECO208Y", "ECO209Y"], "str": "MGEB06H3/(ECMB06H3), (ECMB05H3), ECO202Y, ECO208Y, ECO209Y"}, "description": "Intermediate level development of the principles of macroeconomic theory. Topics covered include: theory of output, employment and the price level. This course does not qualify as a credit for either the Major in Economics for Management Studies or for the B.B.A.", "code": "MGEB05H3"}, "EESB18H3": {"breath_req": "Natural Sciences", "description": "This course is an investigation of the geological background and possible solutions to major hazards in the environment.Environmental hazards to be studied include: landslides, erosion, earthquakes, volcanic eruptions, asteroid impacts, flooding, glaciation, future climate change, subsidence, and the disposal of toxic wastes. This may be of interest to a wide range of students in the life, social, and physical sciences; an opportunity for the non-specialist to understand headline-making geological events of topical interest. No prior knowledge of the Earth Sciences is required.", "exclusions": {"list": ["EESA05H3", "GLG103H"], "str": "(EESA05H3), GLG103H"}, "title": "EESB18H3  Natural Hazards ", "code": "EESB18H3"}, "EESB16H3": {"breath_req": "Natural Sciences", "description": "Examines the origins and systems of production of the major plants and animals on which we depend for food. Interactions between those species and systems and the local ecology will be examined, looking at issues of over harvesting, genetic erosion, soil erosion, pesticide use, and impacts of genetically modified strains.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "EESB16H3  Feeding Humans - The Cost to the Planet ", "code": "EESB16H3"}, "STEC61H3": {"breath_req": "Natural Sciences", "description": "Each student will be assigned research on a different pollutant, which might be one of the following: heavy metal ions in water, mercury, aromatic solvents, polymeric resins, PCB's, halogenated solvents, organic acids, Freon or pesticides. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "prerequisite": {"list": ["CHMA11H3", "STEB21H3", "STEB07H3"], "str": "CHMA11H3 and STEB21H3 and STEB07H3"}, "title": "STEC61H3  Hazardous Wastes and Modern Industrial Processes ", "code": "STEC61H3"}, "ENGC30H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC30H3  Studies in Medieval Literature ", "exclusions": {"list": ["ENG311H"], "str": "ENG311H"}, "description": "A study of selected medieval texts by one or more authors.Pre-1900 course", "code": "ENGC30H3"}, "ENGC54H3": {"breath_req": "Arts, Literature & Language", "description": "An analysis of how gender and the content and structure of poetry, prose, and drama inform each other. Taking as its starting point Virginia Woolf's claim that the novel was the genre most accessible to women because it was not entirely formed, this course will consider how women writers across historical periods and cultural contexts have contributed to specific literary genres and how a consideration of gender impacts our interpretation of literary texts.", "exclusions": {"list": ["ENGB51H3"], "str": "(ENGB51H3)"}, "title": "ENGC54H3  Gender and Genre ", "code": "ENGC54H3"}, "ENGC59H3": {"breath_req": "Arts, Literature & Language", "description": "Analysis of space and place in literature. This course studies representations of space in literature - whether geographical, regional, or topographical - that offer conceptual alternatives to the nation, state, or tribe. Geographical or regional focus may change depending on instructor.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "SOCB58H3"], "str": "[ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]] or [SOCB58H3; and an additional 4.0 credits; and registration in the Minor in Culture, Creativity, and Cities]"}, "title": "ENGC59H3  Geography and Regionalism in Literature ", "code": "ENGC59H3"}, "MGED91H3": {"description": "These courses will normally be made available only to upper-level students whose interests are not covered by other courses and whose performance in Economics courses has been well above average. Not all faculty will be available for these courses in any single session.Note: Students must obtain consent from the Supervisor of Studies, supervising instructor and the Department of Management before registering for this course.", "exclusions": {"list": ["ECMD12H3"], "str": "(ECMD12H3)"}, "title": "MGED91H3  Supervised Reading ", "code": "MGED91H3"}, "MGEC71H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)"}, "title": "MGEC71H3  Money and Banking ", "exclusions": {"list": ["ECMC48H3"], "str": "(ECMC48H3)"}, "description": "There will be a focus on basic economic theory underlying financial intermediation and its importance to growth in the overall economy. The interaction between domestic and global financial markets, the private sector, and government will be considered.", "code": "MGEC71H3"}, "MGEC61H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)"}, "title": "MGEC61H3  International Economics: Finance ", "exclusions": {"list": ["ECMC61H3", "ECO230Y", "ECO328Y", "ECO365H"], "str": "(ECMC61H3), ECO230Y, ECO328Y, ECO365H"}, "description": "Macroeconomic theories of the balance of payments and the exchange rate in a small open economy. Recent theories of exchange-rate determination in a world of floating exchange rates. The international monetary system: fixed \"versus\" flexible exchange rates, international capital movements, and their implications for monetary policy.", "code": "MGEC61H3"}, "MGEC20H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC20H3  Economics of the Media ", "exclusions": {"list": ["ECMC20H3"], "str": "(ECMC20H3)"}, "description": "An examination of the role and importance of communications media in the economy. Topics to be covered include: the challenges media pose for conventional economic theory, historical and contemporary issues in media development, and basic media-research techniques. The course is research-oriented, involving empirical assignments and a research essay. ", "code": "MGEC20H3"}, "ENGC44H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the relation between self and other in narrative fiction. This course will examine three approaches to the self-other relation: the moral relation, the epistemological relation, and the functional relation. Examples will be chosen to reflect engagements with gendered others, with historical others, with generational others, with cultural and national others.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC44H3  Self and Other in Literature and Film ", "code": "ENGC44H3"}, "ENGB70H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the critical study of cinema, including films from a broad range of genres, countries, and eras, as well as readings representing the major critical approaches to cinema that have developed over the past century.", "exclusions": {"list": ["INI115Y"], "str": "INI115Y"}, "title": "ENGB70H3  Introduction to Cinema ", "code": "ENGB70H3"}, "STEC60H3": {"breath_req": "Natural Sciences", "description": "The movement of water in its natural state; techniques to measure and control the flow of surface and subsurface water. Current techniques to prevent contamination of subsurface water and surface water by chemical spills. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "prerequisite": {"list": ["EESB04H3", "STEB42H3"], "str": "EESB04H3 and STEB42H3"}, "title": "STEC60H3  Applied Hydrology and Spills Management ", "code": "STEC60H3"}, "ENGB17H3": {"breath_req": "Arts, Literature & Language", "description": "A study of fiction, drama, and poetry from the West Indies. The course will examine the relation of standard English to the spoken language; the problem of narrating a history of slavery and colonialism; the issues of race, gender, and nation; and the task of making West Indian literary forms.", "exclusions": {"list": ["ENG264H", "ENG270Y", "NEW223Y", "ENG253Y"], "str": "ENG264H, ENG270Y, (NEW223Y), (ENG253Y)"}, "title": "ENGB17H3  Contemporary Literature from the Caribbean ", "code": "ENGB17H3"}, "ENGB22H3": {"breath_req": "Arts, Literature & Language", "description": "A study of fiction, drama, and poetry from English-speaking Africa. The course will examine the relation of English-language writing to indigenous languages, to orality, and to audience, as well as the issues of creating art in a world of suffering and of de-colonizing the narrative of history.", "exclusions": {"list": ["ENGC72H3", "ENG278Y"], "str": "(ENGC72H3), ENG278Y"}, "title": "ENGB22H3  Contemporary Literature from Africa ", "code": "ENGB22H3"}, "ENGB25H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the Canadian short story. This course traces the development of the Canadian short story, examining narrative techniques, thematic concerns, and innovations that captivate writers and readers alike. ", "exclusions": {"list": ["ENG215H"], "str": "ENG215H"}, "title": "ENGB25H3  The Canadian Short Story ", "code": "ENGB25H3"}, "MGEA05H3": {"breath_req": "Social & Behavioural Sciences", "description": "Topics include output, employment, prices, interest rates and exchange rates. Although calculus is not used in this course, algebra and graphs are used extensively to illuminate economic analysis.Note: This course is not for students interested in applying to the Specialists in Management and Economics leading to the B.B.A or for the Major program in Economics.", "exclusions": {"list": ["MGEA06H3", "ECMA06H3", "ECMA05H3", "ECO100Y", "ECO105Y"], "str": "MGEA06H3/(ECMA06H3), (ECMA05H3), ECO100Y, ECO105Y"}, "title": "MGEA05H3  Introduction to Macroeconomics ", "code": "MGEA05H3"}, "EESC24H3": {"description": "An advanced supervised readings course that can be taken in any session. Students will follow structured independent readings in any area of Environmental Science. A description of the objectives and scope of the individual offering must be approved by the Supervisor of Studies. Two papers are required in the course; the supervisor and one other faculty member will grade them. The course may not be used as a substitute for EES Program requirements.", "prerequisite": {"list": [], "str": "A minimum GPA of 2.5, and 3 full credits in EES courses. Permission of the Supervisor of Studies."}, "title": "EESC24H3  Advanced Readings in Environmental Science ", "code": "EESC24H3"}, "ENGB31H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the romance a genre whose episodic tale of marvellous adventures and questing heroes have been both criticized and celebrated. This course looks at the range of a form stretching from Malory and Spenser through Scott and Tennyson to contemporary forms such as fantasy, science fiction, postmodern romance, and the romance novel.Pre-1900 course", "exclusions": {"list": ["ENGC31H3"], "str": "(ENGC31H3)"}, "title": "ENGB31H3  The Romance: In Quest of the Marvelous ", "code": "ENGB31H3"}, "ENGC33H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC33H3  Deceit, Dissent, and the English Civil Wars, 1603-1660 ", "exclusions": {"list": ["ENG304Y"], "str": "ENG304Y"}, "description": "A study of the poetry, prose, and drama written in England between the death of Queen Elizabeth in 1603 and the Restoration of the monarchy in 1660. This course will examine the innovative literature of these politically tumultuous years alongside debates concerning personal and political sovereignty, religion, censorship, ethnicity, courtship and marriage, and women's authorship.Pre-1900 course", "code": "ENGC33H3"}, "ENGD54H3": {"breath_req": "Arts, Literature & Language", "description": "An in-depth examination of a theme or topic though literary texts, films, and/or popular culture. This seminar course will be organized around a particular topic and will include texts from a variety of traditions. Topics might include, for example, Disability and Narrative or Technology in Literature and Popular Culture.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD54H3  Comparative Approaches to Literature and Culture ", "code": "ENGD54H3"}, "EESD15H3": {"breath_req": "Natural Sciences", "description": "This course consists of a study of the ways in which hazardous organic and inorganic materials can be removed or attenuated in natural systems. The theory behind various technologies, with an emphasis on bioremediation techniques and their success in practice. An introduction to the unique challenges associated with the remediation of surface and ground water environments, soils, marine systems, and contaminated sediments.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3", "CHMA10H3", "CHMA11H3", "PHYA10H3", "PHYA11H3"], "str": "BIOA01H3 and BIOA02H3 and CHMA10H3 and CHMA11H3 and [PHYA10H3 or PHYA11H3]"}, "title": "EESD15H3  Fundamentals of Site Remediation ", "code": "EESD15H3"}, "EESC34H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3 and an additional 9.5 credits"}, "title": "EESC34H3  Sustainability in Practice ", "exclusions": {"list": ["ESTC34H3"], "str": "ESTC34H3"}, "description": "This course is intended for students who would like to apply theoretical principles of environmental sustainability learned in other courses to real world problems. Students will identify a problem of interest related either to campus sustainability, a local NGO, or municipal, provincial, or federal government. Class meetings will consist of group discussions investigating key issues, potential solutions, and logistical matters to be considered for implementation of proposed solutions. Students who choose campus issues will also have the potential to actually implement their solutions. Grades will be based on participation in class discussions, as well as a final report and presentation.Same as ESTC34H3", "code": "EESC34H3"}, "EESB03H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA06H3", "EESA09H3"], "str": "EESA06H3 or EESA09H3"}, "title": "EESB03H3  Principles of Climatology ", "exclusions": {"list": ["GGR203H", "GGR312H"], "str": "GGR203H, GGR312H"}, "description": "This is an overview of the physical and dynamic nature of meteorology, climatology and related aspects of oceanography. Major topics include: atmospheric composition, nature of atmospheric radiation, atmospheric moisture and cloud development, atmospheric motion including air masses, front formation and upper air circulation, weather forecasting, ocean circulation, climate classification, climate change theory and global warming.", "code": "EESB03H3"}, "EESC04H3": {"breath_req": "Natural Sciences", "description": "Theoretical and practical aspect of the evolution of organismal diversity in a functional context; examination of species distributions and how these are organized for scientific study. Emphasis will be on the highly diverse invertebrate animals. Topics include biomes, dispersal, adaptation, speciation, extinction and the influence of climate history and humans.", "prerequisite": {"list": ["BIOB50H3"], "str": "BIOB50H3"}, "title": "EESC04H3  Biodiversity and Biogeography ", "code": "EESC04H3"}, "ESTD17Y3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "ESTD17Y3  Cohort Capstone Course in Environmental Studies ", "exclusions": {"list": ["EESD17Y3"], "str": "EESD17Y3"}, "description": "This course is designed to provide a strong interdisciplinary focus on specific environmental problems including the socioeconomic context in which environmental issues are resolved. The cohort capstone course is in 2 consecutive semesters, providing final year students the opportunity to work in a team, as environmental researchers and consultants, combining knowledge and skill-sets acquired in earlier courses. Group research to local environmental problems and exposure to critical environmental policy issues will be the focal point of the course. Students will attend preliminary meetings schedules in the Fall semester.Same as EESD17Y3", "code": "ESTD17Y3"}, "ENGA11H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of how literature reflects the artistic and cultural concerns that shaped the world after the Second World War. Building on ENGA10H3, this course will introduce students to university-level critical reading and interpretation, by analysing the writing of late twentieth-century men and women from a range of backgrounds and nationalities.", "exclusions": {"list": ["ENG140Y"], "str": "ENG140Y"}, "title": "ENGA11H3  Introduction to Twentieth-Century Literature and Film: 1945 to Today ", "code": "ENGA11H3"}, "EESD11H3": {"breath_req": "Natural Sciences", "description": "The motion of water at the hill slope and drainage basin scales. The relationship between surface and subsurface hydrological processes. Soil hydrologic processes emphasizing infiltration. Stream flow generation mechanisms, hydrometric and isotopic research methods. Problems of physically based and empirical modelling of hydrological processes. Snowmelt energetics and modelling.", "prerequisite": {"list": ["EESB04H3"], "str": "EESB04H3"}, "title": "EESD11H3  Advanced Watershed Hydrology ", "code": "EESD11H3"}, "ENGD68H3": {"description": "Topics might explore the representation of religion in literature, the way religious beliefs might inform the production of literature and literary values, or literature written by members of a particular religious group.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD68H3  Topics in Literature and Religion ", "code": "ENGD68H3"}, "ENGC91H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of late nineteenth- and early twentieth-century American realism and naturalism in literary and visual culture. This course will explore the work of writers such as Henry James, William Dean Howells, Edith Wharton, Charles Chesnutt, Stephen Crane, Frank Norris, Kate Chopin, and Theodore Dreiser alongside early motion pictures, photographs, and other images from the period.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC91H3  American Realisms ", "code": "ENGC91H3"}, "EESB20H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA01H3", "EESA06H3"], "str": "EESA01H3 and EESA06H3"}, "title": "EESB20H3  Sedimentology and Stratigraphy ", "exclusions": {"list": ["ESS331H", "ESS332H", "ERS313H"], "str": "ESS331H, ESS332H, ERS313H"}, "description": "Sedimentary basins hold the bulk of Earths rock record and are fundamental in the study of past environments, tectonic evolution, climates, and biosphere. This course will explore different basin types and the nature of their infills. The course will also emphasize the economic resources within sedimentary basins and paleoenvironmental significance.", "code": "EESB20H3"}, "ENGD28Y3": {"description": "Advanced study of the writing of a specific genre, or on a specific topic or theme, for students who have excelled at the introductory and intermediate levels. Admission by portfolio. The portfolio should contain 20-30 pages of your best work composed in your genre of choice and a 500-word description of your project. Please email your portfolio to dtysdal@utsc.utoronto.ca by the last Friday of April (for Independent Studies beginning in either the Fall or Winter semesters).", "prerequisite": {"list": ["ENGB60H3", "ENGC86H3", "ENGB61H3", "ENGC87H3"], "str": "[[ENGB60H3 and ENGC86H3] or [ENGB61H3 and ENGC87H3]] and 1 other C-level Creative Writing course and permission of the instructor."}, "exclusions": {"list": ["ENGD28H3"], "str": "(ENGD28H3)"}, "title": "ENGD28Y3  Independent Studies in Creative Writing: Special Topics ", "code": "ENGD28Y3"}, "ENGC27H3": {"breath_req": "Arts, Literature & Language", "description": "An historical exploration of comedy as a major form of dramatic expression. Comedy, like its more august counterpary tragedy, has been subjected to centuries of theoretical deliberation about its form and function. In this course, we will read representative works of dramatic comedy and consider how different ages have developed their own unique forms of comedy. Pre-1900 course", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "VPDB10H3", "VPDB11H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)] Alternative prerequisites: VPDB10H3 and VPDB11H3"}, "title": "ENGC27H3  Drama: Comedy ", "code": "ENGC27H3"}, "ENGD18H3": {"description": "Topics in the literature and culture of the long eighteenth century. Topics vary from year to year and might include a study of one or more authors, or the study of a specific literary or theatrical phenomenon.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD18H3  Topics in the Long Eighteenth Century, 1660-1830 ", "code": "ENGD18H3"}, "STEB43H3": {"breath_req": "Natural Sciences", "description": "Energy and mass in engineering systems, hydrostatics, fluid flow, Bernoulli's theorem. Pumping systems, head losses through hydraulic systems, the efficiency of pumps and motors. Process equipment systems with emphasis on pumps, pipes and valves. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "prerequisite": {"list": ["PHYA10H3", "PHYA11H3"], "str": "PHYA10H3 or PHYA11H3"}, "title": "STEB43H3  Engineering Equipment and Processes ", "code": "STEB43H3"}, "ENGC17H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGC16H3", "ENGB42H3"], "str": "ENGC16H3 or (ENGB42H3)"}, "title": "ENGC17H3  The Bible and Literature II ", "exclusions": {"list": ["ENGB43H3", "ENG200Y"], "str": "(ENGB43H3), (ENG200Y)"}, "description": "Literary analysis of the New Testament's narratives and other forms as well as consideration of selected literary texts and works of visual art that the New Testament has influenced. Topics to be discussed include repetition and difference in the four canonical Gospels, Jesus and the prophetic tradition, Paul and epistolary rhetoric, and the apocalyptic and political discourses of the Book of Revelation; some apocryphal works, such as the Infancy Gospel of Thomas, may also be discussed. Pre-1900 course", "code": "ENGC17H3"}, "ENGC11H3": {"breath_req": "Arts, Literature & Language", "description": "Poetry is often seen as distant from daily life. We will instead see how poetry is crucial in popular culture, which in turn impacts poetry. We will read such popular poets as Ginsberg and Plath, look at poetry in film, and consider song lyrics as a form of popular poetry.", "exclusions": {"list": ["ENGA18H3"], "str": "(ENGA18H3)"}, "title": "ENGC11H3  Poetry and Popular Culture ", "code": "ENGC11H3"}, "EESC33H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "1.5 full credits at the B-level or higher in EES and permission of instructor."}, "title": "EESC33H3  Environmental Science Field Course ", "exclusions": {"list": ["EEB310H"], "str": "(EEB310H)"}, "description": "A field course on selected topics in aquatic environments. Aquatic environmental issues require careful field work to collect related hydrological, meteorological, biological and other environmental data. This hands-on course will teach students the necessary skills for fieldwork investigations on the interactions between air, water, and biota.", "code": "EESC33H3"}, "ENGB19H3": {"breath_req": "Arts, Literature & Language", "description": "A study of literature in English from South Asia, with emphasis on fiction from India. The course will examine the relation of English-language writing to indigenous South Asian traditions, the problem of narrating a history of colonialism and Partition, and the task of transforming the traditional novel for the South Asian context.", "exclusions": {"list": ["ENG270Y", "ENG253Y"], "str": "ENG270Y, (ENG253Y)"}, "title": "ENGB19H3  Contemporary Literature from South Asia ", "code": "ENGB19H3"}, "ENGD57H3": {"description": "Advanced study of a selected Canadian writer or small group of writers. The course will pursue the development of a single author's work over the course of his or her entire career or it may focus on a small group of thematically or historically related writers.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "exclusions": {"list": ["ENGD51H3", "ENGD88H3"], "str": "(ENGD51H3), (ENGD88H3)"}, "title": "ENGD57H3  Studies in Major Canadian Writers ", "code": "ENGD57H3"}, "EESC19H3": {"breath_req": "Natural Sciences", "description": "The world's oceans constitute more than 70% of the earth's surface environments. This course will introduce students to the dynamics of ocean environments, ranging from the deep ocean basins to marginal seas to the coastal ocean. The large-scale water circulation is examined from an observationally based water mass analysis and from a theoretical hydro-dynamical framework. The circulation of marginal seas, the role of tides, waves and other currents are studied in terms of their effects upon the coastal boundary.", "prerequisite": {"list": ["EESB03H3"], "str": "EESB03H3"}, "title": "EESC19H3  Oceanography ", "code": "EESC19H3"}, "ENGD59H3": {"description": "This seminar will usually provide advanced intensive study of a selected American poet each term, following the development of the author's work over the course of his or her entire career. It may also focus on a small group of thematically or historically related poets.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD59H3  Topics in American Poetry ", "code": "ENGD59H3"}, "EESD33H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESB02H3", "EESB04H3", "EESC07H3"], "str": "EESB02H3 and EESB04H3 and EESC07H3"}, "title": "EESD33H3  Field Techniques ", "exclusions": {"list": ["EES330H", "GGR390H", "GGR379H"], "str": "EES330H, GGR390H, GGR379H"}, "description": "This course consists of a series of modules designed for students to gain practical skills necessary to investigate and characterize complex environmental systems. Field projects will allow students to collect scientific data that they will use to interpret the geology, hydrogeology, and chemistry of natural and anthropogenic environments.", "code": "EESD33H3"}, "ENGC39H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC39H3  The Early Novel in Context, 1740-1830 ", "exclusions": {"list": ["ENG322Y"], "str": "ENG322Y"}, "description": "A contextual study of the first fictions that contemporaries recognized as being the novel. We will examine the novel in the context of its readers; of neighbouring genres such as letters, non-fiction travel writing, conduct manuals; and of culture more generally. Authors might include Richardson, Fielding, Sterne, Burney, Austen and others.Pre-1900 course", "code": "ENGC39H3"}, "EESA07H3": {"breath_req": "Natural Sciences", "description": "This course consists of a survey of the planet's water resources and the major issues facing the use of water. Topics include: Earth, the watery planet; water, the last great resource; Canada's waters; Ontario's waters; water and man; water contamination; and protecting our waters. Case studies such as the Walkerton tragedy will be studied. No prior knowledge of environmental science is required.", "title": "EESA07H3  Water ", "code": "EESA07H3"}, "ENGC22H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC22H3  The Victorian Novel after 1860 ", "exclusions": {"list": ["ENG324Y"], "str": "ENG324Y"}, "description": "A study of major works of Victorian fiction, 1860-1901. This course examines the emergence of the sensation novel, fantasy and science fiction, and high Victorian realism. Authors studied might include George Eliot, Wilkie Collins, George MacDonald, Thomas Hardy, Robert Louis Stevenson, H.G. Wells, Joseph Conrad, or Rudyard Kipling.Pre-1900 course", "code": "ENGC22H3"}, "MGEB06H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MATA32H3", "MATA33H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3", "MATA32H3", "MATA33H3"], "str": "MGEA02H3(ECMA04H3) and MGEA06H3/(ECMA06H3) and [MATA32H3 and MATA33H3] (or equivalents). Students who have completed MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3) and [MATA32H3 and MATA33H3] (or equivalents) may be admitted with the permission of the Supervisor of Studies."}, "title": "MGEB06H3  Macroeconomic Theory and Policy: A Mathematical Approach ", "exclusions": {"list": ["MGEB05H3", "ECMB05H3", "ECMB06H3", "ECO202Y", "ECO208Y", "ECO209Y"], "str": "MGEB05H3/(ECMB05H3), (ECMB06H3), ECO202Y, ECO208Y, ECO209Y"}, "description": "Intermediate level development of the principles of macroeconomic theory. The course will cover the same topics as MGEB05H3/(ECMB05H3), but will employ techniques involving calculus so as to make the theory clearer to students. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEB06H3"}, "ENGD30H3": {"description": "Topics in the literature and culture of the medieval period. Topics vary from year to year and might include a study of one or more authors.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD30H3  Topics in Medieval Literature ", "code": "ENGD30H3"}, "ENGC05H3": {"breath_req": "Arts, Literature & Language", "description": "A creative investigation into the intersections between poetry and new media (from wikis to cell phones to social media) undertaken through discussions, readings, and workshop sessions. Admission by portfolio. The portfolio should contain 5-10 pages of your best poetry. Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": ["ENGB61H3"], "str": "ENGB61H3"}, "title": "ENGC05H3  Creative Writing: Poetry and New Media ", "code": "ENGC05H3"}, "EESB05H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA01H3", "EESA06H3"], "str": "EESA01H3 or EESA06H3"}, "title": "EESB05H3  Principles of Soil Science ", "exclusions": {"list": ["GGR205H"], "str": "GGR205H"}, "description": "A study of the processes of pedogenesis and the development of diverse soil profiles, their field relationships and their response to changing environmental conditions.An examination of the fundamental soil properties of importance in soil management. An introduction to the techniques of soil examination in the field, soil analysis in the laboratory and the basic principles of soil classification.", "code": "EESB05H3"}, "MGEC52H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEC51H3", "ECMC51H3", "MGEB02H3", "ECMB02H3", "MGEB12H3", "ECMB12H3"], "str": "MGEC51H3/(ECMC51H3) and MGEB02H3/(ECMB02H3) and MGEB12H3/(ECMB12H3)"}, "title": "MGEC52H3  Labour Economics II ", "exclusions": {"list": ["ECMC52H3", "MGEC58H3", "ECMC58H3", "ECO239Y", "ECO339Y", "ECO361Y"], "str": "(ECMC52H3), MGEC58H3/(ECMC58H3), ECO239Y, ECO339Y, ECO361Y"}, "description": "A continuation of MGEC51H3/(ECMC51H3). Topics covered will include: unions; wage structures; sex and race discrimination; human capital theory; investment in education. Policy issues discussed will include: pay equity; affirmative action; training initiatives; and migration.", "code": "MGEC52H3"}, "MGEC81H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC81H3  Economic Development ", "exclusions": {"list": ["ECMC66H3", "ECO324Y"], "str": "(ECMC66H3), ECO324Y"}, "description": "An introduction to the processes of growth and development in less developed countries and regions. Topics include economic growth, income distribution and inequality, poverty, health, education, population growth, rural and urban issues, and risk in a low-income environment.", "code": "MGEC81H3"}, "ENGB75H3": {"breath_req": "Arts, Literature & Language", "description": "An investigation of film genres such as melodrama, film noir, and the western from 1895 to the present alongside examples of twentieth-century prose and poetry. We will look at the creation of an ideological space and of new mythologies that helped organize the experience of modern life.", "title": "ENGB75H3  Cinema and Modernity I ", "code": "ENGB75H3"}, "ENGD80H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the remarkable contribution of women writers to the development of Canadian writing. Drawing from a variety of authors and genres (including novels, essays, poems, autobiographies, biographies, plays, and travel writing), this course will look at topics in women and Canadian literature in the context of theoretical questions about women's writing.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD80H3  Women and Canadian Writing ", "code": "ENGD80H3"}, "ENGD14H3": {"description": "An advanced inquiry into critical questions relating to the development of sixteenth- and seventeenth-century English literature and culture. Focus may include the intensive study of an author, genre, or body of work.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "title": "ENGD14H3  Topics in Early Modern English Literature and Culture ", "code": "ENGD14H3"}, "MGED70H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MGEC11H3", "ECMC11H3", "MGEC72H3", "ECMC49H3", "MGFC10H3", "MGTC09H3"], "str": "MGEC11H3/(ECMC11H3) and [MGEC72H3/(ECMC49H3) or MGFC10H3/(MGTC09H3)]"}, "title": "MGED70H3  Financial Econometrics ", "exclusions": {"list": ["ECMD70H3", "ECO462H"], "str": "(ECMD70H3), ECO462H"}, "description": "Financial econometrics applies statistical techniques to analyze the financial data in order to solve problems in Finance. In doing so, this course will focus on four major topics: Forecasting returns, Modeling Univariate and Multivariate Volatility, High Frequency and market microstructure, Simulation Methods and the application to risk management.", "code": "MGED70H3"}, "MGEA01H3": {"breath_req": "Social & Behavioural Sciences", "description": "Economic theory of the firm and the consumer. Although calculus is not used in this course, algebra and graphs are used extensively to illuminate economic analysis.Note: This course is not for students interested in applying to the Specialists in Management and Economics leading to the B.B.A or for the Major program in Economics.", "exclusions": {"list": ["MGEA02H3", "ECMA04H3", "ECMA01H3", "ECO100Y", "ECO105Y"], "str": "MGEA02H3/(ECMA04H3), (ECMA01H3), ECO100Y, ECO105Y"}, "title": "MGEA01H3  Introduction to Microeconomics ", "code": "MGEA01H3"}, "ENGC01H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces students to a diverse selection of recent writing by Indigenous authors in Canada/Turtle Island, including novels, poetry, drama, essay, oratory and autobiography. Discussion of literature is grounded in Indigenous literary criticism, which addresses such issues as appropriation of voice, language, land, spirituality, orality, colonialism, gender, hybridity, authenticity, resistance, sovereignty and anti-racism.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC01H3  Indigenous Literature in Canada: Turtle Island ", "code": "ENGC01H3"}, "EESD02H3": {"breath_req": "Natural Sciences", "description": "Natural hydrochemical processes; the use of major ions, minor ions, trace metals and environmental isotopes in studying the occurrence and nature of ground water flow. Point and non-point sources of ground water contamination and the mechanisms of contaminant transport.", "prerequisite": {"list": [], "str": "At least 1 full credit in Environmental Science at the C-level."}, "title": "EESD02H3  Contaminant Hydrogeology ", "code": "EESD02H3"}, "ENGB52H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of the many intersections between the worlds of literature and science. The focus will be on classic and contemporary works of fiction, non-fiction, poetry and drama that have illuminated, borrowed from or been inspired by the major discoveries and growing cultural significance of the scientific enterprise.", "title": "ENGB52H3  Literature and Science ", "code": "ENGB52H3"}, "EESB17H3": {"breath_req": "Social & Behavioural Sciences", "description": "Competition for water resources between countries is common; population and economic growth are exacerbating this. The socio-political, environmental and economic aspects of transboundary water transfers are explored; the success of relevant international treaties and conventions, and the potential for integrated management of transboundary waters are assessed. Examples from Asia, Africa and the Middle East are presented.", "prerequisite": {"list": ["EESA01H3", "EESA07H3"], "str": "EESA01H3 or EESA07H3"}, "title": "EESB17H3  Hydro Politics and Transboundary Water Resources Management ", "code": "EESB17H3"}, "ENGB33H3": {"breath_req": "Arts, Literature & Language", "description": "A continuation of ENGB32H3, this course introduces students to selected dramatic comedies, tragedies and romances and situates Shakespeare's works in the literary, social and political contexts of early modern England. Our readings will be supplemented by studies of Shakespeare's sources and influences, short theoretical writings, and film excerpts. Pre-1900 course.", "exclusions": {"list": ["ENGB10H3", "ENG220Y"], "str": "(ENGB10H3), ENG220Y"}, "title": "ENGB33H3  Shakespeare in Context II ", "code": "ENGB33H3"}, "EESC16H3": {"breath_req": "Natural Sciences", "description": "Many environmental problems can only be assessed by collecting geological and other environmental data in the field. This course will provide students with the necessary skills for fieldwork investigations in a range of environments. The camp is held annually either in May or late August. Locations for the camp include Costa Rica, Rockies, Arizona, and Appalachians.", "prerequisite": {"list": [], "str": "Permission of the instructors."}, "title": "EESC16H3  Field Camp I ", "code": "EESC16H3"}, "ENGC84H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces students to cinema by, and about, immigrants, refugees, migrants, and exiles. Using a comparative world cinema approach, the course explores how the aesthetics and politics of the cinema of migration challenge theories of regional, transnational, diasporic, and global cinemas.", "prerequisite": {"list": ["ENGB70H3", "ENGC71H3"], "str": "ENGB70H3 or ENGC71H3"}, "title": "ENGC84H3  Cinema and Migration ", "code": "ENGC84H3"}, "ENGB08H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of Early American literature in historical context from colonization to the Civil War. This introductory survey places a wide variety of genres including conquest and captivity narratives, theological tracts, sermons, and diaries, as well as classic novels and poems in relation to the multiple subcultures of the period.Pre-1900 course", "exclusions": {"list": ["ENG250Y"], "str": "ENG250Y"}, "title": "ENGB08H3  American Literature to 1860 ", "code": "ENGB08H3"}, "ENGD60H3": {"description": "This seminar course will usually provide advanced intensive study of a selected American prose-writer each term, following the development of the author's work over the course of his or her entire career. It may also focus on a small group of thematically or historically related prose-writers.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD60H3  Topics in American Prose ", "code": "ENGD60H3"}, "ENGD08H3": {"breath_req": "Arts, Literature & Language", "description": "This advanced seminar will provide intensive study of a selected topic in African literature written in English; for example, a single national literature, one or more authors, or a literary movement.", "prerequisite": {"list": ["AFSA01H3", "ENGB22H3", "ENGC72H3"], "str": "2 C-level courses in English or [AFSA01H3 and [ENGB22H3 or (ENGC72H3)]]"}, "title": "ENGD08H3  Topics in African Literature ", "code": "ENGD08H3"}, "ENGD98Y3": {"description": "An intensive year-long seminar that supports students in the development of a major independent scholarly project. Drawing on workshops and peer review, bi-monthly seminar meetings will introduce students to advanced research methodologies in English and will provide an important framework for students as they develop their individual senior essays. Depending on the subject area of the senior essay, this course can be counted towards the Pre-1900 requirement.", "prerequisite": {"list": [], "str": "Minimum GPA of 3.5 in English courses; 15.0 credits, of which at least 2.0 must be at the C-or D-level in English."}, "exclusions": {"list": ["ENG490Y"], "str": "ENG490Y"}, "title": "ENGD98Y3  Senior Essay and Capstone Seminar ", "code": "ENGD98Y3"}, "MGEC31H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC31H3  Economics of the Public Sector: Taxation ", "exclusions": {"list": ["ECMC31H3", "MGEC91H3", "ECMC91H3", "ECO336Y"], "str": "(ECMC31H3), MGEC91H3/(ECMC91H3), ECO336Y"}, "description": "A course concerned with the revenue side of government finance. In particular, the course deals with existing tax structures, in Canada and elsewhere, and with criteria for tax design.", "code": "MGEC31H3"}, "ENGB45H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the poetry and prose of the Victorian period, 1837-1901. Representative authors will be studied in the context of a culture in transition, in which questions about democracy, the rights of women, national identity, imperialism, science and religion, and the place of the arts in everyday life were prominent.Pre-1900 course", "title": "ENGB45H3  Victorian Literature ", "code": "ENGB45H3"}, "ESTD19H3": {"breath_req": "Natural Sciences", "description": "A practical introduction to the concept of 'risk' as utilized in environmental decision-making. Students are introduced to risk analysis and assessment procedures as applied in business, government, and civil society. Three modules take students from relatively simple determinations of risk (e.g., infrastructure flooding) towards more complex, real-world, inclusive considerations (e.g., ecosystem impacts of climate change).", "prerequisite": {"list": ["STAB22H3"], "str": "14.5 credits and STAB22H3 (or equivalent)"}, "title": "ESTD19H3  Risk ", "code": "ESTD19H3"}, "MGEC58H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3"], "str": "MGEB02H3/(ECMB02H3)"}, "title": "MGEC58H3  Economics of Human Resource Management ", "exclusions": {"list": ["ECMC58H3", "MGEC52H3", "ECMC52H3", "ECO339Y"], "str": "(ECMC58H3), MGEC52H3/(ECMC52H3), ECO339Y"}, "description": "This course focuses on the various methods that firms and managers use to pay, recruit and dismiss employees. Topics covered may include: training decisions, deferred compensation, variable pay, promotion theory, incentives for teams and outsourcing.", "code": "MGEC58H3"}, "ENGC16H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC16H3  The Bible and Literature I ", "exclusions": {"list": ["ENGB42H3", "ENG200Y"], "str": "(ENGB42H3), (ENG200Y)"}, "description": "Literary analysis of the Hebrew Bible (Christian Old Testament) and its profound influence on literature. This course considers both the literary nature of and the influence on literature of such narratives as the fall of Adam and Eve, Noah's flood, Abraham's binding of Isaac, and the story of Moses, The Song of Solomon, Job, Jonah, Jeremiah.Pre-1900 course", "code": "ENGC16H3"}, "STEB42H3": {"breath_req": "Natural Sciences", "description": "The characteristics of raw water and wastewater, water supply systems, sources of supply, methods of treatment, alternative sources of water and methods of distribution. The disposal of wastewater, the collection system and sewage treatment methods. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "title": "STEB42H3  Water Quality Control ", "code": "STEB42H3"}, "ENGD93H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD93H3  Theoretical Approaches to Cinema ", "exclusions": {"list": ["INI214Y"], "str": "INI214Y"}, "description": "Advanced study of theories and critical questions that inform current directions in cinema studies.", "code": "ENGD93H3"}, "ENGD84H3": {"breath_req": "Arts, Literature & Language", "description": "An analysis of features of Canadian writing at the end of the twentieth and the beginning of the twenty-first century. This course will consider such topics as changing themes and sensibilities, canonical challenges, and millennial and apocalyptic themes associated with the end of the twentieth century.", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "title": "ENGD84H3  Canadian Writing for the New Century ", "code": "ENGD84H3"}, "STEB40H3": {"breath_req": "Natural Sciences", "description": "The principles of Environmental Biology: water, air and soil testing procedures. Analysis of contaminated and spiked samples using Ministry of Environment and Industry standards, procedures and protocols. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "prerequisite": {"list": ["BIOA02H3", "IMCB01H3"], "str": "BIOA02H3 and IMCB01H3"}, "title": "STEB40H3  Applied Environmental Microbiology ", "code": "STEB40H3"}, "ENGC06H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the writing of comics undertaken through discussions, readings, and workshop sessions. Admission by portfolio. The portfolio should contain 10-20 pages of a complete script or a script in progress. Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of October (for a Winter semester offering).", "prerequisite": {"list": ["ENGB61H3"], "str": "ENGB61H3"}, "title": "ENGC06H3  Creative Writing: Writing for Comics ", "code": "ENGC06H3"}, "ENGD89H3": {"description": "Topics vary from year to year and might include Victorian children's literature; city and country in Victorian literature; science and nature in Victorian writing; aestheticism and decadence; or steampunk.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "exclusions": {"list": ["ENG443Y"], "str": "ENG443Y"}, "title": "ENGD89H3  Topics in the Victorian Period ", "code": "ENGD89H3"}, "ENGB39H3": {"breath_req": "Arts, Literature & Language", "description": "This course considers the relationship between modern fantasy and medieval literature through the work of J.R.R. Tolkien. A professor of medieval literature at Oxford, Tolkien used his academic research to develop the mythology, language, and literature of Middle Earth. This course will survey both Tolkien's writing, including the Lord of the Rings trilogy, and the medieval poetry that inspired it, from Old English heroic epic to Welsh folklore. Throughout, we will consider how and why the middle ages offer such compelling material for 20th and 21st century fantasy. ", "title": "ENGB39H3  Tolkien's Middle Ages ", "code": "ENGB39H3"}, "ENGB09H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB08H3"], "str": "ENGB08H3"}, "title": "ENGB09H3  American Literature from the Civil War to the Present ", "exclusions": {"list": ["ENG250Y"], "str": "ENG250Y"}, "description": "An introductory survey of major novels, short fiction, poetry, and drama produced in the aftermath of the American Civil War. Exploring texts ranging from The Adventures of Huckleberry Finn to Rita Dove's Thomas and Beulah, this course will consider themes of immigration, ethnicity, modernization, individualism, class, and community.", "code": "ENGB09H3"}, "EESD16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "EESD16H3  Project Management in Environmental Studies ", "exclusions": {"list": ["ESTD16H3"], "str": "ESTD16H3"}, "description": "Students will select a research problem in an area of special interest. Supervision will be provided by a faculty member with active research in geography, ecology, natural resource management, environmental biology, or geosciences as represented within the departments. Project implementation, project monitoring and evaluation will form the core elements for this course. Same as ESTD16H3", "code": "EESD16H3"}, "ENGC09H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB06H3", "ENGB07H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3)]] or ENGB06H3 or ENGB07H3"}, "title": "ENGC09H3  Canadian Poetry ", "exclusions": {"list": ["ENG354Y"], "str": "ENG354Y"}, "description": "A study of contemporary Canadian poetry in English, with a changing emphasis on the poetry of particular time-periods, regions, and communities. Discussion will focus on the ways poetic form achieves meaning and opens up new strategies for thinking critically about the important social and political issues of our world.", "code": "ENGC09H3"}, "ENGB06H3": {"breath_req": "Arts, Literature & Language", "description": "A study of Canadian literature from pre-contact to 1920. This course explores the literatures of the 'contact zone,\" from Indigenous oral and textual literature, to European journals of exploration and discovery, to the literature of pioneer settlers, to the writing of the post-Confederation period.Pre-1900 course ", "exclusions": {"list": ["ENG252Y"], "str": "ENG252Y"}, "title": "ENGB06H3  Canadian Literature I: Imagining the Nation ", "code": "ENGB06H3"}, "MGEC54H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3"], "str": "MGEB02H3/(ECMB02H3)"}, "title": "MGEC54H3  Economics of Training and Education ", "exclusions": {"list": ["ECMC54H3", "ECO412Y"], "str": "(ECMC54H3), ECO412Y"}, "description": "This course studies the economic aspects of how individuals and firms make decisions: about education and on-the-job training. Economics and the business world consider education and training as investments. In this class, students will learn how to model these investments, and how to create good policies to encourage individuals and firms to make wise investment decisions.", "code": "MGEC54H3"}, "ESTC36H3": {"breath_req": "Social & Behavioural Sciences", "description": "Most environmental issues have many sides including scientific, social, cultural, ethical, political, and economic. Current national, regional and local problems will be discussed in class to help students critically analyze the roots of the problems and possible approaches to decision-making in a context of pluralism and complexity.", "prerequisite": {"list": ["ESTB01H3"], "str": "ESTB01H3"}, "title": "ESTC36H3  Knowledge, Ethics and Environmental Decision-Making ", "code": "ESTC36H3"}, "MGEC51H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3"], "str": "MGEB02H3/(ECMB02H3)"}, "title": "MGEC51H3  Labour Economics I ", "exclusions": {"list": ["ECMC51H3", "ECO239Y", "ECO339Y", "ECO361Y"], "str": "(ECMC51H3), ECO239Y, ECO339Y, ECO361Y"}, "description": "Applications of the tools of microeconomics to various labour market issues. The topics covered will include: labour supply; labour demand; equilibrium in competitive and non-competitive markets; non-market approaches to the labour market; unemployment. Policy applications will include: income maintenance programs; minimum wages; and unemployment.", "code": "MGEC51H3"}, "ENGA10H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of how literature reflects the artistic and cultural concerns that shaped the first part of the twentieth century. This course will introduce students to university-level critical reading and interpretation, by analysing the writing of early twentieth-century men and women.", "exclusions": {"list": ["ENG140Y"], "str": "ENG140Y"}, "title": "ENGA10H3  Introduction to Twentieth-Century Literature and Film: 1890 to World War II ", "code": "ENGA10H3"}, "ENGC71H3": {"breath_req": "Arts, Literature & Language", "description": "A continuation of ENGC70H3, focusing on texts written since 1980.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGC70H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)] and ENGC70H3"}, "title": "ENGC71H3  The Immigrant Experience in Literature since 1980 ", "code": "ENGC71H3"}, "MGEC37H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC37H3  Law and Economics ", "exclusions": {"list": ["ECMC37H3", "ECO320H", "ECO320Y"], "str": "(ECMC37H3), ECO320H, ECO320Y"}, "description": "A study of laws and legal institutions from an economic perspective. It includes the development of a positive theory of the law and suggests that laws frequently evolve so as to maximize economic efficiency. The efficiency of various legal principles is also examined. Topics covered are drawn from: externalities, property rights, contracts, torts, product liability and consumer protection, and procedure.", "code": "MGEC37H3"}, "EESD09H3": {"description": "The design, implementation, and reporting of a substantial research project involving laboratory and/or fieldwork. Existing faculty research allows a broad range of possible topics. The course should be undertaken after the end of the 3rd Year, subject to faculty availability. Faculty permission and supervision is required; open only to those students who have either completed or are undertaking specialist courses in the area of intended study. Students having a B+ or higher standing may be eligible for summer financial support from research projects.", "prerequisite": {"list": [], "str": "At least 1.0 credit at the C-level in EES courses and 0.5 credit at the C-level in CHM, or PHY courses."}, "exclusions": {"list": ["GLG470Y", "GLG471H"], "str": "GLG470Y, GLG471H"}, "title": "EESD09H3  Research Project in Environmental Science ", "code": "EESD09H3"}, "ENGD95H3": {"breath_req": "Arts, Literature & Language", "description": "A practical introduction to the tools, skills and knowledge-base required to publish in the digital age and to sustain a professional creative writing career. Topics include: the publishing landscape, pitching creative work, and employment avenues for creative writers. Will also include a workshop component (open to all genres).", "prerequisite": {"list": [], "str": "2 C-level courses in Creative Writing"}, "title": "ENGD95H3  Creative Writing as a Profession ", "code": "ENGD95H3"}, "MGEB11H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MATA32H3", "MATA33H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3", "MATA32H3", "MATA33H3"], "str": "MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3) and [MATA32H3 and MATA33H3] (or equivalents). Students who have completed MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3) and [MATA32H3 and MATA33H3] (or equivalents) may be admitted with the permission of the Supervisor of Studies."}, "title": "MGEB11H3  Quantitative Methods in Economics I ", "exclusions": {"list": ["ANTC35H3", "ECMB11H3", "ECO220Y", "ECO227Y", "PSYB07H3", "SOCB06H3", "STAB22H3", "STAB23H3", "STAB52H3", "STAB57H3"], "str": "ANTC35H3, (ECMB11H3), ECO220Y, ECO227Y, PSYB07H3, (SOCB06H3), STAB22H3, STAB23H3, STAB52H3, STAB57H3"}, "description": "An introduction to probability and statistics as used in economic analysis. Topics to be covered include: descriptive statistics, probability, special probability distributions, sampling theory, confidence intervals. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEB11H3"}, "ENGD94H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "2 courses at the C-level in English"}, "title": "ENGD94H3  Stranger Than Fiction: The Documentary Film ", "exclusions": {"list": ["INI325Y"], "str": "INI325Y"}, "description": "The study of films from major movements in the documentary tradition, including ethnography, cinema vérité, social documentary, the video diary, and \"reality television\". The course will examine the tensions between reality and representation, art and politics, technology and narrative, film and audience.", "code": "ENGD94H3"}, "EESC03H3": {"breath_req": "Quantitative Reasoning", "description": "This course focuses on the use of Geographic Information Systems (GIS) and Remote Sensing (RS) for solving a range of scientific problems in the environmental sciences and describing their relationship with - and applicability to - other fields of study (e.g. geography, computer science, engineering, geology, ecology and biology). Topics include (but are not limited to): spatial data types, formats and organization; geo-referencing and coordinate systems; remotely sensed image manipulation and analysis; map production.", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3 and 0.5 credit at the B-level in EES courses"}, "title": "EESC03H3  Geographic Information Systems and Remote Sensing ", "code": "EESC03H3"}, "EESD18H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "EESD18H3  Environmental Studies Seminar Series ", "exclusions": {"list": ["ESTD18H3"], "str": "ESTD18H3"}, "description": "This course will be organized around the DPES seminar series, presenting guest lecturers around interdisciplinary environmental themes. Students will analyze major environmental themes and prepare presentations for in-class debate. Same as ESTD18H3", "code": "EESD18H3"}, "ENGD55H3": {"breath_req": "Arts, Literature & Language", "description": "This advanced seminar will focus on a selected writer or a small group of writers whose literary work engages with themes of politics, revolution and/or resistance. The course will pursue the development of a single author's work over their entire career, or the development of a small group of thematically or historically related writers, and may include film and other media. Topics will vary year to year.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD55H3  Literature, Politics, Revolution ", "code": "ENGD55H3"}, "ENGB60H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the writing of poetry. This course will provide an introduction to the writing of poetry through workshop sessions. Admission by portfolio. ", "exclusions": {"list": ["ENG369Y"], "str": "(ENG369Y)"}, "title": "ENGB60H3  Creative Writing: Poetry I ", "code": "ENGB60H3"}, "ENGD52H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD52H3  Cinema: The Auteur Theory ", "exclusions": {"list": ["INI374H", "INI375H"], "str": "INI374H, INI375H"}, "description": "An exploration of the genesis of auteur theory. By focusing on a particular director such as Jane Campion, Kubrick, John Ford, Cronenberg, Chaplin, Egoyan, Bergman, Godard, Kurosawa, Sembene, or Bertolucci, we will trace the extent to which a director's vision can be traced through their body of work.", "code": "ENGD52H3"}, "ENGC19H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "ENGC19H3  Transnational Literature ", "exclusions": {"list": ["ENG370H"], "str": "ENG370H"}, "description": "The world is increasingly interrelated - economically, digitally, and culturally. Migrants and capitalists move across borders. So do criminals and terrorists. Writers, too, travel between countries; novels and films are set in various locales. How have writers had to re-invent generic conventions to imagine the world beyond the nation and the new links among distant places?", "code": "ENGC19H3"}, "MGEC41H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3"], "str": "MGEB02H3/(ECMB02H3)"}, "title": "MGEC41H3  Industrial Organization ", "exclusions": {"list": ["ECMC41H3", "MGEC92H3", "ECMC92H3", "ECO310Y"], "str": "(ECMC41H3), MGEC92H3/(ECMC92H3), ECO310Y"}, "description": "This course covers the economics of the firm in a market environment. The aim is to study business behaviour and market performance as influenced by concentration, entry barriers, product differentiation, diversification, research and development and international trade. There will be some use of calculus in this course.", "code": "MGEC41H3"}, "ENGC26H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of major dramatic tragedies in the classic and English tradition. European philosophers and literary critics since Aristotle have sought to understand and define the genre of tragedy, one of the oldest literary forms in existence. In this course, we will read representative works of dramatic tragedy and investigate how tragedy as a genre has evolved over the centuries.Pre-1900 course", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "VPDB10H3", "VPDB11H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)] Alternative pre/co-requisites: VPDB10H3 and VPDB11H3"}, "title": "ENGC26H3  Drama: Tragedy ", "code": "ENGC26H3"}, "MGEA06H3": {"breath_req": "Social & Behavioural Sciences", "description": "Study of the determinants of output, employment, prices, interest rates and exchange rates. Calculus, algebra and graphs are used extensively. The course is oriented towards students interested in the Specialist Program in Management, the Specialist program in Economics for Management Studies, and the Major Program in Economics for Management Studies.", "exclusions": {"list": ["MGEA05H3", "ECMA05H3", "ECMA06H3", "ECO100Y", "ECO105Y"], "str": "MGEA05H3/(ECMA05H3), (ECMA06H3), ECO100Y, ECO105Y"}, "title": "MGEA06H3  Introduction to Macroeconomics: A Mathematical Approach ", "code": "MGEA06H3"}, "STEC53H3": {"breath_req": "Natural Sciences", "description": "Ministry approved Industrial Auditing protocols. The presentation and manipulation of graphs, spreadsheets and tests, using popular software titles. The ISO series, with emphasis on EMS and ISO 14001. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "exclusions": {"list": ["STEC53H3", "EESC13H3"], "str": "STEC53H3 may not be taken after or concurrently with EESC13H3."}, "title": "STEC53H3  Environmental Audits, Sampling and Data Management ", "code": "STEC53H3"}, "MGEC72H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MGEB06H3", "ECMB06H3", "MGEB12H3", "ECMB12H3"], "str": "MGEB02H3/(ECMB02H3) and MGEB06H3/(ECMB06H3) and MGEB12H3/(ECMB12H3)"}, "title": "MGEC72H3  Financial Economics ", "exclusions": {"list": ["ECMC49H3", "ECO358H"], "str": "(ECMC49H3), ECO358H"}, "description": "This course introduces students to the theoretical underpinnings of financial economics. Topics covered include: intertemporal choice, expected utility, the CAPM, Arbitrage Pricing, State Prices (Arrow-Debreu security), market efficiency, the term structure of interest rates, and option pricing models. Key empirical tests are also reviewed. ", "code": "MGEC72H3"}, "ENGC83H3": {"breath_req": "Arts, Literature & Language", "description": "A study of Non-Western films. This course analyzes a selection of African, Asian, and Middle Eastern films both on their own terms and against the backdrop of issues of colonialism and globalization.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "SOCB58H3"], "str": "[ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]] or [SOCB58H3; and an additional 4.0 credits; and registration in the Minor in Culture, Creativity, and Cities]"}, "title": "ENGC83H3  Studies in World Cinema ", "code": "ENGC83H3"}, "ENGC13H3": {"breath_req": "Arts, Literature & Language", "description": "A survey of the literature of Native Peoples, Africans, Irish, Jews, Italians, Latinos, and East Asians in the U.S, focusing on one or two groups each term. We will look at how writers of each group register the affective costs of the transition from \"old-world\" communalism to \"new-world\" individualism.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB08H3", "ENGB09H3"], "str": "[ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]] or [ENGB08H3 and ENGB09H3]."}, "title": "ENGC13H3  Ethnic Traditions in American Literature ", "code": "ENGC13H3"}, "MGEC80H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3", "MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3) or MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)"}, "title": "MGEC80H3  Topics in North American Economic Development ", "exclusions": {"list": ["ECMC80H3", "ECO321Y"], "str": "(ECMC80H3), ECO321Y"}, "description": "A study of the history of economic development in North America. Students will survey current theoretical approaches in economic history, study particular topics in North American economic history, and develop hands-on practice in data collection and analysis.", "code": "MGEC80H3"}, "ENGB05H3": {"breath_req": "Arts, Literature & Language", "description": "Intensive training in critical writing about literature. Students learn essay-writing skills (explication; organization and argumentation; research techniques; bibliographies and MLA-style citation) necessary for the study of English at the university level through group workshops, multiple short papers, and a major research-based paper. This is not a grammar course; students are expected to enter with solid English literacy skills.", "exclusions": {"list": ["ENGB01H3"], "str": "(ENGB01H3)"}, "title": "ENGB05H3  Critical Writing about Literature ", "code": "ENGB05H3"}, "ENGC12H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of the tension in American literature between two conflicting concepts of self. We will examine the influence on American literature of the opposition between an abstract, \"rights-based,\" liberal-individualist conception of the self and a more traditional, communitarian sense of the self as determined by inherited regional, familial, and social bonds.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB08H3", "ENGB09H3"], "str": "[ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]] or [ENGB08H3 and ENGB09H3]"}, "title": "ENGC12H3  Individualism and Community in American Literature ", "code": "ENGC12H3"}, "MGEC06H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB06H3", "ECMB06H3", "MATA32H3", "MATA33H3"], "str": "MGEB06H3/(ECMB06H3) and [MATA32H3 and MATA33H3] (or equivalents)"}, "title": "MGEC06H3  Topics in Macroeconomic Theory ", "exclusions": {"list": ["ECMC06H3", "ECO202Y", "ECO208Y", "ECO209Y"], "str": "(ECMC06H3), ECO202Y, ECO208Y, ECO209Y"}, "description": "Continuing development of the principles of macroeconomic theory. The course will build on the theory developed in MGEB06H3/(ECMB06H3). Topics will be chosen from a list including consumption theory, investment, exchange rates, rational expectations, inflation, neo-Keynesian economics, monetary and fiscal policy. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEC06H3"}, "EESD17Y3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "EESD17Y3  Cohort Capstone Course in Environmental Studies ", "exclusions": {"list": ["ESTD17Y3"], "str": "ESTD17Y3"}, "description": "This course is designed to provide a strong interdisciplinary focus on specific environmental problems including the socioeconomic context in which environmental issues are resolved. The cohort capstone course is in 2 consecutive semesters, providing final year students the opportunity to work in a team, as environmental researchers and consultants, combining knowledge and skill-sets acquired in earlier courses. Group research to local environmental problems and exposure to critical environmental policy issues will be the focal point of the course. Students will attend preliminary meetings schedules in the Fall semester. Same as ESTD17Y3", "code": "EESD17Y3"}, "EESD06H3": {"breath_req": "Natural Sciences", "description": "Climate change over the last 150 years is reviewed by examining the climate record using both direct measurements and proxy data. Projection of future climate is reviewed using the results of sophisticated climate modeling. The climate change impact assessment formalism is introduced and applied to several examples. Students will acquire practical experience in climate change impact assessment through case studies.", "prerequisite": {"list": ["EESB03H3"], "str": "EESB03H3"}, "title": "EESD06H3  Climate Change Impact Assessment ", "code": "EESD06H3"}, "ENGD96H3": {"breath_req": "Arts, Literature & Language", "description": "This course examines the development of Iranian cinema, particularly experimental and art cinema. Questions of form, and the political and social dimensions of cinema, will be considered alongside the theory of national cinemas. The course places Iranian cinema in a global context by considering it with other national cinemas.", "prerequisite": {"list": [], "str": "At least one course (0.5 credit) at B- or C-level in film"}, "title": "ENGD96H3  Iranian Cinema ", "code": "ENGD96H3"}, "ENGC89H3": {"breath_req": "Arts, Literature & Language", "description": "This course connects writers of poetry and fiction, through discussion and workshop sessions, with artists from other disciplines in an interdisciplinary creative process, with the aim of having students perform their work. Preference will be given to students in Creative Writing, however, students in performance-based disciplines such as TAPS and Music and Culture may be admitted with the permission of the instructor. Admission is by portfolio.", "prerequisite": {"list": ["ENGB61H3", "ENGB62H3"], "str": "ENGB61H3 or ENGB62H3"}, "title": "ENGC89H3  Creative Writing and Performance ", "code": "ENGC89H3"}, "ENGC03H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB06H3", "ENGB07H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3)] or [ENGB06H3 or ENGB07H3]"}, "title": "ENGC03H3  Topics in Canadian Fiction ", "exclusions": {"list": ["ENG353Y", "ENG216Y"], "str": "ENG353Y, (ENG216Y)"}, "description": "An analysis of Canadian fiction with regard to the problems of representation. Topics considered may include how Canadian fiction writers have responded to and documented the local; social rupture and historical trauma; and the problematics of representation for marginalized societies, groups, and identities.", "code": "ENGC03H3"}, "ENGC51H3": {"breath_req": "Arts, Literature & Language", "description": "A study of Arab women writers from the late nineteenth century to the present. Their novels, short stories, essays, poems, and memoirs invite us to rethink western perceptions of Arab women; therefore, issues of gender, religion, class, nationalism, and colonialism will be examined from Arab women's perspectives, from both the Arab world and North America.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 & ENGB04H3 & [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC51H3  Contemporary Arab Women Writers ", "code": "ENGC51H3"}, "MGEC91H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC91H3  Economics and Government ", "exclusions": {"list": ["MGEC31H3", "ECMC31H3", "MGEC32H3", "ECMC32H3", "ECMC91H3", "ECO336Y"], "str": "MGEC31H3/(ECMC31H3), MGEC32H3/(ECMC32H3), (ECMC91H3), ECO336Y"}, "description": "This course provides an overview of what governments can do to benefit society, as suggested by economic theory and empirical research. It surveys what governments actually do, especially Canadian governments. Efficient methods of taxation and methods of controlling government are also briefly covered.Note: This course may be applied to the C-level course requirements of the Minor Program in Economics for Management Studies. It may not, however, be used to meet the requirements of any program that leads to a B.B.A. or of the Major Program in Economics for Management Studies.", "code": "MGEC91H3"}, "ESTC34H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3 and an additional 9.5 credits"}, "title": "ESTC34H3  Sustainability in Practice ", "exclusions": {"list": ["EESC34H3"], "str": "EESC34H3"}, "description": "This course is intended for students who would like to apply theoretical principles of environmental sustainability learned in other courses to real world problems. Students will identify a problem of interest related either to campus sustainability, a local NGO, or municipal, provincial, or federal government. Class meetings will consist of group discussions investigating key issues, potential solutions, and logistical matters to be considered for implementation of proposed solutions. Students who choose campus issues will also have the potential to actually implement their solutions. Grades will be based on participation in class discussions, as well as a final report and presentation.Same as EESC34H3", "code": "ESTC34H3"}, "EESC13H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "1.0 credit in EES courses"}, "title": "EESC13H3  Environmental Impact Assessment and Auditing ", "exclusions": {"list": ["GGR393H"], "str": "GGR393H"}, "description": "To familiarize students with the relevant legislation, qualitative and quantitative approaches and applications for environmental impact assessments and environmental auditing. The focus will be on the assessment of impacts to the natural environment, however, socio-economic impacts will also be discussed. Environmental auditing and environmental certification systems will be discussed in detail. Examples and case studies from forestry, wildlife biology and land use will be used to illustrate the principles and techniques presented in the course. Students will acquire \"hands-on\" experience in impact assessment and environmental auditing through case studies.", "code": "EESC13H3"}, "MGEB31H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3"], "str": "[MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] or [MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)]"}, "title": "MGEB31H3  Public Decision Making ", "exclusions": {"list": ["ECMB35H3"], "str": "(ECMB35H3)"}, "description": "A study of decision-making by governments from an economic perspective. The course begins by examining various rationales for public involvement in the economy and then examines a number of theories explaining the way decisions are actually made in the public sector. The course concludes with a number of case studies of Canadian policy making.", "code": "MGEB31H3"}, "ENGC02H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of three or more Canadian writers. This course will draw together selected major writers of Canadian fiction or of other forms. Topics vary from year to year and might include a focused study of major women writers; major racialized and ethnicized writers such as African-Canadian or Indigenous writers; major writers of a particular regional or urban location or of a specific literary period.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB06H3", "ENGB07H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3)] or [ENGB06H3 or ENGB07H3]"}, "title": "ENGC02H3  Major Canadian Authors ", "code": "ENGC02H3"}, "ENGC80H3": {"breath_req": "Arts, Literature & Language", "description": "Advanced study of a crucial period for the development of new forms of narrative and the beginnings of formal narrative theory, in the context of accelerating modernity.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC80H3  Modernist Narrative ", "code": "ENGC80H3"}, "ENGC86H3": {"breath_req": "Arts, Literature & Language", "description": "An intensive study of the writing of poetry through a selected theme, topic, or author. The course will undertake its study through discussions, readings, and workshop sessions. Admission by portfolio. The portfolio should contain 5-10 pages of your best poetry. Please email your portfolio to dtysdal@utsc.utoronto.ca by the first Tuesday of August (for a Fall semester offering) or by the first Monday of Octobeer (for a Winter semester offering).", "prerequisite": {"list": ["ENGB60H3"], "str": "ENGB60H3"}, "title": "ENGC86H3  Creative Writing: Poetry II ", "code": "ENGC86H3"}, "MGEC21H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3", "MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "[MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)] and [MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)]"}, "title": "MGEC21H3  Classics in the History of Economic Thought ", "exclusions": {"list": ["ECMC27H3", "ECO322Y", "ECO429Y"], "str": "(ECMC27H3), ECO322Y, ECO429Y"}, "description": "A study of the literature of economics, both past and current. Students will read economists important in the development of current economic thought, including Smith, Marx, and Keynes, and will also read the ideas of some important current economic thinkers. Emphasis is on primary sources rather than secondary commentaries.", "code": "MGEC21H3"}, "MGED06H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB12H3", "ECMB12H3", "MGEC06H3", "ECMC06H3"], "str": "MGEB12H3/(ECMB12H3) and MGEC06H3/(ECMC06H3)"}, "title": "MGED06H3  Advanced Macroeconomic Theory ", "exclusions": {"list": ["ECO325H", "ECMC14H3", "ECMD14H3"], "str": "ECO325H, (ECMC14H3), (ECMD14H3)"}, "description": "This course will review recent developments in macroeconomics, including new classical and new Keynesian theories of inflation, unemployment and business cycles. Enrolment is limited to students registered in programs requiring this course.", "code": "MGED06H3"}, "ENGD42H3": {"breath_req": "Arts, Literature & Language", "description": "Advanced study of a selected Modernist writer or small group of writers. The course will pursue the development of a single author's work over the course of his or her entire career or it may focus on a small group of thematically or historically related writers.", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "title": "ENGD42H3  Studies in Major Modernist Writers ", "code": "ENGD42H3"}, "EESD07H3": {"breath_req": "Natural Sciences", "description": "This field camp will familiarize students with several geological settings and modern environments. The camp is held annually either in May or late August. Locations for the camp include Costa Rica, Rockies, Arizona, and Appalachians.", "prerequisite": {"list": ["EESC16H3"], "str": "EESC16H3 and permission of the instructors"}, "title": "EESD07H3  Field Camp II ", "code": "EESD07H3"}, "ENGB34H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the short story as a literary form. This course examines the origins and recent development of the short story, its special appeal for writers and readers, and the particular effects it is able to produce.", "exclusions": {"list": ["ENG213H"], "str": "ENG213H"}, "title": "ENGB34H3  The Short Story ", "code": "ENGB34H3"}, "ENGB35H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to children's literature. This course will locate children's literature within the history of social attitudes to children and in terms of such topics as authorial creativity, race, class, gender, and nationhood.", "exclusions": {"list": ["ENG234H"], "str": "ENG234H"}, "title": "ENGB35H3  Children's Literature ", "code": "ENGB35H3"}, "ENGB07H3": {"breath_req": "Arts, Literature & Language", "description": "A continuation of ENGB06H3 introducing students to texts written since 1920 to the present day. Focusing on the development of Canada as an imagined national community, this course explores the challenges of imagining an ethical national community in the context of Canada's ongoing colonial legacy: its multiculturalism; Indigenous and Quebec nationalisms; and recent diasporic and transnational reimaginings of the nation and national belonging.", "exclusions": {"list": ["ENG252Y"], "str": "ENG252Y"}, "title": "ENGB07H3  Canadian Literature II: Re-imagining the Nation ", "code": "ENGB07H3"}, "ENGB30H3": {"breath_req": "Arts, Literature & Language", "description": "The goal of this course is to familiarize students with Greek and Latin mythology. Readings will include classical materials as well as imporatnt literary texts in English that retell classical myths. Pre-1900 Course", "exclusions": {"list": ["ENGC58H3", "ENGC60H3", "ENGC61H3"], "str": "(ENGC58H3), (ENGC60H3), (ENGC61H3)"}, "title": "ENGB30H3  Classical Myth and Literature ", "code": "ENGB30H3"}, "MGEB12H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MGEB11H3", "ECMB11H3", "STAB52H3", "STAB57H3", "MATA32H3", "MATA33H3"], "str": "[MGEB11H3/(ECMB11H3) or [STAB52H3 and STAB57H3]] and [MATA32H3 and MATA33H3] (or equivalents)"}, "title": "MGEB12H3  Quantitative Methods in Economics II ", "exclusions": {"list": ["ECMB12H3", "ECO220Y", "ECO227Y", "STAB27H3", "STAC67H3"], "str": "(ECMB12H3), ECO220Y, ECO227Y, STAB27H3, STAC67H3."}, "description": "A second course in probability and statistics as used in economic analysis. Topics to be covered include: confidence intervals, hypothesis testing, simple and multiple regression. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEB12H3"}, "EESD20H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "15.0 credits, including at least 4.0 credits at the C- or D-level"}, "title": "EESD20H3  Urban Environmental Problems of the Greater Toronto Area ", "exclusions": {"list": ["EESC21H3"], "str": "(EESC21H3)"}, "description": "The world is increasingly urban and cities are the focus of many acute environmental problems e.g., disposal of solid and liquid wastes, and contamination of soil, air and water. These issues will be reviewed for the GTA with reference to various field and geophysical methods used to explore contaminated sites, environmental audits, government legislation and guidelines issued by regulatory agencies, and site cleanup. This course teaches essential applied skills to students in Environmental Science.", "code": "EESD20H3"}, "ENGC18H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "ENGC18H3  Colonial and Postcolonial Literature ", "exclusions": {"list": ["ENG270Y"], "str": "ENG270Y"}, "description": "Over the course of five centuries, European empires changed the face of every continent. The present world bears the traces of those empires in the form of nation-states, capitalism, population transfers, and the spread of European languages. We will consider how empire and resistance to empire have been imagined and narrated in a variety of texts.", "code": "ENGC18H3"}, "ESTD16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "At least 14.5 credits"}, "title": "ESTD16H3  Project Management in Environmental Studies ", "exclusions": {"list": ["EESD16H3"], "str": "EESD16H3"}, "description": "Students will select a research problem in an area of special interest. Supervision will be provided by a faculty member with active research in geography, ecology, natural resource management, environmental biology, or geosciences as represented within the departments. Project implementation, project monitoring and evaluation will form the core elements for this course.Same as EESD16H3", "code": "ESTD16H3"}, "MGEC38H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3", "MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "[MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)] and [MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)]"}, "title": "MGEC38H3  The Economics of Canadian Public Policy ", "exclusions": {"list": ["ECMC38H3", "ECO336Y"], "str": "(ECMC38H3), ECO336Y"}, "description": "This course provides a comprehensive study of selected Canadian public policies from an economic point of view. Topics may include environmental policy, competition policy, inflation and monetary policy, trade policy and others. We will study Canadian institutions, decision-making mechanisms, implementation procedures, policy rationales, and related issues.", "code": "MGEC38H3"}, "EESA10H3": {"breath_req": "Natural Sciences", "description": "Because of pollution, our surroundings are becoming increasingly hazardous to our health. The past century has seen intense industrialization characterized by the widespread production and use of chemicals and the intentional and unintentional disposal of a wide range of waste materials. This course explores the relationship between the incidence of disease in human populations and the environmental pollution. Emphasis will be placed on understanding where and what pollutants are produced, how they are taken up by humans and their long term effects on health; the role of naturally-occurring carcinogens will also be examined. The course will include a view of risk assessment and toxicology using case studies. No prior knowledge of environmental or medical science is required.", "title": "EESA10H3  Human Health and the Environment ", "code": "EESA10H3"}, "ENGC78H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of negative utopias and post-apocalyptic worlds. The course will draw from novels such as 1984, Brave New World, Clockwork Orange, and Oryx and Crake, and films such as Metropolis, Mad Max, Brazil, and The Matrix. Why do we find stories about the world gone wrong so compelling?", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC78H3  Dystopian Visions in Fiction and Film ", "code": "ENGC78H3"}, "ENGC10H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB10H3", "ENGB32H3", "ENGB33H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3) or (ENGB10H3)]] and [ENGB32H3 or ENGB33H3]"}, "title": "ENGC10H3  Studies in Shakespeare ", "exclusions": {"list": ["ENG336H"], "str": "ENG336H"}, "description": "A study of the plays of Shakespeare. An in-depth study of select plays from Shakespeare's dramatic corpus combined with an introduction to the critical debates within Shakespeare studies. Students will gain a richer understanding of Shakespeare's texts and their critical reception.Pre-1900 course", "code": "ENGC10H3"}, "ENGC36H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [either ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC36H3  Literature and Culture, 1660-1750 ", "exclusions": {"list": ["ENG305H"], "str": "ENG305H"}, "description": "Studies in literature and literary culture during a turbulent era that was marked by extraordinary cultural ferment and literary experimentation. During this period satire and polemic flourished, Milton wrote his great epic, Behn her brilliant comedies, Swift his bitter attacks, and Pope his technically balanced but often viciously biased poetry.Pre-1900 course", "code": "ENGC36H3"}, "EESC20H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "EESB15H3"], "str": "CHMA10H3 and CHMA11H3 and EESB15H3"}, "title": "EESC20H3  Geochemistry ", "exclusions": {"list": ["EESD32H3", "CHM210H", "GLG202H", "GLG351H"], "str": "(EESD32H3), CHM210H, GLG202H, GLG351H"}, "description": "The course will cover fundamental aspects of chemical processes occurring at the Earth's surface. Terrestrial and aquatic geochemical processes such as: mineral formation and dissolution, redox, aqueous-solid phase interactions, stable isotopes, and organic geochemistry in the environment will be covered.", "code": "EESC20H3"}, "ENGD58H3": {"description": "Topics in the literature and culture of Canada. Topics vary from year to year and may include advanced study of ethics, haunting, madness, or myth; or a particular city or region.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "exclusions": {"list": ["ENGD51H3", "ENGD88H3"], "str": "(ENGD51H3), (ENGD88H3)"}, "title": "ENGD58H3  Topics in Canadian Literature ", "code": "ENGD58H3"}, "ENGC34H3": {"breath_req": "Arts, Literature & Language", "description": "A focused exploration of women's writing in the early modern period. This course considers the variety of texts produced by women (including closet drama, religious and secular poetry, diaries, letters, prose romance, translations, polemical tracts, and confessions), the contexts that shaped those writings, and the theoretical questions with which they engage.Pre-1900 course", "prerequisite": {"list": ["ENGB50H3", "ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB50H3 or [ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]]"}, "title": "ENGC34H3  Early Modern Women and Literature, 1500-1700 ", "code": "ENGC34H3"}, "ENGD91H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD91H3  Avant-Garde Cinema ", "exclusions": {"list": ["INI322Y"], "str": "INI322Y"}, "description": "An exploration of Avant-Garde cinema from the earliest experiments of German Expressionism and Surrealism to our own time. The emphasis will be on cinema as an art form aware of its own uniqueness, and determined to discover new ways to exploit the full potential of the \"cinematic\".", "code": "ENGD91H3"}, "ENGC42H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC42H3  Romanticism ", "exclusions": {"list": ["ENG308Y"], "str": "ENG308Y"}, "description": "A study of the Romantic Movement in European literature, 1750-1850. This course investigates the cultural and historical origins of the Romantic Movement, its complex definitions and varieties of expression, and the responses it provoked in the wider culture. Examination of representative authors such as Goethe, Rousseau, Wollstonecraft, Wordsworth, Coleridge, Blake, P. B. Shelley, Keats, Byron and M. Shelley will be combined with study of the philosophical and historical backgrounds of Romanticism.Pre-1900 course", "code": "ENGC42H3"}, "ENGD03H3": {"description": "A study of selected topics in recent literary theory. Emphasis may be placed on the oeuvre of a particular theorist or on the impact of a given theoretical movement; in either case, the relation of theory to literary critical practice will be considered , as will the claims made by theory across a range of aesthetic and political discourses and in response to real world demands. Recommended for students planning to pursue graduate study in English literature.", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "title": "ENGD03H3  Topics in Contemporary Literary Theory ", "code": "ENGD03H3"}, "MGED50H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MGEC02H3", "ECMC02H3", "MGEB06H3", "ECMB06H3", "MGEC06H3", "ECMC06H3", "MGEB11H3", "ECMB11H3", "MGEB12H3", "ECMB12H3", "MGEC11H3", "ECMC11H3"], "str": "MGEB02H3/(ECMB02H3) and MGEC02H3/(ECMC02H3) and MGEB06H3/(ECMB06H3) and MGEC06H3/(ECMC06H3) and MGEB11H3/(ECMB11H3) and MGEB12H3/(ECMB12H3) and MGEC11H3/(ECMC11H3). This course should be taken among the last 5 credits of a twenty-credit degree."}, "title": "MGED50H3  Workshop in Economic Research ", "exclusions": {"list": ["ECMD50H3"], "str": "(ECMD50H3)"}, "description": "This course introduces to students the techniques used by economists to define research problems and to do research. Students will choose a research problem, write a paper on their topic and present their ongoing work to the class.", "code": "MGED50H3"}, "MGEC32H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC32H3  Economics of the Public Sector: Expenditures ", "exclusions": {"list": ["ECMC32H3", "MGEC91H3", "ECMC91H3", "ECO336Y"], "str": "(ECMC32H3), MGEC91H3/(ECMC91H3), ECO336Y"}, "description": "A study of resource allocation in relation to the public sector, with emphasis on decision criteria for public expenditures. The distinction between public and private goods is central to the course.", "code": "MGEC32H3"}, "ENGD07H3": {"breath_req": "Arts, Literature & Language", "description": "The study of a poet or poets writing in English after 1950. Topics may include the use and abuse of tradition, the art and politics of form, the transformations of an oeuvre, and the relationship of poetry to the individual person and to the culture at large.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD07H3  Studies in Postmodern Poetry ", "code": "ENGD07H3"}, "ENGD29H3": {"breath_req": "Arts, Literature & Language", "description": "Advanced study of Chaucer that explores the process of writing poetry in fourteenth-century England. Specific topics vary from year to year and might include an exploration of Chaucer's cultural and literary contexts or a survey of contemporary critical approaches to Chaucer and Medieval English literature.", "prerequisite": {"list": ["ENGB27H3", "ENGC29H3"], "str": "ENGB27H3 and ENGC29H3"}, "title": "ENGD29H3  Chaucer at Work ", "code": "ENGD29H3"}, "EESD10Y3": {"description": "The design, implementation, and reporting of a substantial research project involving laboratory and/or fieldwork. Existing faculty research allows a broad range of possible topics. The course should be undertaken after the end of the 3rd Year, subject to faculty availability. Faculty permission and supervision is required; open only to those students who have either completed or are undertaking specialist courses in the area of intended study. Students having a B+ or higher standing may be eligible for summer financial support from research projects. Permission of the co-ordinator must be obtained.", "prerequisite": {"list": [], "str": "At least 1.0 credit at the C-level in EES courses and 0.5 credit at the C-level in CHM, or PHY courses."}, "exclusions": {"list": ["GLG470Y", "GLG471H"], "str": "GLG470Y, GLG471H"}, "title": "EESD10Y3  Research Project in Environmental Science ", "code": "EESD10Y3"}, "ENGD62H3": {"description": "An exploration of multicultural perspectives on issues of power, perception, and identity as revealed in representations of imperialism and colonialism from the early twentieth century to the present.", "prerequisite": {"list": [], "str": "2 C-level courses in English."}, "title": "ENGD62H3  Topics in Postcolonial Literature and Film ", "code": "ENGD62H3"}, "ENGD71H3": {"breath_req": "Arts, Literature & Language", "description": "A study of Arab North-American writers from the twentieth century to the present. Surveying one hundred years of Arab North-American literature, this course will examine issues of gender, identity, assimilation, and diaspora in poetry, novels, short stories, autobiographies and nonfiction.", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD71H3  Studies in Arab North-American Literature ", "code": "ENGD71H3"}, "ENGC07H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB06H3", "ENGB07H3", "VPDB10H3", "VPDB11H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3)]; or ENGB06H3 or ENGB07H3; Alternative prerequisites - [VPDB10H3 and VPDB11H3]"}, "title": "ENGC07H3  Canadian Drama ", "exclusions": {"list": ["ENG352H", "ENG223H"], "str": "ENG352H, (ENG223H)"}, "description": "A study of major Canadian playwrights with an emphasis on the creation of a national theatre, distinctive themes that emerge, and their relation to regional and national concerns. This course explores the perspectives of Qubcois, feminist, Native, queer, ethnic, and Black playwrights who have shaped Canadian theatre.", "code": "ENGC07H3"}, "EESC31H3": {"breath_req": "Natural Sciences", "description": "The last 2.5 million years has seen the repeated formation of large continental ice sheets over North America and Europe. The course will review the geologic and geomorphologic record of past glacial and interglacial climates, the formation and flow of ice sheets , and modern day cold-climate processes in Canada's north. The course includes a one-day field trip to examine the glacial record of the GTA.", "prerequisite": {"list": ["EESA06H3", "EESB20H3"], "str": "EESA06H3 and EESB20H3"}, "title": "EESC31H3  Glacial Geology ", "code": "EESC31H3"}, "ENGB02H3": {"breath_req": "Arts, Literature & Language", "description": "This course will provide science students with practical strategies, detailed instructions, and cumulative assignments to help them hone their ability to write clear, coherent, well-reasoned prose for academic and professional purposes. Topics will include scientific journal article formats and standards, peer-review, and rhetorical analysis (of both scientific and lay-science documents).", "exclusions": {"list": ["PCL285H"], "str": "PCL285H"}, "title": "ENGB02H3  Effective Writing in the Sciences ", "code": "ENGB02H3"}, "EESB15H3": {"breath_req": "Natural Sciences", "description": "Planet Earth is at least 4,400 million years old and a geological record exists for at least the last 3,900 million years in the form of igneous, metamorphic and sedimentary rocks. The changing dynamics of convection deep within the Earth's mantle and associated super-continent assembly and breakup along with meteorite impacts, are now recognized as the major controls on development of the planet's atmosphere, oceans, biology, climate and geo-chemical cycles. This course reviews this long history and the methods and techniques used by geologists to identify ancient environments.", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3"}, "title": "EESB15H3  Earth History ", "code": "EESB15H3"}, "EESC37H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA10H3", "PHYA11H3", "EESB15H3", "EESB20H3"], "str": "[PHYA10H3 or PHYA11H3] and EESB15H3 and EESB20H3"}, "title": "EESC37H3  Structural Geology ", "exclusions": {"list": ["GLG345H", "ESS241H"], "str": "GLG345H, ESS241H"}, "description": "The course introduces mechanics of rock deformation. It examines identification, interpretation, and mechanics of faults, folds, and structural features of sedimentary, igneous and metamorphic rocks as well as global, regional and local scale structural geology and tectonics. Lectures are supplemented by lab exercises and demonstrations as well as local field trips.", "code": "EESC37H3"}, "MGED11H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MGEB06H3", "ECMB06H3", "MGEB11H3", "ECMB11H3", "MGEB12H3", "ECMB12H3", "MGEC11H3", "ECMC11H3"], "str": "MGEB02H3/(ECMB02H3) and MGEB06H3/(ECMB06H3) and MGEB11H3/(ECMB11H3) and MGEB12H3/(ECMB12H3) and MGEC11H3/(ECMC11H3)"}, "title": "MGED11H3  Theory and Practice of Regression Analysis ", "exclusions": {"list": ["ECO327Y", "STA302H", "ECMC12H3", "ECMD10H3"], "str": "ECO327Y, STA302H, (ECMC12H3), (ECMD10H3)"}, "description": "This is an advanced course building on MGEC11H3/(ECMC11H3). Students will master regression theory, hypothesis and diagnostic tests, and assessment of econometric results. Treatment of special statistical problems will be discussed. Intensive computer-based assignments will provide experience in estimating and interpreting regressions, preparing students for MGED50H3/(ECMD50H3). Enrolment is limited to students registered in programs requiring this course.", "code": "MGED11H3"}, "ENGC70H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of twentieth-century literature, especially fiction, written out of the experience of people who leave one society to come to another already made by others. We will compare the literatures of several ethnic communities in at least three nations, the United States, Britain, and Canada.", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC70H3  The Immigrant Experience in Literature to 1980 ", "code": "ENGC70H3"}, "EESC07H3": {"breath_req": "Natural Sciences", "description": "Groundwater represents the world's largest and most important fresh water resource. This basic course in hydrogeology introduces the principles of groundwater flow and aquifer storage and shows how a knowledge of these fundamental tools is essential for effective groundwater resource management and protection. Special emphasis is placed on the practical methods of resource exploration and assessment; examples of the approach are given for aquifers under environmental stress in southern Ontario, the US and Africa.", "prerequisite": {"list": ["EESA06H3"], "str": "EESA06H3 and 1.0 full credit in B-level EES courses"}, "title": "EESC07H3  Groundwater ", "code": "EESC07H3"}, "ENGC50H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3", "ENGB08H3", "ENGB09H3"], "str": "[ENGB03H3 and ENGB04H3 and one of ENGB05H3 or (ENGB01H3)] or [ENGB08H3 and ENGB09H3]"}, "title": "ENGC50H3  Studies in Contemporary American Fiction ", "exclusions": {"list": ["ENG365H", "ENG361H"], "str": "ENG365H, (ENG361H)"}, "description": "Developments in American fiction from the end of the 1950s to the present. A study of fiction from the period that produced James Baldwin, Saul Bellow, Philip Roth, John Updike, Norman Mailer, Ann Beatty, Raymond Carver, Don DeLillo, Toni Morrison, Maxine Hong Kingston, and Leslie Marmon Silko. The course may be organized around themes or movements.", "code": "ENGC50H3"}, "MGEC62H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3"], "str": "MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)"}, "title": "MGEC62H3  International Economics: Trade Theory ", "exclusions": {"list": ["ECMC62H3", "MGEC93H3", "ECMC93H3", "ECO230Y", "ECO328Y", "ECO364H"], "str": "(ECMC62H3), MGEC93H3/(ECMC93H3), ECO230Y, ECO328Y, ECO364H"}, "description": "An outline of the theories of international trade that explain why countries trade with each other, and the welfare implications of this trade, as well as empirical tests of these theories. The determination and effects of trade policy instruments (tariffs, quotas, non-tariff barriers) and current policy issues are also discussed. ", "code": "MGEC62H3"}, "ENGD43H3": {"description": "Topics in the literature and culture of the Romantic movement. Topics vary from year to year and may include Romantic nationalism, the Romantic novel, the British 1790s, or American or Canadian Romanticism. Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD43H3  Topics in Romanticism, 1750-1850 ", "code": "ENGD43H3"}, "ENGD27Y3": {"description": "Advanced study of the writing of fiction or creative nonfiction for students who have excelled at the introductory and intermediate levels. Admission by portfolio. The portfolio should contain 30-40 pages of your best fiction or creative nonfiction and a 500-word description of your project. Please email your portfolio to awestoll@utsc.utoronto.ca by the last Friday of April (for Independent Studies beginning in either the Fall or Winter semesters).", "prerequisite": {"list": ["ENGB61H3", "ENGB63H3", "ENGC87H3", "ENGC88H3"], "str": "[ENGB61H3 or ENGB63H3] and [ENGC87H3 or ENGC88H3] and [1 other C-level Creative Writing course] and permission of the instructor"}, "exclusions": {"list": ["ENGD27H3"], "str": "(ENGD27H3)"}, "title": "ENGD27Y3  Independent Studies in Creative Writing: Prose ", "code": "ENGD27Y3"}, "ENGB38H3": {"breath_req": "Arts, Literature & Language", "description": "A study of extended narratives in the comic book form. This course combines formal analysis of narrative artwork with an interrogation of social, political, and cultural issues in this popular literary form. Works to be studied may include graphic novels, comic book series, and comic book short story or poetry collections. ", "exclusions": {"list": ["ENG235H", "ENGC57H3"], "str": "ENG235H, (ENGC57H3)"}, "title": "ENGB38H3  The Graphic Novel ", "code": "ENGB38H3"}, "MGEC82H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB01H3", "MGEB02H3"], "str": "MGEB01H3 or MGEB02H3"}, "title": "MGEC82H3  International Aspects of Development Policy ", "exclusions": {"list": ["ECMC67H3", "ECO324Y"], "str": "(ECMC67H3), ECO324Y"}, "description": "This course will use the tools of economics to understand international aspects of economic development policy. Development policy will focus on understanding the engagement of developing countries in the global economy, including the benefits and challenges of that engagement. Topics to be discussed will include globalization and inequality, foreign aid, multinational corporations, foreign direct investment, productivity, regional economic integration, and the environment. ", "code": "MGEC82H3"}, "ENGD19H3": {"breath_req": "Arts, Literature & Language", "description": "An in-depth study of sixteenth- and seventeenth-century literature together with intensive study of the theoretical and critical perspectives that have transformed our understanding of this literature.Pre-1900 course", "prerequisite": {"list": [], "str": "2 C-level courses in English"}, "title": "ENGD19H3  Theoretical Approaches to Early Modern English Literature and Culture ", "code": "ENGD19H3"}, "ENGC21H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC21H3  The Victorian Novel to 1860 ", "exclusions": {"list": ["ENG324Y"], "str": "ENG324Y"}, "description": "A study of major works of Victorian fiction, 1830-1860. This course focuses on the development of the realist novel in its social context. Authors studied might include Charles Dickens, William Makepeace Thackeray, the Bronte sisters, Anthony Trollope and Elizabeth Gaskell.Pre-1900 course", "code": "ENGC21H3"}, "ENGB63H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the craft of creative non-fiction. Through in-depth reading, discussion of exceptional texts and constructive workshop sessions, students will explore the many key elements of great true stories and produce several original works of creative non-fiction.", "title": "ENGB63H3  Creative Non-Fiction I ", "code": "ENGB63H3"}, "MGEC11H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MGEB11H3", "ECMB11H3", "MGEB12H3", "ECMB12H3"], "str": "MGEB11H3/(ECMB11H3) and MGEB12H3/(ECMB12H3)"}, "title": "MGEC11H3  Introduction to Regression Analysis ", "exclusions": {"list": ["ECO374H", "ECM375H", "ECMB13H3", "ECMC11H3", "STA302H", "MGEC11H3", "ECMC11H3", "STAC67H3", "MGEC11H3", "ECMC11H3", "ECO327Y"], "str": "ECO374H, ECM375H, (ECMB13H3), (ECMC11H3), STA302H. MGEC11H3/(ECMC11H3) may not be taken after STAC67H3. MGEC11H3/(ECMC11H3) may not be taken after or concurrently with ECO327Y."}, "description": "This course will develop the knowledge and skills necessary to obtain and analyze economic data, providing an introduction to the use and interpretation of regression analysis. Students will learn how to estimate regressions, undertake hypothesis tests, and critically assess statistical results. Students will be required to write a major analytical report. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEC11H3"}, "EESD13H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "Students must have completed at least 15.0 credits"}, "title": "EESD13H3  Environmental Law, Policy and Ethics ", "exclusions": {"list": ["LAW239H"], "str": "LAW239H"}, "description": "This course reviews the laws and policies governing the management of natural resources in Canada. It examines the role of law and how it can it can work most effectively with science, economics and politics to tackle environmental problems such as climate change, conservation, and urban sprawl at domestic and international scales.", "code": "EESD13H3"}, "ENGC37H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of literature and literary culture during the end of the eighteenth and beginning of the nineteenth centuries. We will trace the development of a consciously national culture, and birth of the concepts of high, middle, and low cultures. Authors may include Johnson, Boswell, Burney, Sheridan, Yearsley, Blake, and Wordsworth.Pre-1900 course", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC37H3  Literature and Culture, 1750-1830 ", "code": "ENGC37H3"}, "STEB44H3": {"breath_req": "Natural Sciences", "description": "The concepts of law and legal process as they apply in Canada. The Ontario Environmental Protection Act and other environmental legislation. Research on selected Canadian statutes with a written report and oral presentation. Limited to students enrolled in the Joint Specialist program in Environmental Science and Technology.", "title": "STEB44H3  Environmental Legislation and Regulations ", "code": "STEB44H3"}, "ENGD13H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGD13H3  Rap Poetics ", "exclusions": {"list": ["ENGC73H3", "ENGD63H3"], "str": "(ENGC73H3), (ENGD63H3)"}, "description": "An intensive study of rhetoric, genre, meaning, and form in rap lyrics. The three-decade-plus recorded history of this popular poetry will be discussed in rough chronological order. Aspects of African-American poetics, as well as folk and popular song, germane to the development of rap will be considered, as will narrative and vernacular strategies in lyric more generally; poetry's role in responding to personal need and to social reality will also prove relevant.", "code": "ENGD13H3"}, "MGED43H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MGEC40H3", "ECMC40H3", "MGEC41H3", "ECMC41H3"], "str": "MGEB02H3/(ECMB02H3) and [MGEC40H3/(ECMC40H3) or MGEC41H3/(ECMC41H3)]"}, "title": "MGED43H3  Organization Strategies ", "exclusions": {"list": ["MGEC43H3", "ECMC43H3", "RSM481H", "MGT481H"], "str": "(MGEC43H3), (ECMC43H3), RSM481H, (MGT481H)"}, "description": "Explores the issue of outsourcing, and broadly defines which activities should a firm do \"in-house\" and which should it take outside? Using a combination of cases and economic analysis, it develops a framework for determining the \"best\" firm organization.", "code": "MGED43H3"}, "ENGB14H3": {"breath_req": "Arts, Literature & Language", "description": "A study of major plays and playwrights of the twentieth century. This international survey might include turn-of-the-century works by Wilde or Shaw; mid-century drama by Beckett, O'Neill, Albee, or Miller; and later twentieth-century plays by Harold Pinter, Tom Stoppard, Caryl Churchill, Peter Shaffer, August Wilson, Tomson Highway, David Hwang, or Athol Fugard.", "exclusions": {"list": ["ENG340H", "ENG341H", "ENG342H", "ENGB11H3", "ENGB13H3", "ENG338Y", "ENG339H"], "str": "ENG340H, ENG341H, (ENG342H), (ENGB11H3), (ENGB13H3), (ENG338Y), (ENG339H)"}, "title": "ENGB14H3  Twentieth-Century Drama ", "code": "ENGB14H3"}, "MGEC34H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MATA32H3", "MATA33H3"], "str": "MGEB02H3/(ECMB02H3) and [MATA32H3 and MATA33H3] (or equivalents)"}, "title": "MGEC34H3  Economics of Health Care ", "exclusions": {"list": ["ECMC34H3", "ECO369H", "ECO369Y"], "str": "(ECMC34H3), ECO369H, ECO369Y"}, "description": "A study of the economic principles underlying health care and health insurance.This course is a survey of some of the major topics in health economics. Some of the topics that will be covered will include the economic determinants of health, the market for medical care, the market for health insurance, and health and safety regulation.", "code": "MGEC34H3"}, "ESTC35H3": {"breath_req": "Social & Behavioural Sciences", "description": "In this course students will engage critically, practically and creatively with environmental controversies and urgent environmental issues from the standpoint of the sociology of science and technology (STS). This course will contribute to a better understanding of the social and political construction of environmental science and technology.", "prerequisite": {"list": ["ESTB01H3"], "str": "ESTB01H3"}, "title": "ESTC35H3  Environmental Science and Technology in Society ", "code": "ESTC35H3"}, "MGEC02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEB02H3", "ECMB02H3", "MATA32H3", "MATA33H3"], "str": "MGEB02H3/(ECMB02H3) and [MATA32H3 and MATA33H3] (or equivalents)"}, "title": "MGEC02H3  Topics in Price Theory ", "exclusions": {"list": ["ECMC02H3", "MGEC92H3", "ECMC92H3", "ECO200Y", "ECO204Y", "ECO206Y"], "str": "(ECMC02H3), MGEC92H3/(ECMC92H3), ECO200Y, ECO204Y, ECO206Y"}, "description": "Continuing development of the principles of microeconomic theory. This course will build on the theory developed in MGEB02H3/(ECMB02H3). Topics will be chosen from a list which includes: monopoly, price discrimination, product differentiation, oligopoly, game theory, general equilibrium analysis, externalities and public goods. Enrolment is limited to students registered in programs requiring this course.", "code": "MGEC02H3"}, "MGEA02H3": {"breath_req": "Social & Behavioural Sciences", "description": "Economic theory of the firm and the consumer. Calculus, algebra and graphs are used extensively. The course is oriented towards students interested in the Specialist Program in Management, the Specialist program in Economics for Management Studies, and the Major Program in Economics for Management Studies.", "exclusions": {"list": ["MGEA01H3", "ECMA01H3", "ECMA04H3", "ECO100Y", "ECO105Y"], "str": "MGEA01H3/(ECMA01H3), (ECMA04H3), ECO100Y, ECO105Y"}, "title": "MGEA02H3  Introduction to Microeconomics: A Mathematical Approach ", "code": "MGEA02H3"}, "ENGC82H3": {"breath_req": "Arts, Literature & Language", "description": "A variable theme course that will feature different theoretical approaches to Cinema: feminist, Marxist, psychoanalytic, postcolonial, and semiotic. Thematic clusters include \"Madness in Cinema,\" and \"Films on Films.\"", "prerequisite": {"list": ["ENGB03H3", "ENGB04H3", "ENGB05H3", "ENGB01H3"], "str": "ENGB03H3 and ENGB04H3 and [one of ENGB05H3 or (ENGB01H3)]"}, "title": "ENGC82H3  Cinema Studies: Themes and Theories ", "code": "ENGC82H3"}}