{"NMED20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This seminar examines the ideological, political, structural, and representational assumptions underlying new media production and consumption from both theoretical and practice-based perspectives. Students critically reflect on and analyze digital media applications and artefacts in contemporary life, including business, information, communication, entertainment, and creative practices.", "prerequisite": {"list": [], "str": "Completion of 15 full credits including Centennial College courses listed in New Media Group 1 & New Media Group 2"}, "title": "NMED20H3  Theory and Practice of New Media ", "code": "NMED20H3"}, "NMEB06H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course enables the participant to understand the new media production process. Learners will develop the skills to conduct benchmarking, scoping and testing exercises that lead to meaningful project planning documents. Learners will develop and manage production schedules for their group projects that support the development efforts using the project planning documents. ", "prerequisite": {"list": ["NMEA01H3", "NMEA02H3", "NMEA03H3", "NMEA04H3"], "str": "NMEA01H3, NMEA02H3, NMEA03H3, NMEA04H3"}, "title": "NMEB06H3  Project Development and Presentation ", "code": "NMEB06H3"}, "NROD08H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROC34H3", "NROC64H3", "NROC69H3", "MATA29H3", "MATA31H3", "PSYB07H3", "STAB22H3"], "str": "[NROC34H3 or NROC64H3 or NROC69H3] and [MATA29H3 or MATA31H3] and [PSYB07H3 or STAB22H3]"}, "title": "NROD08H3  Theoretical Neuroscience ", "exclusions": {"list": ["BIOD08H3"], "str": "BIOD08H3"}, "description": "A seminar covering topics in the theory of neural information processing, focused on perception, movement, learning and memory. Through reading, discussion and working with computer models students will learn fundamental concepts underlying current theories of brain function including information theory, spike-time/rate coding, population codes, deep learning architectures, liquid state-machines and Bayesian optimality.Same as BIOD08H3", "code": "NROD08H3"}, "NROD60H3": {"description": "An intensive examination of selected issues and research problems in the Neurosciences.", "prerequisite": {"list": ["NROC61H3", "NROC64H3"], "str": "NROC61H3 and NROC64H3"}, "title": "NROD60H3  Current Topics in Neuroscience ", "code": "NROD60H3"}, "NMEA03H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces the fundamentals of two-dimensional design, graphic design theory, graphic design history, colour principles, typographic principles and visual communication theories applied to New Media Design. Working from basic form generators, typography, two-dimensional design principles, colour and visual communication strategies, learners will be introduced to the exciting world of applied graphic design and multi-media. This course is taught at Centennial College.", "prerequisite": {"list": [], "str": "10 full credits"}, "title": "NMEA03H3  The Language of Design ", "code": "NMEA03H3"}, "NROB60H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3", "PSYA01H3", "PSYA02H3"], "str": "BIOA01H3 and BIOA02H3 and PSYA01H3 and PSYA02H3"}, "title": "NROB60H3  Neuroanatomy Laboratory ", "exclusions": {"list": ["CSB332H", "HMB320H", "PSY290H", "PSY391H", "ZOO332H"], "str": "CSB332H, HMB320H, PSY290H, PSY391H, (ZOO332H)"}, "description": "This course will focus on lab neuroanatomy at both the human and animal level. This will also include examination of the structure and function of neurons and glia, neurochemistry, and neuromechanisms of communication at the cellular and molecular level.", "code": "NROB60H3"}, "NMEB09H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces students to the scope of sound design - creative audio for new media applications. Students will work with audio applications software to sample, create and compress files, and in the planning and post-production of new media. Students will also learn to use audio in interactive ways such as soundscapes.", "prerequisite": {"list": ["NMEA01H3", "NMEA02H3", "NMEA03H3", "NMEA04H3"], "str": "NMEA01H3, NMEA02H3, NMEA03H3, NMEA04H3"}, "title": "NMEB09H3  Sound Design ", "code": "NMEB09H3"}, "NROD67H3": {"breath_req": "Natural Sciences", "description": "This course will characterize various anatomical, biochemical and physiological changes that occur in the nervous system with age and will explore the association between these changes and cognitive deterioration. We will examine several age-related disease states and evaluate the validity of current theories and experimental models of aging in depth.", "prerequisite": {"list": ["NROB60H3", "NROC61H3", "NROC64H3"], "str": "NROB60H3 and [NROC61H3 or NROC64H3]"}, "title": "NROD67H3  Psychobiology of Aging ", "code": "NROD67H3"}, "NMEB08H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course builds on NMEA01H3. It enables learners to extend their understanding of software requirements and of advanced software techniques. Software used may include Dreamweaver, Flash, Director, and animation (using Director).", "prerequisite": {"list": ["NMEA01H3", "NMEA02H3", "NMEA03H3", "NMEA04H3"], "str": "NMEA01H3, NMEA02H3, NMEA03H3, NMEA04H3"}, "title": "NMEB08H3  Application Software for Interactive Media ", "code": "NMEB08H3"}, "NROD66H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROC61H3", "NROC64H3", "PSYC62H3"], "str": "[NROC61H3 or NROC64H3] and PSYC62H3"}, "title": "NROD66H3  Drug Addiction ", "exclusions": {"list": ["NROD60H3"], "str": "NROD60H3 (if taken in the 2009 Fall Session)"}, "description": "An examination of the major phases of the addiction cycle, including drug consumption, withdrawal, and relapse. Consideration will be given to what basic motivational and corresponding neurobiological processes influence behaviour during each phase of the cycle. Recent empirical findings will be examined within the context of major theoretical models guiding the field.", "code": "NROD66H3"}, "NMED01H3": {"description": "Students develop a new media project that furthers their research into theoretical issues around digital media practices and artefacts. Projects may focus on digital media ranging from the internet to gaming, to social networking and the Web, to CD-ROMS, DVDs, mobile apps, and Virtual and Augmented Reality technologies.", "prerequisite": {"list": [], "str": "Completion of 15 credits including Centennial College courses listed in New Media Group 1 & New Media Group 2"}, "title": "NMED01H3  New Media Senior Project ", "code": "NMED01H3"}, "NROC34H3": {"breath_req": "Natural Sciences", "description": "Neural basis of natural behaviour; integrative function of the nervous system; motor and sensory systems; mechanisms of decision-making, initiating action, co-ordination, learning and memory. Topics may vary from year to year.", "prerequisite": {"list": ["BIOB34H3", "NROB60H3"], "str": "BIOB34H3 or NROB60H3"}, "title": "NROC34H3  Neuroethology ", "code": "NROC34H3"}, "NMEB10H3": {"breath_req": "Arts, Literature & Language", "description": "This course discusses the integration of multiple media with the art of good design. The course examines the conventions of typography and the dynamics between words and images, with the introduction of time, motion and sound. The course involves guest speakers, class exercises, assignments, field trips, group critiques and major projects.", "prerequisite": {"list": ["NMEA01H3", "NMEA02H3", "NMEA03H3", "NMEA04H3"], "str": "NMEA01H3, NMEA02H3, NMEA03H3, NMEA04H3"}, "title": "NMEB10H3  New Media Design ", "code": "NMEB10H3"}, "NROD98Y3": {"description": "This course offers the opportunity to engage in a year long research project under the supervision of an interested member of the faculty in Neuroscience. The project will culminate in a written report in the form of a thesis and a poster presentation. During the course of the year, at appropriate times, students will meet to present their own research proposals, to appraise the proposals of others, and to discuss the results of their investigation. Students must first find a supervisor, which is usually confirmed before the start of the academic term in which the project will be initiated. Students will meet as a group with the coordinator as well as individually with their supervisor. Preference in this course is given to Specialists in Neuroscience with a cumulative GPA of 3.3 or higher. Students planning to pursue graduate studies are especially encouraged to enrol in the course. Students must obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and submitted to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course. Students seeking supervision off campus will need to arrange co supervision with a faculty member in Neuroscience at UTSC.", "prerequisite": {"list": ["PSYB07H3", "PSYC08H3"], "str": "Satisfactory completion of 15.0 credits in any discipline, including PSYB07H3 and one laboratory half-course in Psychology, Biology or Neuroscience and consent of a faculty member in Psychology or Biology to serve as a research supervisor.  Note:  Preference will be given to students in a specialist program in Neuroscience whose 15.0 credits include PSYC08H3 and who have a cumulative GPA of at least 3.3."}, "exclusions": {"list": ["BIOD98Y3", "PSYD98Y3", "BGYD98Y3", "BGYD99Y3", "BGYD01Y3", "BGYD02Y3"], "str": "BIOD98Y3, PSYD98Y3, (BGYD98Y3), (BGYD99Y3), (BGYD01Y3), (BGYD02Y3)"}, "title": "NROD98Y3  Thesis in Neuroscience ", "code": "NROD98Y3"}, "NROC90H3": {"description": "An intensive research project intended to provide laboratory/field experience in data collection and analysis. The project must be completed over 2 consecutive terms. NROC90H and NROC93H3 provide an opportunity to engage in research in an area after completing basic coverage in regularly scheduled courses. The student must demonstrate a background adequate for the project proposed and should present a clear rationale to prospective supervisors. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report. Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book. Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Neuroscience faculty at UTSC then a secondary supervisor who is a member of the Neuroscience group at UTSC will be required.", "prerequisite": {"list": [], "str": "3.0 credits in Psychology, Biology or Neurosciences and permission of instructor."}, "exclusions": {"list": ["PSYC90H3"], "str": "PSYC90H3"}, "title": "NROC90H3  Supervised Study in Neuroscience ", "code": "NROC90H3"}, "NMEB05H3": {"breath_req": "Arts, Literature & Language", "description": "Extends work on interface design. Students have opportunities to gain real world experience in the techniques of user interface design. Participants learn to do a \"requirements document\" for projects, how to design an interface which meets the needs of the requirements of the document and how to test a design with real world users.", "prerequisite": {"list": ["NMEA01H3", "NMEA02H3", "NMEA03H3", "NMEA04H3"], "str": "NMEA01H3, NMEA02H3, NMEA03H3, NMEA04H3"}, "title": "NMEB05H3  Interface Design, Navigation and Interaction II ", "code": "NMEB05H3"}, "NROC63H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "NROB60H3"], "str": "[PSYB07H3 or STAB22H3] and NROB60H3"}, "title": "NROC63H3  Neuroscience Laboratory ", "exclusions": {"list": ["PSY399H"], "str": "PSY399H"}, "description": "Instruction in a variety of techniques used in investigations of nervous system function. Behavioural techniques, neurological manipulation, perfusions, histology, animal ethics and the preparation of scientific papers will be covered. Priority will be given to students enrolled in the Neuroscience Specialist Program (Co-op and Non co-op).", "code": "NROC63H3"}, "NROD63H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROC61H3", "NROC64H3"], "str": "NROC61H3 and NROC64H3"}, "title": "NROD63H3  Advanced Neuroscience Laboratory ", "exclusions": {"list": ["PSY399H"], "str": "PSY399H"}, "description": "Instruction in a variety of advanced techniques used to investigate nervous system functioning. Advanced molecular and cellular histochemical techniques used in the neurosciences will be covered as well as theory, methodology and image analysis.", "code": "NROD63H3"}, "NROC61H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROB60H3"], "str": "NROB60H3"}, "title": "NROC61H3  Learning and Motivation ", "exclusions": {"list": ["HMB200H"], "str": "HMB200H"}, "description": "Topics covered under the category of motivation include: physiological basis of eating, drinking and sexual behaviour, sleep, and the neural correlates of reward. Topics covered under learning include: learning categories, memory systems and the cell and molecular basis of learning and memory.", "code": "NROC61H3"}, "NROC64H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROB60H3"], "str": "NROB60H3"}, "title": "NROC64H3  Sensorimotor Systems ", "exclusions": {"list": ["PSY290H"], "str": "PSY290H"}, "description": "A focus on the mechanisms by which the nervous system processes sensory information and controls movement. The topics include sensory transduction and the physiology for sensory systems (visual, somatosensory, auditory, vestibular). Both spinal and central mechanisms of motor control are also covered.", "code": "NROC64H3"}, "NROC93H3": {"description": "An intensive research project intended to provide laboratory/field experience in data collection and analysis. The project must be completed over 2 consecutive terms. NROC90H3 and NROC93H3 provide an opportunity to engage in research in an area after completing basic coverage in regularly scheduled courses. The student must demonstrate a background adequate for the project proposed and should present a clear rationale to prospective supervisors. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report. Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book. Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Neuroscience faculty at UTSC then a secondary supervisor who is a member of the Neuroscience group at UTSC will be required.", "prerequisite": {"list": [], "str": "3.0 credits in Psychology, Biology or Neurosciences and permission of instructor."}, "exclusions": {"list": ["PSYC93H3"], "str": "PSYC93H3"}, "title": "NROC93H3  Supervised Study in Neuroscience ", "code": "NROC93H3"}, "NMEA01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course introduces basic hardware and software for new media. Students will learn basics of HTML (tags, tables and frames) and JavaScript for creation of new media. Discusses hardware requirements including storage components, colour palettes and different types of graphics (bitmap vs. vector-based). Students will be introduced to a variety of software packages used in new media production. This course is taught at Centennial College.", "prerequisite": {"list": ["MDSA01H3", "MDSA02H3"], "str": "5.0 credits including MDSA01H3 and MDSA02H3"}, "title": "NMEA01H3  Digital Fundamentals ", "code": "NMEA01H3"}, "NROC69H3": {"breath_req": "Natural Sciences", "description": "Neuronal morphology, synaptic connectivity, and molecular mechanisms of synaptic function are covered in detail. Similarities in circuitry among such diverse structures as the olfactory bulb, cerebellum, hippocampus and neocortex are examined in detail. The goal is to engender a deeper understanding of cellular mechanisms of information processing in the CNS.", "prerequisite": {"list": ["NROB60H3"], "str": "NROB60H3"}, "title": "NROC69H3  Synaptic Organization and Physiology of the Brain ", "code": "NROC69H3"}, "NROC36H3": {"breath_req": "Natural Sciences", "description": "This course will focus on the molecular mechanisms underlying neuronal communication in the central nervous system. The first module will look into synaptic transmission at the molecular level, spanning pre and postsynaptic mechanisms. The second module will focus on molecular mechanisms of synaptic plasticity and learning and memory. Additional topics will include an introduction to the molecular mechanisms of neurodegenerative diseases and channelopathies. ", "prerequisite": {"list": ["NROB60H3", "BIOB10H3"], "str": "NROB60H3 and BIOB10H3"}, "title": "NROC36H3  Molecular Neuroscience ", "code": "NROC36H3"}, "NMEA02H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course enables students to develop strong written communications skills for effective project proposals and communications, as well as non-linear writing skills that can be applied to a wide range of interactive media projects. The course examines the difference between successful writing for print and for new media, and how to integrate text and visual material. This course is taught at Centennial College.", "prerequisite": {"list": ["MDSA01H3", "MDSA02H3"], "str": "5.0 credits including MDSA01H3 and MDSA02H3"}, "title": "NMEA02H3  Introduction to New Media Communications ", "code": "NMEA02H3"}, "NMEA04H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces students to the discipline of user interface and software design, and in particular their impact and importance in the world of new media. The course uses theory and research in combination with practical application, to bring a user-centred design perspective to developing new media software. This course is taught at Centennial College.", "prerequisite": {"list": ["MDSA01H3", "MDSA02H3"], "str": "5.0 credits including MDSA01H3 and MDSA02H3"}, "title": "NMEA04H3  Interface Design, Navigation and Interaction I ", "code": "NMEA04H3"}, "NROC60H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["NROC36H3", "NROC61H3", "NROC69H3"], "str": "NROC36H3 or NROC61H3 or NROC69H3 "}, "title": "NROC60H3  Cellular Neuroscience Laboratory ", "exclusions": {"list": ["PSY399H"], "str": "PSY399H"}, "description": "This course involves a theoretical and a hands-on cellular neuroscience laboratory component. Advanced systems, cellular and molecular neuroscience techniques will be covered within the context of understanding how the brain processes complex behaviour. Practical experience on brain slicing, immunohistochemistry and cell counting will feature in the completion of a lab project examining the cellular mechanisms underlying schizophrenia-like behavioural deficits. These experiments do not involve contact with animals.", "code": "NROC60H3"}}