{"RLGD02H3": {"description": "A seminar in which students have the opportunity, under the supervision of a member of the Religion faculty, to develop and present independent research projects focused around a set of texts, topics, and/or problems relevant to the study of religion.", "prerequisite": {"list": ["RLGB10H3"], "str": "RLGB10H3 and 2 C-level courses in Religion"}, "title": "RLGD02H3  Seminar in Religion ", "code": "RLGD02H3"}, "RLGC05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["RLGA02H3", "RLGB01H3", "HUMB03H3"], "str": "RLGA02H3 or (RLGB01H3) or (HUMB03H3)"}, "title": "RLGC05H3  The Qur'an in Interpretive and Historical Context ", "exclusions": {"list": ["RLG351H", "NMC285H", "HUMC17H3"], "str": "RLG351H, NMC285H, (HUMC17H3)"}, "description": "An exploration of the origins, content, interpretation, and significance of the Qur'an, with a particular emphasis on its relationship to the scriptural tradition of the Abrahamic faiths. No knowledge of Arabic is required.", "code": "RLGC05H3"}, "RLGC09H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "The course examines the development of Islam in the contexts of Asian religions and cultures, and the portrayal of the Muslim world in Asian popular culture.", "prerequisite": {"list": ["RLGA01H3", "HUMB04H3"], "str": "RLGA01H3 or (HUMB04H3)"}, "title": "RLGC09H3  Islam in Asia ", "code": "RLGC09H3"}, "RLGC40H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "2.0 full credits in RLG and permission of the instructor"}, "title": "RLGC40H3  Selected Topics in the Study of Religion I ", "exclusions": {"list": ["HUMC44H3"], "str": "(HUMC44H3)"}, "description": "Intensive study of selected topics discussed in RLGA01H3 (World Religions I) that will vary with each offering of the course.", "code": "RLGC40H3"}, "RLGD01H3": {"description": "A student-initiated research project to be approved by the Department and supervised by one of the faculty members.", "prerequisite": {"list": [], "str": "2.0 full credits in RLG at the C-level and permission of the instructor"}, "title": "RLGD01H3  Supervised Readings in the Study of Religion ", "code": "RLGD01H3"}, "RLGB02H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Critical comparative study of the major Indian religious traditions.", "title": "RLGB02H3  Living Religions: Rituals and Experiences ", "code": "RLGB02H3"}, "RLGA02H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to major religious traditions of the world. This course emphasizes the history, beliefs, practices and writings of Judaism, Christianity and Islam.", "exclusions": {"list": ["HUMB03H3"], "str": "(HUMB03H3)"}, "title": "RLGA02H3  World Religions II ", "code": "RLGA02H3"}, "RLGC06H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["RLGA01H3", "HUMB04H3"], "str": "RLGA01H3 or (HUMB04H3)"}, "title": "RLGC06H3  Saints and Mystics in Buddhism ", "exclusions": {"list": ["EAS368Y"], "str": "EAS368Y"}, "description": "Comparative study of the Madhyamaka and Yogacara traditions, and doctrines such as emptiness (sunyata), Buddha-nature (tathagatagarbha), cognitive-representation only (vijnaptimatrata), the three natures (trisvabhava).", "code": "RLGC06H3"}, "RLGC41H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "2.0 full credits in RLG and permission of the instructor"}, "title": "RLGC41H3  Selected Topics in the Study of Religion II ", "exclusions": {"list": ["HUMC43H3"], "str": "(HUMC43H3)"}, "description": "Intensive study of selected topics discussed in RLGA02H3 (World Religions II) that will vary with each offering of the course.", "code": "RLGC41H3"}, "RLGC13H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Philosophical, anthropological, historical, and linguistic discussions about language use in a variety of religious contexts. The course examines the function of language through an analysis of its use in both oral and written form.", "prerequisite": {"list": ["RLGA01H3", "RLGA02H3", "RLGB10H3"], "str": "Any 5 full credits, including RLGA01H3 or RLGA02H3 or RLGB10H3"}, "title": "RLGC13H3  Religious Diversity in Speech and Text ", "code": "RLGC13H3"}, "RLGC14H3": {"breath_req": "Social & Behavioural Sciences", "description": "The course cultivates an appreciation of the global perspective of religions in the contemporary world and how religious frameworks of interpretation interact with modern social and political realities. It provides a viewpoint of religion through ideas and issues related to globalization, syncretism, and modernity.", "prerequisite": {"list": ["RLGA01H3", "RLGA02H3", "RLGB10H3"], "str": "Any 5 full credits, including RLGA01H3 or RLGA02H3 or RLGB10H3"}, "title": "RLGC14H3  Religion and Globalization: Continuities and Transformations ", "code": "RLGC14H3"}, "RLGC10H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of Hinduism in its contemporary diasporic and transnational modes in South Asia. Attention is also paid to the development of Hinduism in the context of colonialism.", "prerequisite": {"list": ["RLGA01H3", "HUMB04H3"], "str": "RLGA01H3 or (HUMB04H3)"}, "title": "RLGC10H3  Hinduism in South Asia and the Diaspora ", "code": "RLGC10H3"}, "RLGA01H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to major religious traditions of the world. This course emphasizes the history, beliefs, practices and writings of Hinduism, Jainism, Sikhism, Buddhism, Confucianism, Taoism, and Shinto.", "exclusions": {"list": ["HUMB04H3"], "str": "(HUMB04H3)"}, "title": "RLGA01H3  World Religions I ", "code": "RLGA01H3"}, "RLGB10H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to the academic study of religion, with special attention to method and theory.", "title": "RLGB10H3  Introduction to the Study of Religion ", "code": "RLGB10H3"}, "RLGC07H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["RLGA01H3", "HUMB04H3", "PHLB42H3"], "str": "RLGA01H3 or (HUMB04H3) or (PHLB42H3)"}, "title": "RLGC07H3  Topics in Buddhist Philosophy: Buddhist Ethics ", "exclusions": {"list": ["NEW214Y", "PHLC40H3"], "str": "NEW214Y, (PHLC40H3)"}, "description": "Buddhism is a response to what is fundamentally an ethical problem - the perennial problem of the best kind of life for us to lead. Gotama was driven to seek the solution to this problem and the associated ethical issues it raises. This course discusses the aspects of sila, ethics and psychology, nirvana; ethics in Mahayana; Buddhism, utilitarianism, and Aristotle.", "code": "RLGC07H3"}}