{"HLTA02H3": {"title": "HLTA02H3  Foundations in Health Studies I ", "code": "HLTA02H3", "description": "This the first part of a sequence of two courses designed to introduce theory, contemporary topics, and analytical techniques related to the study of health issues. Examples of topics include: social determinants of health, basic anatomy, introduction to child development, introduction to the life course and aging, disease, health economics and policy, and applicable research methods.", "breath_req": "Social & Behavioural Sciences"}, "HLTA03H3": {"title": "HLTA03H3  Foundations in Health Studies II ", "code": "HLTA03H3", "description": "This the second part of a sequence of two courses designed to introduce theory, contemporary topics, and analytical techniques related to the study of health issues. Examples of topics include: social determinants of health, basic anatomy, introduction to child development, introduction to the life course and aging, disease, health economics and policy, and applicable research methods.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTA02H3", "list": ["HLTA02H3"]}}, "HLTB11H3": {"title": "HLTB11H3  Basic Human Nutrition ", "code": "HLTB11H3", "description": "An introductory course to provide the fundamentals of human nutrition to enable students to understand and think critically about the complex interrelationships between food, nutrition, health and environment.", "exclusions": ["NFS284H1"], "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTB15H3": {"title": "HLTB15H3  Introduction to Health Research Methodology ", "code": "HLTB15H3", "description": "The objective of this course is to introduce students to the main principles that are needed to undertake health-related research. Students will be introduced to the concepts and approaches to health research, the nature of scientific inquiry, the role of empirical research, and epidemiological research designs.", "exclusions": ["HLTA10H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "[HLTA02H3 and HLTA03H3 and any Statistics course] or [any 4.0 credits, including SOCB60H3]", "list": ["HLTA02H3", "HLTA03H3", "SOCB60H3"]}}, "HLTB16H3": {"title": "HLTB16H3  Introduction to Public Health ", "code": "HLTB16H3", "description": "This course will present a brief history about the origins and development of the public health system and its role in health prevention. Using a case study approach, the course will focus on core functions, public health practices, and the relationship of public health with the overall health system.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTB20H3": {"title": "HLTB20H3  Contemporary Human Evolution and Variation ", "code": "HLTB20H3", "description": "Basic to the course is an understanding of the synthetic theory of evolution and the principles, processes, evidence and application of the theory. Laboratory projects acquaint the student with the methods and materials utilized Biological Anthropology. Specific topics include: the development of evolutionary theory, the biological basis for human variation, the evolutionary forces, human adaptability and health and disease.Science credit Same as ANTB15H3", "exclusions": ["ANTB15H3", "ANT203Y"], "breath_req": "Natural Sciences", "prerequisite": {"str": "ANTA01H3 or [HLTA02H3 and HLTA03H3]", "list": ["ANTA01H3", "HLTA02H3", "HLTA03H3"]}}, "HLTB22H3": {"title": "HLTB22H3  Biological Determinants of Health ", "code": "HLTB22H3", "description": "This course is an introduction to the basic biological principles underlying the origins and development of both infectious and non-infectious diseases in human populations. It covers population genetics and principles of inheritance.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3 and [BIOA11H3 or [BIOA01H3 and BIOA02H3]]", "list": ["HLTA02H3", "HLTA03H3", "BIOA11H3", "BIOA01H3", "BIOA02H3"]}}, "HLTB40H3": {"title": "HLTB40H3  Health Policy and Health Systems ", "code": "HLTB40H3", "description": "This course focuses on public and private financing mechanisms for health care in Canada, emphasizing provincial differences and discussing the systems in place in other developed nations. Topics will include the forces of market competition and government regulation as well as the impact of health policy on key stakeholders. Students will also learn how to apply simple economic reasoning to examine health policy issues.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTB41H3": {"title": "HLTB41H3  Introduction to the Social Determinants of Health ", "code": "HLTB41H3", "description": "This course introduces students to Social Determinants of Health (SDOH) approaches to reducing health inequities, and improving individual and population health. Students will critically explore the social, political, economic, and historic conditions that shape the everyday lives, and influence the health, of people.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTB42H3": {"title": "HLTB42H3  Perspectives of Culture, Illness and Healing ", "code": "HLTB42H3", "description": "This course introduces students to anthropological perspectives of culture, society, and language, to foster understanding of the ways that health intersects with political, economic, religious and kinship systems. Topics will include ethnographic theory and practice, cultural relivatism, and social and symbolic meanings and practices regarding the body.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTA02H3 and HLTA03H3", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTB50H3": {"title": "HLTB50H3  Introduction to Health Humanities ", "code": "HLTB50H3", "description": "An introduction to human health through literature, narrative, and the visual arts. Students will develop strong critical skills in text-centered methods of analysis (i.e., the written word, visual images) through topics including representations of health, illness narratives, death and dying, patient-professional relationships, technoscience and the human body.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "Any 4.0 credits", "list": []}}, "HLTC02H3": {"title": "HLTC02H3  Women and Health: Past and Present ", "code": "HLTC02H3", "description": "This course uses historical, anthropological, philosophical approaches to further understand the relationships intertwining women, health and society. Women's interactions with the health sector will be examined. Particular attention will be devoted to the social and gender construction of disease and the politics of women's health.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB41H3", "list": ["HLTB41H3"]}}, "HLTC04H3": {"title": "HLTC04H3  Critical Qualitative Health Research Methods ", "code": "HLTC04H3", "description": "Students will develop a curiosity and awareness about critical approaches to studying health and illness. They will learn what it means to be a critical qualitative health researcher. They will understand how to engage in transformative critical health research practice that questions taken-for-granted assumptions about the social world, and, in the process, students will develop new conceptual and applied skills. Students will draw from interdisciplinary knowledge sources to develop strategies for designing and carrying out critically informed health research projects.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB15H3", "list": ["HLTB15H3"]}}, "HLTC05H3": {"title": "HLTC05H3  Society, Health and Illness ", "code": "HLTC05H3", "description": "Students gain theoretical and practical skills to think about, and analyze, health inequalities, and also develop an understanding of illness and inequality as socially produced phenomena. Critical perspectives about the cultural, historic, political and structural conditions that shape people's living conditions are emphasized. Dominant ideas about health inequalities are challenged through engagement with social sciences literature.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB40H3", "list": ["HLTB40H3"]}}, "HLTC16H3": {"title": "HLTC16H3  Introduction to Health Information Systems ", "code": "HLTC16H3", "description": "An introduction to the fundamental concepts in health informatics (HI) and the relevance of HI to current and future Canadian and international health systems. Students will be introduced to traditional hospital-based/clinician-based HI systems, as well as present and emerging applications in consumer and public HI, including global applications.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB16H3", "list": ["HLTB16H3"]}}, "HLTC17H3": {"title": "HLTC17H3  Introduction to Rehabilitation Sciences ", "code": "HLTC17H3", "description": "This course will provide students with an introduction to the rehabilitation sciences in the Canadian context. Students will gain knowledge regarding the pressing demographic needs for rehabilitation services and research, as well as the issues affecting the delivery of those services.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB16H3", "list": ["HLTB16H3"]}}, "HLTC18H3": {"title": "HLTC18H3  Determinants of Health, and Health Disparities ", "code": "HLTC18H3", "description": "This course will introduce students to the population health approach (including health policy) that takes action on the factors, and the interrelationships between factors, that contribute to health and health disparities. Key determinants of health as described by the Public Health Agency of Canada will be examined using case studies.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3 or HLTC05H3 [Note: HLTC05H3 may also be taken as a co-requisite]", "list": ["HLTB22H3", "HLTC05H3", "HLTC05H3"]}}, "HLTC19H3": {"title": "HLTC19H3  Chronic Diseases ", "code": "HLTC19H3", "description": "This course will introduce students to the regional, national, and global patterns of chronic disease and demonstrate how demography, behaviour, socio-economic status, and genetics impact patterns of chronic disease in human populations. Using epidemiological studies we will examine these patterns, assess their complex causes, and discuss strategies for broad-based preventative action.", "exclusions": ["HLTC07H3", "HLTC21H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3 or HLTB41H3", "list": ["HLTB22H3", "HLTB41H3"]}}, "HLTC22H3": {"title": "HLTC22H3  Health, Aging and the Life Cycle ", "code": "HLTC22H3", "description": "This course focuses on the transition from birth to old age and changes in health status. Topics to be covered include: socio-cultural perspectives on aging, the aging process, chronic and degenerative diseases, caring for the elderly.", "exclusions": ["HLTB01H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC23H3": {"title": "HLTC23H3  Issues in Child Health and Development ", "code": "HLTC23H3", "description": "This course will explore bio-social aspects of health and development in children. Topics for discussion include genetics and development, growth and development, childhood diseases, the immune system, and nutrition during the early years.", "exclusions": ["HLTB02H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC24H3": {"title": "HLTC24H3  Environment and Health ", "code": "HLTC24H3", "description": "Environmental issues are often complex and require a holistic approach where the lines between different disciplines are often obscured. The environment, as defined in this course, includes the natural (biological) and built (social, cultural, political) settings. Health is broadly defined to include the concept of well-being. Case studies will be used to illustrate environment and health issues using an ecosystem approach that includes humans as part of the ecosystem.", "exclusions": ["ANTB56H3", "HLTB04H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC25H3": {"title": "HLTC25H3  Infectious Diseases ", "code": "HLTC25H3", "description": "Adopting ecological, epidemiological, and social approaches, this course examines the impact of infectious disease on human populations. Topics covered include disease ecology, zoonoses, and the role of humans in disease occurance. The aim is to understand why infectious diseases emerge and how their occurance is intimately linked to human behaviours. ", "exclusions": ["HLTB21H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC27H3": {"title": "HLTC27H3  Community Health and Epidemiology ", "code": "HLTC27H3", "description": "Epidemiology is the study or the pattern and causes of health-related outcomes and the application of findings to improvement of public health. This course will examine the history of epidemiology and its principles and terminology, measures of disease occurrence, study design, and application of concepts to specific research areas.", "exclusions": ["ANTC67H3"], "breath_req": "Quantitative Reasoning", "prerequisite": {"str": "HLTB15H3 and HLTB16H3 and any statistics course", "list": ["HLTB15H3", "HLTB16H3"]}}, "HLTC28H3": {"title": "HLTC28H3  Special Topics in Health Studies ", "code": "HLTC28H3", "description": "An examination of a current topic relevant to health studies. The specific topic will vary from year to year, and may include: Ecosystem Approaches to Zoonotic Disease; Climate Change and Health; Food Insecurity, Nutrition, and Health; Health and the Human-Insect Interface.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC29H3": {"title": "HLTC29H3  Special Topics in Health Studies ", "code": "HLTC29H3", "description": "An examination of a current topic relevant to health studies. The specific topic will vary from year to year, and may include: Ecosystem Approaches to Zoonotic Disease; Climate Change and Health; Food Insecurity, Nutrition, and Health; Health and the Human-Insect Interface.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTB22H3", "list": ["HLTB22H3"]}}, "HLTC42H3": {"title": "HLTC42H3  Emerging Health Issues and Policy Needs ", "code": "HLTC42H3", "description": "This course takes an interdisciplinary approach to helping students prepare to tackle complex emerging health issues and to explore ways of addressing these issues through public policy. A range of contemporary and newly-emerging health issues are discussed and analyzed in the context of existing policy constraints within Canada and worldwide.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB40H3", "list": ["HLTB40H3"]}}, "HLTC43H3": {"title": "HLTC43H3  Politics of Canadian Health Policy ", "code": "HLTC43H3", "description": "This course examines the role of all levels of Canadian government in health and health care. The impact of public policies, health care policy, and access to health care services on the health of populations is considered. The course also examines the role of political parties and social movements in the policy change process.", "exclusions": ["POLC55H3", "HLTC03H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB40H3", "list": ["HLTB40H3"]}}, "HLTC44H3": {"title": "HLTC44H3  Comparative Health Policy Systems ", "code": "HLTC44H3", "description": "This course surveys a selection of health care systems worldwide in relation to financing, reimbursement, delivery systems and adoption of new technologies. In this course students will explore questions such as: which systems and which public/private sector mixes are better at achieving efficiency and equity? How do these different systems deal with tough choices, such as decisions about new technologies? The set of international health care systems we focus on are likely to vary by term but will include a subset of OECD countries as well as countries with large populations that are heavily represented in Toronto such as China and India.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB40H3", "list": ["HLTB40H3"]}}, "HLTC46H3": {"title": "HLTC46H3  Gender, Health and Society ", "code": "HLTC46H3", "description": "This interdisciplinary course draws on diverse theoretical and analytical approaches that span the humanities, social sciences and life sciences to critically explore the diverse relationships between gender and health, in local and global contexts. Particular attention is given to intersections between sex, gender and other social locations and processes that impact health and health inequities across the lifespan, including the impacts of ableism, colonialism, hetero-normativity, poverty, racialization, and sexism on women's and men's health, and related health research and practice. Through course readings, case studies, group discussions, class activities, and course assignments, students will apply these theoretical lenses and develop analytical skills that : (1) advance a more contextualized understanding of gender and health across the lifespan, (2) provide important insights into gendered health inequities, and (3) speak to strategies and social movements that begin to address these challenges.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB41H3 or IDSB04H3", "list": ["HLTB41H3", "IDSB04H3"]}}, "HLTC47H3": {"title": "HLTC47H3  Special Topics in Health Studies ", "code": "HLTC47H3", "description": "An examination of a current topic relevant to health studies. The specific topic will vary from year to year, and may include: Social Justice and Health Activism; Climate Change and Health; Labour, Precarity, and Health.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB41H3", "list": ["HLTB41H3"]}}, "HLTC48H3": {"title": "HLTC48H3  Special Topics in Health Studies ", "code": "HLTC48H3", "description": "An examination of a current topic relevant to health studies. The specific topic will vary from year to year. Topics may include: Social Justice and Health Activism; Climate Change and Health; Labour, Precarity, and Health.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "HLTB41H3", "list": ["HLTB41H3"]}}, "HLTC50H3": {"title": "HLTC50H3  The Human-Animal Interface ", "code": "HLTC50H3", "description": "An intensive, interdisciplinary study of the human-animal relationship as represented through a range of literature, film, and other critical writings. Students will explore the theoretical underpinnings of animality as a critical lens through which human identity, health, and policy are conceptualized. Key topics include: animals in the human imagination, particularly in relation to health; animal-human mythologies; health, ethics, and the animal.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "HLTB50H3", "list": ["HLTB50H3"]}}, "HLTD01H3": {"title": "HLTD01H3  Directed Readings in Health Studies ", "code": "HLTD01H3", "description": "This is an advanced reading course in special topics for upper level students who have completed the available basic courses in Health Studies and who wish to pursue further intensive study on a relevant topic. Topic selection and approval will depend on the supervising instructor.", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of one of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.5; and permission of the instructor.", "list": []}}, "HLTD02H3": {"title": "HLTD02H3  Health Research Seminar ", "code": "HLTD02H3", "description": "Provides senior students with the opportunity to apply methodological skills to a health research problem. Students will give presentations of their research proposals, and there may be a guest seminar on health research projects.", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of one of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.5; and permission of the instructor.", "list": []}}, "HLTD04H3": {"title": "HLTD04H3  Special Topics in Health ", "code": "HLTD04H3", "description": "The topics presented in this course will represent a range of contemporary issues in health research. Topics will vary by instructor and term.", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.5; and permission of the instructor.", "list": []}}, "HLTD05H3": {"title": "HLTD05H3  Directed Research on Health Services and Institutions ", "code": "HLTD05H3", "description": "Provides students with the opportunity to analyze work of health institutions. Students taking this course will arrange, in consultation with the instructor, to work as a volunteer in a health institution. They will write a major research paper related to some aspect of their experience.", "exclusions": ["HLTC01H3"], "prerequisite": {"str": "Completion of HLTA02H3 and HLTA03H3 and at least 4.0 credits from the requirements of one of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.5; and permission of the instructor.", "list": ["HLTA02H3", "HLTA03H3"]}}, "HLTD06H3": {"title": "HLTD06H3  Special Topics in Migration and Public Health ", "code": "HLTD06H3", "description": "The focus of this seminar is on public health as an institution and on the contemporary and historical practices related to migrants in Canada and globally. Practices include surveillance, screening, detention, and quarantine, among other forms of governance and regulation. Societal issues, social theory, and historic case studies drawn from literature, film and empirical research explore enduring questions and tensions related to the treatment of migrants by public health systems.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[[HLTB16H3 and HLTC05H3] and [1.5 credits at the C-level in HLT courses] and [a minimum CGPA of 2.5]] or [SOCB60H3 and an additional 15.0 credits]", "list": ["HLTB16H3", "HLTC05H3", "SOCB60H3"]}}, "HLTD12H3": {"title": "HLTD12H3  Special Topics in Health ", "code": "HLTD12H3", "description": "The topics presented in this course will represent a range of contemporary issues in health research. Topics will vary by instructor and term.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "[Completion of at least 6.0 credits from the requirements of the Major/Major Co-op programs in Health Studies] and [a minimum CGPA of 2.7] and [permission of the instructor]", "list": []}}, "HLTD13H3": {"title": "HLTD13H3  Special Topics in Health:  Global Health and Human Biology ", "code": "HLTD13H3", "description": "An examination of a current topic relevant to global health, especially diseases or conditions that predominately affect populations in low-income countries. The specific topics will vary from year to year, and may include: HIV/AIDS; insect-borne diseases; the biology of poverty and precarity. The course will provide students with relevant information about social context and health policy, but will focus on the processes of disease transmission and its biological impact on human health.", "breath_req": "Natural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses taken from the requirements of the Major/Major Co-op programs in Health Studies; and permission of the instructor.", "list": []}}, "HLTD20H3": {"title": "HLTD20H3  Special Topics in Health:  Sex, Gender, and the Life Course ", "code": "HLTD20H3", "description": "An examination of a current health topic relevant to sex, gender, and the life course. The specific topic will vary from year to year, and topics may include: reproductive health; the biology and health impacts of aging; infant feeding, weaning, and nutrition; sexual health among youth. The course will provide students with relevant information about social context and health policy, but will focus on biological processes at specific life stages.", "breath_req": "Natural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; and persmission of the instructor.", "list": []}}, "HLTD21H3": {"title": "HLTD21H3  Special Topics in Health ", "code": "HLTD21H3", "description": "The topics presented in this course will represent a range of contemporary issues in health research. Topics will vary by instructor and term.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.7; and permission of the instructor.", "list": []}}, "HLTD22H3": {"title": "HLTD22H3  Special Topics in Health ", "code": "HLTD22H3", "description": "The topics presented in this course will represent a range of contemporary issues in health research. Topics will vary by instructor and term.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.7; and permission of the instructor.", "list": []}}, "HLTD23H3": {"title": "HLTD23H3  Special Topics in Health ", "code": "HLTD23H3", "description": "The topics presented in this course will represent a range of contemporary issues in health research. Topics will vary by instructor and term.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits from the requirements of the Major/Major Co-operative programs in Health Studies; and a minimum CGPA of 2.5; and permission of the instructor", "list": []}}, "HLTD25H3": {"title": "HLTD25H3  Topics in Environmental Health ", "code": "HLTD25H3", "description": "The didactic portion of this course will examine emerging environmental health issues using case studies. In the hands-on portion of the course, students will learn a range of research skills - how to use the Systematic Reviews and Meta-Analyses (PRISMA) guidelines, evidence-based health and best practices, and the different elements of a successful grant proposal - while honing their researching, writing, and presenting skills.", "breath_req": "Natural Sciences", "prerequisite": {"str": "HLTC24H3 with a minimum GPA of 2.7 (B-)", "list": ["HLTC24H3"]}}, "HLTD29H3": {"title": "HLTD29H3  Special Topics in Health:  Inequality, Inequity, and Health ", "code": "HLTD29H3", "description": "An examination of a current topic in inequality, inequity, marginalization, social exclusion, and health outcomes. Topics may include: health and homelessness, poverty and sexual health, political conflict and refugee health. The course will provide students with relevant information about social context and health policy, but will focus on the physical and mental health impacts of various forms of inequity.", "breath_req": "Natural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; and permission of the instructor.", "list": []}}, "HLTD47H3": {"title": "HLTD47H3  Special Topics in Health:  Advanced Topics in Health and Wellness ", "code": "HLTD47H3", "description": "An examination of a current topic in health and wellness. Topics may include: disability, addiction, psychosocial wellbeing, social activism around health issues, Wellness Indices, Community Needs and Assets Appraisals. The course will focus on the contributing historical, social, and/or cultural factors, as well as relevant health policies.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; and permission of the instructor.", "list": []}}, "HLTD48H3": {"title": "HLTD48H3  Special Topics in Health:  Current Issues in Global Health ", "code": "HLTD48H3", "description": "An examination of a current topic in global health, especially a disease or condition that predominantly impacts populations in low-income countries. The specific topic will vary from year to year. Topics may include: HIV/AIDS; war and violence, insect-borne diseases; policies and politics of water and sanitation; reproductive health and population policies, etc. The course will focus on historical factors, socio-political contexts, and health policies.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; and permission of the instructor.", "list": []}}, "HLTD49H3": {"title": "HLTD49H3  Global Health Governance:  Thinking Alongside the World's Leaders ", "code": "HLTD49H3", "description": "This advanced seminar course explores contemporary topics in global health governance as they are being discussed and debated by world leaders at key international summits, such as the World Health Summit. After developing an understanding of the historical and political economy context of the main actors and instruments involved in global health governance, contemporary global health challenges are explored. Topics and cases change based on global priorities and student interests, but can include: the impact of international trade regimes on global health inequities; the role transnational corporations and non-governmental organizations play in shaping the global health agenda; the impact globalization has had on universal health care and health human resources in low-income countries; and health care during complex humanitarian crises.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; a minimum CGPA of 2.5; and permission of the instructor.", "list": []}}, "HLTD50H3": {"title": "HLTD50H3  Special Topics in Health Humanities ", "code": "HLTD50H3", "description": "This advanced seminar will provide intensive study of a selected topic in and/or theoretical questions about the health humanities. Topics will vary by instructor and term but may include narrative medicine, stories of illness and healing, representations of older age and aging in literature and film, AIDS and/or cancer writing, representations of death and dying in literature and film, the role of creative arts in health.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "HLTB50H3", "list": ["HLTB50H3"]}}, "HLTD51H3": {"title": "HLTD51H3  Aging and the Arts ", "code": "HLTD51H3", "description": "In this advanced seminar students will examine older age using the methods and materials of the humanities, with particular focus on: 1) the representation of aging and older age in the arts; and 2) the role of arts-based therapies and research initiatives involving older people and/or the aging process.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "HLTA03H3 and HLTB50H3 and [an additional 1.5 credits at the C-level in HLT courses]", "list": ["HLTA03H3", "HLTB50H3"]}}, "HLTD52H3": {"title": "HLTD52H3  Special Topics in Health:  Health Histories ", "code": "HLTD52H3", "description": "An examination of a health topic in historical perspective. The specific topics will vary from year to year, and may include: histories of race, racialization, and health policy; history of a specific medical tradition; or histories of specific health conditions, their medical and popular representations, and their treatment (e.g. historical changes in the understanding and representation of leprosy or depression).", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Completion of at least 6.0 credits including 2.0 credits at the C-level in HLT courses from the requirements of the Major/Major Co-op programs in Health Studies; and permission of the instructor.", "list": []}}, "HCSD05H3": {"title": "HCSD05H3  Intellectual Property in Arts and Humanities ", "code": "HCSD05H3", "description": "The course provides an introduction to Canada's intellectual property (IP) systems, copyright, patent, trademark and confidential information. Topics include use, re-use and creation of IP, the impact of the digital environment, the national implication of international agreements and treaties and information policy development.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 2.0 credits; and an additional 2.0 credits at the C-level in ACM, CFL, HCS, ENG and PHL", "list": []}}, "HISA04H3": {"title": "HISA04H3  Themes in World History I ", "code": "HISA04H3", "description": "An introduction to history that focuses on a particular theme in world history, which will change from year to year. Themes may include migration; empires; cultural encounters; history and film; global cities.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISA05H3": {"title": "HISA05H3  Themes in World History II ", "code": "HISA05H3", "description": "An introduction to history that focuses on a particular theme in world history, which will change from year to year. Themes may include migration; empires; cultural encounters; history and film; global cities.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISA06H3": {"title": "HISA06H3  Introducing Global Asia and its Histories ", "code": "HISA06H3", "description": "This course introduces Global Asia Studies through studying historical and political perspectives on Asia. Students will learn how to critically analyze major historical texts and events to better understand important cultural, political, and social phenomena involving Asia and the world. They will engage in intensive reading and writing for humanities. Same as GASA01H3", "exclusions": ["GASA01H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISA07H3": {"title": "HISA07H3  The Ancient Mediterranean World ", "code": "HISA07H3", "description": "An introduction to the main features of the ancient civilizations of the Mediterranean world from the development of agriculture to the spread of Islam. Long term socio-economic and cultural continuities and ruptures will be underlined, while a certain attention will be dedicated to evidences and disciplinary issues. Same as CLAA04H30.50 pre-1800 creditAncient World Area", "exclusions": ["CLAA04H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB02H3": {"title": "HISB02H3  The British Empire: A Short History ", "code": "HISB02H3", "description": "The British Empire at one time controlled a quarter of the world's population. This course surveys the nature and scope of British imperialism from the sixteenth to the twentieth century, through its interactions with people and histories of Asia, Africa, the Americas, the Caribbean, the Pacific, and the British Isles.Transnational Area", "breath_req": "History, Philosophy & Cultural Studies"}, "HISB03H3": {"title": "HISB03H3  Critical Writing and Research for Historians ", "code": "HISB03H3", "description": "Practical training in critical writing and research in History. Through lectures, discussion and workshops, students will learn writing skills (including essay organization, argumentation, documentation and bibliographic style), an introduction to methodologies in history and basic source finding techniques. ", "exclusions": ["HISB01H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB10H3": {"title": "HISB10H3  History and Culture of the Greek World ", "code": "HISB10H3", "description": "A survey of the history and culture of the Greek world from the Minoan period to the Roman conquest of Egypt (ca 1500-30 BC). Special attention will be dedicated to the nature, variety and limits of the available evidences, to socio-cultural interactions as well as to historical processes of continuities and ruptures. Same as CLAB05H3 0.50 pre-1800 credit Ancient World Area", "exclusions": ["CLAB05H3", "CLA230H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB11H3": {"title": "HISB11H3  History and Culture of the Roman World ", "code": "HISB11H3", "description": "A survey of the history and culture of the ancient Roman world, from the Etruscan period to the Justinian dynasty (ca 800 BC-600 AD). Special attention will be dedicated to the nature, variety and limits of the available evidences, to socio-cultural interactions as well as to historical processes of continuities and ruptures. Same as CLAB06H3 0.5 pre-1800 credit Ancient World Area", "exclusions": ["CLAB06H3", "CLA231H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB12H3": {"title": "HISB12H3  The Classical World in Film ", "code": "HISB12H3", "description": "The representation of the classical world and historical events in film. How the Greek and Roman world is reconstructed by filmmakers, their use of spectacle, costume and furnishings, and the influence of archaeology on their portrayals. Films will be studied critically for historical accuracy and faithfulness to classical sources. Same as CLAB20H3", "exclusions": ["CLAB20H3", "CLA388H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB14H3": {"title": "HISB14H3  Edible History: History of Global Foodways ", "code": "HISB14H3", "description": "An exploration of how eating traditions around the world have been affected by economic and social changes, including imperialism, migration, the rise of a global economy, and urbanization. Topics include: immigrant cuisines, commodity exchanges, and the rise of the restaurant. Lectures will be supplemented by cooking demonstrations.Transnational Area", "exclusions": ["HISC14H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB23H3": {"title": "HISB23H3  Latin America and the World ", "code": "HISB23H3", "description": "This class will examine Latin America's social and cultural history from the ancient Aztecs and Incas to the twentieth-century populist revolutions of Emiliano Zapata and Evita Perón. It will also focus on Latin America's connections to the wider world through trade, migration, and cuisine.", "exclusions": ["HIS290H", "HIS291H", "HIS292H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB30H3": {"title": "HISB30H3  American History to the Civil War ", "code": "HISB30H3", "description": "A survey of American history from contact between Indians and Europeans up through the Civil War. Topics include the emergence of colonial societies; the rise and destruction of racial slavery; revolution and republic-making; economic and social change in the new nation; western conquest; and the republic's collapse into internal war.United States and Latin America Area ", "exclusions": ["HIS271Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB31H3": {"title": "HISB31H3  History of the United States since the Civil War ", "code": "HISB31H3", "description": "This course offers a survey of U.S. history from the post-Civil War period through the late 20th century, examining key episodes and issues such as settlement of the American West, industrialization, urbanization, immigration, popular culture, social movements, race relations, and foreign policy. United States and Latin America Area", "exclusions": ["HIS271Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB37H3": {"title": "HISB37H3  History of Mexico ", "code": "HISB37H3", "description": "This class will examine Mexico's social and cultural history from the ancient Aztecs through the Spanish Conquest to the twentieth-century revolutionary movements led by Pancho Villa and Emiliano Zapata. It will also focus on Mexico's connections to the wider world through trade, migration, and cuisine.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISB40H3": {"title": "HISB40H3  Early Canada and the Atlantic World ", "code": "HISB40H3", "description": "The history of northern North America from the first contacts between Europeans and Aboriginal peoples to the late 19th century. Topics include the impact of early exploration and cultural encounters, empires, trans-Atlantic migrations, colonization and revolutions on the development of northern North America. Canadian Area", "exclusions": ["HIS262Y", "HIS263Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB41H3": {"title": "HISB41H3  Making of Modern Canada ", "code": "HISB41H3", "description": "Students will be introduced to historical processes central to the history of Canada's diverse peoples and the history of the modern age more generally, including the industrial revolution, women's entry in social and political \"publics,\" protest movements, sexuality, and migration in the context of international links and connections.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISB50H3": {"title": "HISB50H3  Africa in the Era of the Slave Trade ", "code": "HISB50H3", "description": "An introduction to the history of Sub-Saharan Africa, from the era of the slave trade to the colonial conquests. Throughout, the capacity of Africans to overcome major problems will be stressed. Themes include slavery and the slave trade; pre-colonial states and societies; economic and labour systems; and religious change.Africa and Asia AreaSame as AFSB50H3", "exclusions": ["AFSB50H3", "HISC50H3", "HIS295H", "HIS396H", "HIS396Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any modern history course or AFSA01H3.", "list": ["AFSA01H3"]}}, "HISB51H3": {"title": "HISB51H3  Twentieth Century Africa ", "code": "HISB51H3", "description": "Modern Sub-Saharan Africa, from the colonial conquests to the post-colonial era of structural adjustment. The emphasis is on both structure and agency in a hostile world. Themes include conquest and resistance; colonial economies; gender and ethnicity; religious and political movements; development and underdevelopment, post-colonial conflicts, as well as cultural achievements.Africa and Asia AreaSame as AFSB51H3", "exclusions": ["AFSB51H3", "HISC51H3", "HIS396H", "HIS396Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB53H3": {"title": "HISB53H3  Mughals and the World, 1500-1858 AD ", "code": "HISB53H3", "description": "Why does Southern Asia's pre-colonial history matter? Using materials that illustrate the connected worlds of Central Asia, South Asia and the Indian Ocean rim, we will query conventional histories of Asia in the time of European expansion.\nSame as GASB53H3\n0.5 pre-1800 credit\nAfrica & Asia Area", "exclusions": ["GASB53H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB57H3": {"title": "HISB57H3  Sub-Continental Histories: South Asia in the World ", "code": "HISB57H3", "description": "A survey of South Asian history. The course explores diverse and exciting elements of this long history, such as politics, religion, trade, literature, and the arts, keeping in mind South Asia's global and diasporic connections. Africa and Asia Area Same as GASB57H3", "exclusions": ["HIS282Y", "HIS282H", "GASB57H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB58H3": {"title": "HISB58H3  Modern Chinese History ", "code": "HISB58H3", "description": "This course provides an overview of the historical changes and continuities of the major cultural, economic, political, and social institutions and practices in modern Chinese history. Africa and Asia Area Same as GASB58H3", "exclusions": ["HIS280Y", "GASB58H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "(HISA01H3) or (HISA02H3) or GASA01H3 or GASA02H3", "list": ["HISA01H3", "HISA02H3", "GASA01H3", "GASA02H3"]}}, "HISB60H3": {"title": "HISB60H3  Europe in the Early Middle Ages (305-1053) ", "code": "HISB60H3", "description": "The development of Europe from the Late Roman period to the eleventh-century separation of the Roman and Byzantine Churches. The course includes the foundation and spread of Christianity, the settlement of \"barbarians\" and Vikings, the establishment of Frankish kingship, the Empire of Charlemagne, and feudalism and manorialism. 0.50 pre-1800 creditMedieval Area", "exclusions": ["HIS220Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB61H3": {"title": "HISB61H3  Europe in the High and Late Middle Ages (1053-1492) ", "code": "HISB61H3", "description": "An introduction to the social, political, religious and economic foundations of the Western world, including Church and State relations, the Crusades, pilgrimage, monasticism, universities and culture, rural exploitation, town development and trade, heresy, plague and war. Particular attention will be devoted to problems which continue to disrupt the modern world. 0.50 pre-1800 credit Medieval Area", "exclusions": ["HIS220Y"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB62H3": {"title": "HISB62H3  The Early Modern Mediterranean, 1500-1800 ", "code": "HISB62H3", "description": "An exploration of the interplay of culture, religion, politics and commerce in the Mediterranean region from 1500 to 1800. Through travel narratives, autobiographical texts, and visual materials we will trace how men and women on the Mediterranean's European, Asian, and African shores experienced their changing world. 0.50 pre-1800 creditTransnational Area.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISB74H3": {"title": "HISB74H3  Asian Foods and Global Cities ", "code": "HISB74H3", "description": "This course explores the social circulation of Asian-identified foods and beverages using research from geographers, anthropologists, sociologists, and historians to understand their changing roles in ethnic entrepreneur-dominated cityscapes of London, Toronto, Singapore, Hong Kong, and New York. Foods under study include bryani, curry, coffee, dumplings, hoppers, roti, and tea. Same as GASB74H3", "breath_req": "Social & Behavioural Sciences"}, "HISB93H3": {"title": "HISB93H3  Modern Europe I: The Nineteenth Century ", "code": "HISB93H3", "description": "Europe from the French Revolution to the First World War. Major topics include revolution, industrialization, nationalism, imperialism, science, technology, art and literature.European Area", "exclusions": ["HIS241H", "HISB90H3", "HISB92H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISB94H3": {"title": "HISB94H3  Modern Europe II: The Twentieth Century ", "code": "HISB94H3", "description": "Europe from the First World War to the present day. War, political extremism, economic crisis, scientific and technological change, cultural modernism, the Holocaust, the Cold War, and the European Union are among the topics covered.European Area", "exclusions": ["HIS242H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISC01H3": {"title": "HISC01H3  History and Evidence ", "code": "HISC01H3", "description": "An examination of the nature and uses of evidence in historical and related studies.Historians use a wide variety of sources as evidence for making meaningful statements about the past. This course explores what is meant by history and how historians evaluate sources and test their reliability as historical evidence.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB03H3", "list": ["HISB03H3"]}}, "HISC03H3": {"title": "HISC03H3  History of Animals and People ", "code": "HISC03H3", "description": "An examination of the places of animals in global history. The course examines on-going interactions between humans and animals through hunting, zoos, breeding, and pets and the historical way the divide between humans and animals has been measured. Through animals, people have often thought about what it means to be human. Same as (IEEC03H3) Transnational Area", "exclusions": ["HISD03H3", "IEEC03H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 2.5 credits in History.", "list": []}}, "HISC04H3": {"title": "HISC04H3  Drink in History ", "code": "HISC04H3", "description": "This class seeks to recover a celebratory side of human experience that revolves around alcohol and stimulating beverages. Although most societies have valued psychoactive beverages, there has also been considerable ambivalence about the social consequences of excessive drinking. Students will examine drinking cultures through comparative historical study and ethnographic observation.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "2.5 credits in HIS courses", "list": []}}, "HISC05H3": {"title": "HISC05H3  Feeding the City, from Babylon to Brampton ", "code": "HISC05H3", "description": "This course puts urban foods in world historical perspective using case studies from around the world and throughout time. Topics include provisioning, food preparation and sale, and cultures of consumption in courts, restaurants, street vendors, and domestic settings. Students will practice historical and geographical methodologies to map and interpret foodways.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit in HIS courses", "list": []}}, "HISC08H3": {"title": "HISC08H3  Colonialism on Film ", "code": "HISC08H3", "description": "An examination of the depiction of empires and the colonial and postcolonial experience on film. This course also introduces students to the development of national cinemas in Asia, Africa, the Caribbean and the South Pacific. The relationship between academic history and history as imagined by filmmakers is a key theme. Transnational Area", "exclusions": ["HISB18H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 1.0 credit in History.", "list": []}}, "HISC09H3": {"title": "HISC09H3  Pirates of the Caribbean ", "code": "HISC09H3", "description": "This course examines early modern globalization through that cosmopolitan actor, the pirate. Beginning in the Caribbean, we will explore networks of capitalism, migration, empire, and nascent nationalism. By studying global phenomena through marginalized - participants pirates, maroons, rebels, and criminals - we seek alternate narratives on the modern worlds origins.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit in HIS courses", "list": []}}, "HISC10H3": {"title": "HISC10H3  Environment, Society and Economy in Ptolemaic and Roman Egypt ", "code": "HISC10H3", "description": "This course provides a review of the environmental, social and economic features of Egypt from 332 BC to 642 AD. Same as (IEEC52H3), CLAC05H3 0.50 pre-1800 credit Ancient World Area", "exclusions": ["IEEC52H3", "CLAC05H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "2.0 credits in CLA or HIS courses, including 2 of the following [CLAA04H3/HISA07H3, CLAB05H3/HISB10H3, CLAB06H3/HISB11H3]", "list": ["CLAA04H3", "HISA07H3", "CLAB05H3", "HISB10H3", "CLAB06H3", "HISB11H3"]}}, "HISC11H3": {"title": "HISC11H3  Multiculturalism and Cultural Identities in the Greek and Roman Worlds ", "code": "HISC11H3", "description": "A critical examination of multiculturalism and cultural identities in the Greek and Roman worlds. Special attention will be dedicated to the evidences through which these issues are documented and to their fundamental influence on the formation and evolution of ancient Mediterranean societies and cultures. Same as CLAC24H3 0.5 pre-1800 credit Ancient World Area", "exclusions": ["CLAC24H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "One full credit in Classics or History", "list": []}}, "HISC18H3": {"title": "HISC18H3  Europe in the Enlightenment, 1700-1789 ", "code": "HISC18H3", "description": "An examination of the ideals of the Enlightenment against the background of social and political change in eighteenth-century Europe. This course looks at Enlightenment thought and the ways in which European monarchs like Frederick the Great and Catherine the Great adapted it to serve their goals of state building. 0.50 pre-1800 creditEuropean Area", "exclusions": ["HIS244H", "HIS341Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit at B-level in European history", "list": []}}, "HISC26H3": {"title": "HISC26H3  The French Revolution and the Napoleonic Empire ", "code": "HISC26H3", "description": "The course will present the causes, processes, principles, and effects of the French Revolution. It will additionally present the relationship between the French Revolution and the Haitian Revolution, and look at the rise of Napoleon Bonaparte.", "exclusions": ["HIS457H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISC27H3": {"title": "HISC27H3  The History of European Sexuality: From Antiquity to the Present ", "code": "HISC27H3", "description": "The course will cover major developments in sexuality in Europe since antiquity. It will focus on the manner in which social, political, and economic forces influenced the development of sexuality. It will also analyze how religious beliefs, philosophical ideas, and scientific understanding influenced the ways that sexuality was understood.", "breath_req": "History, Philosophy & Cultural Studies"}, "HISC29H3": {"title": "HISC29H3  Global Commodities: Nature, Culture, History ", "code": "HISC29H3", "description": "This course explores familiar commodities in terms of natural origins, everyday cultures of use, and global significance. It analyses environmental conditions, socio-economic transactions, political, religious, and cultural contexts around their production, distribution, and consumption. Commodity case studies will be selected among tea, opium, chocolate, rice, bananas, cotton, rubber, coffee, and sugar.Transnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.5 credits in History", "list": []}}, "HISC30H3": {"title": "HISC30H3  The U.S. and the World ", "code": "HISC30H3", "description": "Collectively, immigrants, businesspeople, investors, missionaries, writers and musicians may have been as important as diplomats geopolitical strategies in creating networks of connection and exchange between the United States and the world. This course focuses on the changing importance and interactions over time of key groups of state and non-state actors.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit at the A-level in AFS, GAS or HIS courses", "list": []}}, "HISC32H3": {"title": "HISC32H3  The Emergence of Modern America, 1877-1933 ", "code": "HISC32H3", "description": "Overview of the political and social developments that produced the modern United States in the half-century after 1877. Topics include urbanization, immigration, industrialization, the rise of big business and of mass culture, imperialism, the evolution of the American colour line, and how Americans used politics to grapple with these changes.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB31H3", "list": ["HISB31H3"]}}, "HISC33H3": {"title": "HISC33H3  Modern American Political Culture ", "code": "HISC33H3", "description": "An examination of the relationship between culture and politics in modern American history. The course considers culture as a means through which Americans expressed political desires. Politics, similarly, can be understood as a forum for cultural expression. Topics include imperialism, immigration and migration, the Cold War, and the \"culture wars\". United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3]", "list": ["HISB30H3", "HISB31H3"]}}, "HISC34H3": {"title": "HISC34H3  Race, Segregation, Protest:  South Africa and the United States ", "code": "HISC34H3", "description": "This transnational history course explores the origins, consolidation, and unmaking of segregationist social orders in the American South and South Africa. It examines the origins of racial inequality, the structural and socio-political roots of segregation, the workings of racial practices and ideologies, and the various strategies of both accommodation and resistance employed by black South Africans and African Americans from the colonial era up to the late twentieth century.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "AFSB51H3 or HISB31H3", "list": ["AFSB51H3", "HISB31H3"]}}, "HISC36H3": {"title": "HISC36H3  People in Motion: Immigrants and Migrants in U.S. History ", "code": "HISC36H3", "description": "Overview of the waves of immigration and internal migration that have shaped America from the colonial period to the present. Topics include colonization and westward migration, immigrants in the industrial and contemporary eras, nativism, stances towards pluralism and assimilation, and how migration experiences have varied by race, class, and gender.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3] or [any 8.0 credits, including SOCB60H3]", "list": ["HISB30H3", "HISB31H3", "SOCB60H3"]}}, "HISC38H3": {"title": "HISC38H3  Mexico Through American Eyes ", "code": "HISC38H3", "description": "This course focuses on the period of the Mexican revolution, 1910 through 1940, and will explore the influence of this political and social upheaval on changing cultural relations between the peoples of the United States and Mexico as seen through the work of foreign travellers, journalists, writers, filmmakers and photographers.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB30H3 and HISB31H3", "list": ["HISB30H3", "HISB31H3"]}}, "HISC39H3": {"title": "HISC39H3  Hellhound on My Trail: Living the Blues in the Mississippi Delta, 1890-1945 ", "code": "HISC39H3", "description": "This course examines black life and culture in the cotton South through the medium of the blues. Major topics include: land tenure patterns in southern agriculture, internal and external migration, mechanisms of state and private labour control, gender conventions in the black community, patterns of segregation and changing race relations.", "exclusions": ["HIS478H"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISC45H3": {"title": "HISC45H3  Immigrants and Race Relations in Canadian History ", "code": "HISC45H3", "description": "An examination of aspects of the history of immigrants and race relations in Canada, particularly for the period 1840s 1960s. The course covers various immigrant and racialized groups and explores how class, gender and race/ethnicity shaped experiences and racial/ethnic relations.Canadian Area", "exclusions": ["HIS312H"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 4.0 credits", "list": []}}, "HISC46H3": {"title": "HISC46H3  Canada and the World ", "code": "HISC46H3", "description": "A look at Canada's evolution in relation to developments on the world stage. Topics include Canada's role in the British Empire and its relationship with the U.S., international struggles for women's rights, Aboriginal peoples' sovereignty and LGBT equality, socialism and communism, the World Wars, decolonization, the Cold War, humanitarianism, and terrorism. Canadian Area", "exclusions": ["HIS311H", "HIS311Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB40H3 or HISB41H3", "list": ["HISB40H3", "HISB41H3"]}}, "HISC52H3": {"title": "HISC52H3  Ethiopia: Seeing History ", "code": "HISC52H3", "description": "This course uses a focus on material history and visual culture to explore Ethiopia from the fourth through the nineteenth century, with particular emphasis on the Christian Church, the monarchy, links with both the Mediterranean world and the Indian subcontinent, and the relationship of individuals to their social, economic, artistic and geographic environments.Same as AFSC52H3 and VPHC52H3 0.50 pre-1800 creditAfrica and Asia Area", "exclusions": ["AFSC52H3", "VPHC52H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[1.0 credit in History] or [VPHA46H3 and ACMB01H3 and an additional 1.0 credit in VPH courses]", "list": ["VPHA46H3", "ACMB01H3"]}}, "HISC55H3": {"title": "HISC55H3  War and Society in Modern Africa ", "code": "HISC55H3", "description": "Conflict and social change in Africa from the slave trade to contemporary times. Topics include the politics of resistance, women and war, repressive and weak states, the Cold War, guerrilla movements, resource predation. Case studies of anticolonial rebellions, liberation wars, and civil conflicts will be chosen from various regions.Same as AFSC55H3Africa and Asia Area", "exclusions": ["AFSC55H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3 or (HISC50H3) or (HISC51H3)", "list": ["AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISC50H3", "HISC51H3"]}}, "HISC56H3": {"title": "HISC56H3  Comparative Studies of East Asian Legal Cultures ", "code": "HISC56H3", "description": "An introduction to the distinctive East Asian legal tradition shared by China, Japan, and Korea through readings about selected thematic issues. Students will learn to appreciate critically the cultural, political, social, and economic causes and effects of East Asian legal cultures and practices. Same as GASC50H3 Africa and Asia Area", "exclusions": ["GASC50H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB58H3 or an equivalent B-level history course in East Asia.", "list": ["HISB58H3"]}}, "HISC57H3": {"title": "HISC57H3  China and the World ", "code": "HISC57H3", "description": "A study of the history of China's relationship with the rest of the world in the modern era. The readings focus on China's role in the global economy, politics, religious movements, transnational diasporas, scientific/technological exchanges, and cultural encounters and conflicts in the ages of empire and globalization.  Africa and Asia Area Same as GASC57H3", "exclusions": ["GASC57H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISA06H3 or HISB58H3", "list": ["HISA06H3", "HISB58H3"]}}, "HISC58H3": {"title": "HISC58H3  Delhi and London: Imperial Cities, Mobile People ", "code": "HISC58H3", "description": "Delhi and London were two major cities of the British Empire. This course studies their parallel destinies, from the imperial into the post-colonial world. It explores how diverse cultural, ecological, and migratory flows connected and shaped these cities, using a wide range of literary, historical, music, and film sources.Transnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[Two of (HISA01H3), (HISA02H3), HISA04H3, HISA05H3] or 1.0 credit in Modern History", "list": ["HISA01H3", "HISA02H3", "HISA04H3", "HISA05H3"]}}, "HISC59H3": {"title": "HISC59H3  The Making of Tamil Worlds ", "code": "HISC59H3", "description": "This course explores the transnational history of Tamil worlds. In addition to exploring modern Tamil identities, the course will cover themes such as mass migration, ecology, social and economic life, and literary history. Same as GASC59H3Africa and Asia Area", "exclusions": ["GASC59H3", "HISB54H3", "GASB54H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "4.0 credits and [an additional 0.5 credit in HCS or ANT courses]", "list": []}}, "HISC60H3": {"title": "HISC60H3  Old Worlds? Strangers and Foreigners in the Mediterranean, 1200-1700 ", "code": "HISC60H3", "description": "An exploration of how medieval and early modern societies encountered foreigners and accounted for foreignness, as well as for religious, linguistic, and cultural difference more broadly. Topics include: monsters, relics, pilgrimage, the rise of the university, merchant companies, mercenaries, piracy, captivity and slavery, tourism, and the birth of resident embassies.  Same as (IEEC51H3) 0.50 pre-1800 credit Transnational Area", "exclusions": ["IEEC51H3"], "breath_req": "History, Philosophy & Cultural Studies"}, "HISC65H3": {"title": "HISC65H3  Venice and its Empire, 800-1800 ", "code": "HISC65H3", "description": "Social and cultural history of the Venetian Empire from a fishermen's colony to the Napoleonic Occupation of 1797. Topics include the relationships between commerce and colonization in the Mediterranean, state building and piracy, aristocracy and slavery, civic ritual and spirituality, guilds and confraternities, households and families. 0.50 pre-1800 creditEuropean Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit in History", "list": []}}, "HISC68H3": {"title": "HISC68H3  Constructing the Other:  Orientalism through Time and Place ", "code": "HISC68H3", "description": "This course reflects on the concept of Orientalism and how it informs the fields of Classical Studies and Anthropology. Topics to be discussed include the Orientalization of the past and the origin, role, and significance of ancient representations of the \"Other\" in contemporary discourses. Same as ANTC58H3 and CLAC68H3", "exclusions": ["ANTC58H3", "CLAC68H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit from the following:  [CLAA04H3/HISA07H3, CLAB05H3/HISB10H3, CLAB06H3/HISB11H3, ANTA02H3, ANTB19H3, ANTB20H3, HISB02H3, AFSB50H3/HISB50H3, AFSB51H3/HISB51H3, HISB53H3, HISB57H3, HISB58H3, HISB60H3, HISB61H3, HISB62H3, HISB93H3, HISB94H3]", "list": ["CLAA04H3", "HISA07H3", "CLAB05H3", "HISB10H3", "CLAB06H3", "HISB11H3", "ANTA02H3", "ANTB19H3", "ANTB20H3", "HISB02H3", "AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISB53H3", "HISB57H3", "HISB58H3", "HISB60H3", "HISB61H3", "HISB62H3", "HISB93H3", "HISB94H3"]}}, "HISC70H3": {"title": "HISC70H3  The Caribbean Diaspora ", "code": "HISC70H3", "description": "The migration of Caribbean peoples to the United States, Canada, and Europe from the late 19th century to the present. The course considers how shifting economic circumstances and labour demands, the World Wars, evolving imperial relationships, pan-Africanism and international unionism, decolonization, natural disasters, and globalization shaped this migration. Same as AFSC70H3 Transnational Area ", "exclusions": ["NEW428H", "AFSC70H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 4.0 credits", "list": []}}, "HISC75H3": {"title": "HISC75H3  Migration in Global History ", "code": "HISC75H3", "description": "A survey of human mobility from the era when humans first populated the earth to the global migrations of our own time. An introduction to the main categories of human movement and to historical and modern arguments for fostering or restricting migration.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 4.0 credits", "list": []}}, "HISC96H3": {"title": "HISC96H3  Language and Society in the Arab World ", "code": "HISC96H3", "description": "An examination of the relationship between language, society and identity in North Africa and the Arabic-speaking Middle East from the dawn of Islam to the contemporary period. Topics include processes of Arabization and Islamization, the role of Arabic in pan-Arab identity; language conflict in the colonial and postcolonial periods; ideologies of gender and language among others. Same as AFSC30H3", "exclusions": ["AFSC30H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "Any B-level course in African Studies, Linguistics, History, or Women's and Gender Studies", "list": []}}, "HISC97H3": {"title": "HISC97H3  Women in Sub-Saharan Africa ", "code": "HISC97H3", "description": "This course examines women in Sub-Saharan Africa in the pre-colonial, colonial and postcolonial periods. It covers a range of topics including slavery, colonialism, prostitution, nationalism and anti-colonial resistance, citizenship, processes of production and reproduction, market and household relations, and development. Same as AFSC97H3", "exclusions": ["AFSC97H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "AFSA01H3 or HISB50H3/AFSB50H3 or HISB51H3/AFSB51H3", "list": ["AFSA01H3", "HISB50H3", "AFSB50H3", "HISB51H3", "AFSB51H3"]}}, "HISD01H3": {"title": "HISD01H3  Independent Studies: Senior Research Project ", "code": "HISD01H3", "description": "This option is available in rare and exceptional circumstances to students who have demonstrated a high level of academic maturity and competence. Qualified students will have the opportunity to investigate an historical field which is of common interest to both student and supervisor.", "exclusions": ["HIS497Y", "HIS498H", "HIS499H", "HIS499Y"], "prerequisite": {"str": "At least 15.0 credits and completion of the requirements for the Major Program in History; written permission must be obtained from the instructor in the previous session.", "list": []}}, "HISD02H3": {"title": "HISD02H3  Independent Studies: Senior Research Project ", "code": "HISD02H3", "description": "This option is available in rare and exceptional circumstances to students who have demonstrated a high level of academic maturity and competence. Qualified students will have the opportunity to investigate an historical field which is of common interest to both student and supervisor.", "exclusions": ["HIS497Y", "HIS498H", "HIS499H", "HIS499Y"], "prerequisite": {"str": "At least 15.0 credits and completion of the requirements for the Major Program in History; written permission must be obtained from the instructor in the previous session.", "list": []}}, "HISD04H3": {"title": "HISD04H3  Missionaries and Converts in the Early Modern World ", "code": "HISD04H3", "description": "A seminar exploring how early modern people thought about and practiced community, belief, and ritual. We will relate conversion to processes of empire building, and examine whether the \"globalization of Christianity\" is a useful concept through which to understand the experiences of missionaries and converts from 1500 to 1800. 0.50 pre-1800 creditTransnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB62H3", "list": ["HISB62H3"]}}, "HISD05H3": {"title": "HISD05H3  Between Two Worlds? Translators and Interpreters in History ", "code": "HISD05H3", "description": "A seminar exploring the social history of translators, interpreters, and the texts they produce. Through several case studies from Ireland and Istanbul to Québec, Mexico City, and Goa, we will ask how translators shaped public understandings of \"self\" and \"other,\" \"civilization\" and \"barbarity\" in the wake of European colonization.\nTransnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credits, at or above the B-level, in History/GAS/IEE/CLA", "list": []}}, "HISD06H3": {"title": "HISD06H3  Global History of Crime and Punishment since 1750 ", "code": "HISD06H3", "description": "An exploration of the global problem of crime and punishment. The course investigates how the global processes of colonialism, industrialization, capitalism and liberalization affected modern criminal justice and thus the state-society relationship and modern citizenry in different cultures across time and space.Same as GASD06H3Transnational Area", "exclusions": ["GASD06H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits completed including 1.0 credit in GAS or HIS courses at the B-level or above", "list": []}}, "HISD07H3": {"title": "HISD07H3  Themes in the History of Childhood and Culture ", "code": "HISD07H3", "description": "A comparative analysis of transnationational histories, and cultural and gendered ideologies of children and childhood through case studies of foundlings in Italy, factory children in England, orphans and adoption in the American West, labouring children in Canada and Australia, and mixed-race children in British India. Transnational AreaSame as WSTD07H3", "exclusions": ["WSTD07H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "At least 2 C-level courses in History and/or Women's and Gender Studies.", "list": []}}, "HISD08H3": {"title": "HISD08H3  Borderlands and Beyond: Thinking about a North American History ", "code": "HISD08H3", "description": "An examination of approaches to historical analysis that take us beyond the national narrative beginning with the study of borderlands between the United States and Mexico, comparing that approach with the study of Canada/United States borderlands and finishing with themes of a North American continental or transnational nature. United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3] or [HISB40H3 and HISB41H3]", "list": ["HISB30H3", "HISB31H3", "HISB40H3", "HISB41H3"]}}, "HISD10H3": {"title": "HISD10H3  Water Management in the Ancient Mediterranean World ", "code": "HISD10H3", "description": "This seminar type course addresses issues related to the relationships between ancient Mediterranean societies and their hydric environments in the Mediterranean from 5000 BC to 600 AD. Same as CLAD05H30.50 pre-1800 creditAncient World Area", "exclusions": ["CLAD05H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 11 full credits including 2 full credits in Classical Studies or History", "list": []}}, "HISD12H3": {"title": "HISD12H3  Making it Strange: Modernisms in European Art and Ideas, 1900-1945 ", "code": "HISD12H3", "description": "The course will focus on major developments in art and ideas in early twentieth century Europe. We will study experimental forms of art and philosophy that fall under the broad category of Modernism, including painting, music, literature, and film, as well as philosophical essays, theoretical manifestos, and creative scholarly works.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "One C-level credit in European History", "list": []}}, "HISD14H3": {"title": "HISD14H3  Selected Topics in Modern European History ", "code": "HISD14H3", "description": "This is a seminar-style course organized around a selected topic in Modern European History.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "7.5 credits in HIS courses, including [(HISB90H3) or (HISB91H3) or (HISB92H3) or HISB93H3]", "list": ["HISB90H3", "HISB91H3", "HISB92H3", "HISB93H3"]}}, "HISD16H3": {"title": "HISD16H3  Socialist Feminism in Global Context ", "code": "HISD16H3", "description": "A comparative exploration of socialist feminism, encompassing its diverse histories in different locations, particularly China, Russia, Germany and Canada. Primary documents, including literary texts, magazines, political pamphlets and group manifestos that constitute socialist feminist ideas, practices and imaginaries in different times and places will be central. We will also seek to understand socialist feminism and its legacies in relation to other contemporary stands of feminism. Same as WSTD16H3 Transnational Area", "exclusions": ["WSTD16H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "1.0 credit at the B-level and 1.0 credit at the C-level in HIS, WST, or other Humantities and Social Sciences courses", "list": []}}, "HISD18H3": {"title": "HISD18H3  Digital History ", "code": "HISD18H3", "description": "This seminar/lab introduces students to the exploding field of digital history. Through a combination of readings and hands-on digital projects, students explore how the Web radically transforms how both professional historians and others envision the past and express these visions in various media. Technical background welcome but not required.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits completed, including [1.0 credit at the C-level in HIS courses] and [0.5 credit in any AFS, CLA, GAS or WST courses]", "list": []}}, "HISD25H3": {"title": "HISD25H3  Oral History and Urban Change ", "code": "HISD25H3", "description": "An applied research methods course that introduces students to the methods and practice of Oral history, the history of Scarborough, the field of public history and community-based research. A critical part of the class will be to engage in fieldwork related to designing and conducting oral history interviews. Canadian Area", "exclusions": ["HISC28H3", "WSTC02H3", "WSTD10H3", "HISD44H3", "CITC10H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 4.0 credits in HIS courses", "list": []}}, "HISD30H3": {"title": "HISD30H3  Gendering America ", "code": "HISD30H3", "description": "The history of gender in the United States from the era of exploration to the present day. The changing social roles of men and women and the evolving constructions of femininity and masculinity. Particular topics include: work, family, sexuality, and state policy.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3]", "list": ["HISB30H3", "HISB31H3"]}}, "HISD31H3": {"title": "HISD31H3  Thinking of Diversity: Perspectives on American Pluralisms ", "code": "HISD31H3", "description": "A seminar exploring the evolution of American thinking about diversity -- ethnic, religious, and regional -- from colonial-era defenses of religious toleration to today's multiculturalism. Participants will consider pluralist thought in relation to competing ideologies, such as nativism, and compare American pluralisms to formulations arrived at elsewhere, including Canada. Transnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3] or [15.0 credits including SOCB60H3]", "list": ["HISB30H3", "HISB31H3", "SOCB60H3"]}}, "HISD34H3": {"title": "HISD34H3  Topics in American Social and Cultural History ", "code": "HISD34H3", "description": "This fourth-year seminar is funded by the Canada Research Chair in Urban History and is taught by an advanced graduate student in American history. The course, with topics varying from year to year will focus on major themes in American social and cultural history, such as, women's history, labour history, and/or the history of slavery and emancipation.United States and Latin America Area ", "prerequisite": {"str": "HISB30H3 and HISB31H3", "list": ["HISB30H3", "HISB31H3"]}}, "HISD35H3": {"title": "HISD35H3  The Politics of American Immigration, 1865-present ", "code": "HISD35H3", "description": "A seminar that puts contemporary U.S. debates over immigration in historical context, tracing the roots of such longstanding controversies as those over immigration restriction, naturalization and citizenship, immigrant political activism, bilingual education and \"English-only\" movements, and assimilation and multiculturalism. Extensive reading and student presentations are required.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[HISB30H3 and HISB31H3] or 15.0 credits including SOCB60H3]", "list": ["HISB30H3", "HISB31H3", "SOCB60H3"]}}, "HISD36H3": {"title": "HISD36H3  From New Deal to New Right: American Politics since 1933 ", "code": "HISD36H3", "description": "The most striking development in U.S. politics in the last half century has been the rebirth and rise to dominance of conservatism. This seminar examines the roots of today's conservative ascendancy, tracing the rise and fall of New Deal liberalism and the subsequent rise of the New Right.United States and Latin America Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB31H3", "list": ["HISB31H3"]}}, "HISD44H3": {"title": "HISD44H3  Nearby History: The Method and Practice of Local History ", "code": "HISD44H3", "description": "This course introduces students to the methods and practice of the study of local history, in this case the history of Scarborough. This is a service learning course that will require a commitment to working and studying in the classroom and the community as we explore forms of public history.Canadian Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "4.0 credits in History", "list": []}}, "HISD45H3": {"title": "HISD45H3  Canadian Settler Colonialism in Comparative Context ", "code": "HISD45H3", "description": "A seminar on Canadian settler colonialism in the 19th and 20th centuries that draws comparisons from the United States and elsewhere in the British Empire. Students will discuss colonialism and the state, struggles over land and labour, the role of race, gender, and geography in ideologies and practices of colonial rule, residential schools, reconciliation and decolonization.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB40H3 or HISB41H3", "list": ["HISB40H3", "HISB41H3"]}}, "HISD46H3": {"title": "HISD46H3  Selected Topics in Canadian Women's History ", "code": "HISD46H3", "description": "Weekly discussions of assigned readings. The course covers a broad chronological sweep but also highlights certain themes, including race and gender relations, working women and family economies, sexuality, and women and the courts. We will also explore topics in gender history, including masculinity studies and gay history.Same as WSTD46H3 Canadian Area", "exclusions": ["WSTD46H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any credit in Canadian history", "list": []}}, "HISD47H3": {"title": "HISD47H3  Cold War Canada in Comparative Contexts ", "code": "HISD47H3", "description": "A seminar on Cold War Canada that focuses on the early post-war era and examines Canadian events, developments, experience within a comparative North American context. Weekly readings are organized around a particular theme or themes, including the national insecurity state; reds, spies, and civil liberties; suburbia; and sexuality.Canadian Area ", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB41H3 and at least one other B- or C-level credit in History", "list": ["HISB41H3"]}}, "HISD48H3": {"title": "HISD48H3  The World Through Canadian Eyes ", "code": "HISD48H3", "description": "How have Canadians historically experienced, and written about, the world? In what ways have nationalism, imperialism, and ideas about gender and race given meaning to Canadian understandings of the world? Students will consider these questions by exploring the work of Canadian travel writers, missionaries, educators, diplomats, trade officials, and intellectuals.Canadian Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits, including [HISB40H3 or HISB41H3] and 1.0 additional credit at the B- or C-level in History", "list": ["HISB40H3", "HISB41H3"]}}, "HISD50H3": {"title": "HISD50H3  Southern Africa: Conquest and Resistance, 1652-1900 ", "code": "HISD50H3", "description": "A seminar study of the history of the peoples of southern Africa, beginning with the hunter-gatherers but concentrating on farming and industrializing societies. Students will consider pre-colonial civilizations, colonialism and white settlement, violence, slavery, the frontier, and the mineral revolution. Extensive reading and student presentations are required.Africa and Asia Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits including AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3 or HISC55H3", "list": ["AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISC55H3"]}}, "HISD51H3": {"title": "HISD51H3  Southern Africa: Colonial Rule, Apartheid and Liberation ", "code": "HISD51H3", "description": "A seminar study of southern African history from 1900 to the present. Students will consider industrialization in South Africa, segregation, apartheid, colonial rule, liberation movements, and the impact of the Cold War. Historiography and questions of race, class and gender will be important. Extensive reading and student presentations are required.Same as AFSD51H3Africa and Asia Area", "exclusions": ["AFSD51H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits including AFSB51H3/HISB51H3 or HISD50H3", "list": ["AFSB51H3", "HISB51H3", "HISD50H3"]}}, "HISD52H3": {"title": "HISD52H3  East African Societies in Transition ", "code": "HISD52H3", "description": "A seminar study of East African peoples from late pre-colonial times to the 1990's, emphasizing their rapid although uneven adaptation to integration of the region into the wider world. Transitions associated with migrations, commercialization, religious change, colonial conquest, nationalism, economic development and conflict, will be investigated. Student presentations are required. Same as AFSD52H3 Africa and Asia Area", "exclusions": ["AFSD52H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits including AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3 or HISC55H3", "list": ["AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISC55H3"]}}, "HISD56H3": {"title": "HISD56H3  'Coolies' and Others: Asian Labouring Diasporas in the British Empire ", "code": "HISD56H3", "description": "Coolie' labourers formed an imperial diaspora linking South Asia and China to the Caribbean, Africa, the Indian Ocean, South-east Asia, and North America. The long-lasting results of this history are evident in the cultural and ethnic diversity of today's Caribbean nations and Commonwealth countries such as Great Britain and Canada. Africa and Asia AreaSame as GASD56H3", "exclusions": ["GASD56H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "[8.0 credits, of which at least 2.0 credits should be at the B-or C-level in Modern History] or [15.0 credits including SOCB60H3]", "list": ["SOCB60H3"]}}, "HISD58H3": {"title": "HISD58H3  Culture, Politics, and Society in Late Imperial China ", "code": "HISD58H3", "description": "A study of major cultural trends, political practices, social customs, and economic developments in late imperial China (1400-1911) as well as their relevance to modern and contemporary China. Students will read the most recent literature and write a substantive research paper. 0.5 pre-1800 credit Africa and Asia areaSame as GASD58H3", "exclusions": ["GASD58H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits including at least GASA01H3 or HISB58H3", "list": ["GASA01H3", "HISB58H3"]}}, "HISD59H3": {"title": "HISD59H3  Law and Society in Chinese History ", "code": "HISD59H3", "description": "A seminar course on Chinese legal tradition and its role in shaping social, political, economic, and cultural developments, especially in late imperial and modern China. Topics include the foundations of legal culture, regulations on sexuality, women's property rights, crime fictions, private/state violence, laws of ethnicities, prison reforms and modernization. 0.5 pre-1800 credit Africa and Asia AreaSame as GASD59H3 ", "exclusions": ["GASD59H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "At least 8.0 credits completed, or [HISB58H3 or GASB58H3].", "list": ["HISB58H3", "GASB58H3"]}}, "HISD60H3": {"title": "HISD60H3  Travelling and Travel-Writing from the Middle Ages to the Early Modern Period ", "code": "HISD60H3", "description": "The development of travel and travel narratives before 1800, and their relationship to trade and colonization in the Mediterranean and beyond. Topics include: Marco Polo, pilgrimage and crusading, the history of geography and ethnography. Extensive reading, oral presentations, and a final paper based on research in primary documents are required. 0.50 pre-1800 credit Transnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB62H3 or HISC60H3 or HISC65H3", "list": ["HISB62H3", "HISC60H3", "HISC65H3"]}}, "HISD63H3": {"title": "HISD63H3  The Crusades: I ", "code": "HISD63H3", "description": "Modern interpretations of the Crusades will be investigated in the broad context of Western expansion into the Middle East (1099-1204), Spain and southern Europe, and, North-Eastern Europe. Also considered will be the Christian Military Orders, the Mongols and political crusades within Europe itself. 0.50 pre-1800 creditMedieval Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB60H3 and HISB61H3", "list": ["HISB60H3", "HISB61H3"]}}, "HISD64H3": {"title": "HISD64H3  The Crusades: II ", "code": "HISD64H3", "description": "An intensive study of the primary sources of the First through Fourth Crusades, including works by Eastern and Western Christian, Arab and Jewish authors. The crusading period will be considered in terms of Western Christian expansion into the Middle East, Spain and Northern Europe in the 11th through 13th centuries. 0.50 pre-1800 creditMedieval Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISB60H3 and HISB61H3", "list": ["HISB60H3", "HISB61H3"]}}, "HISD70H3": {"title": "HISD70H3  History of Empire and Foods ", "code": "HISD70H3", "description": "A transnational history of how the rise of modern, global empires reshaped how the world produced and consumed food. This course, through cooking practicums, offers a hands-on approach to imperial and culinary histories with emphasis on plantation economies, famine, the tropical commodity trade, and the rise of national cuisines. Transnational Area", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "8.0 credits, including [(HISC14H3) or HISB14H3]", "list": ["HISC14H3", "HISB14H3"]}}, "HISD71H3": {"title": "HISD71H3  Culinary Ethnography ", "code": "HISD71H3", "description": "This research seminar uses Scarborough as a laboratory for examining continuity and change within diasporic foodways. Students will practice ethnographic research and mapping skills to document a family meal, restaurant, market, festival, dish, or other culinary icon. They will also write an essay setting it within an appropriate analytical framework.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "HISC04H3 or [(HISC14H3) or HISB14H3]", "list": ["HISC04H3", "HISC14H3", "HISB14H3"]}}, "HISD72H3": {"title": "HISD72H3  History of Beer and Brewing ", "code": "HISD72H3", "description": "This research seminar examines the history of beer, including production techniques, gender roles, and drinking cultures, from ancient times to contemporary microbrewing. Students will produce a major paper or digital project on a chosen case study. Class will include a practicum on historical technologies of malting, mashing, and fermenting.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 8.0 credits in AFS, CLA, GAS, HCS, HIS, RLG, and/or WST courses", "list": []}}, "HISD73H3": {"title": "HISD73H3  Engendering Canadian Food History ", "code": "HISD73H3", "description": "This course explores Canada's diverse food cultures and the varied relationships that Canadians have had historically with food practices in the context of family, community, region, and nation and with reference to transnational connections and identities. It examines Canada's foodways - the practices and traditions associated with food and food preparation - through the gendered lens of Indigenous-colonial relations, migration and diaspora, family, politics, nutrition, and popular culture. The course is organized around two central principles. One is that just as Canada's rich past resists any singular narrative, there is no such thing as a singular Canadian food tradition. The other is that a focus on questions related to women and gender further illuminate the complex relationship between food and cultural politics, variously defined. The course covers a broad time-span, from early contact between European settlers and First Nations through the end of the twentieth century.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "4.0 credits in HIS, WST or FST courses", "list": []}}, "HISD95H3": {"title": "HISD95H3  Presenting the Past ", "code": "HISD95H3", "description": "This course introduces students to creative ways of telling/conveying stories about historical moments, events, figures and the social context in which these have occurred. The course will enable students to narrate the past in ways, from film to fiction, accessible to contemporary audiences.", "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Any 4.0 credits in HIS courses", "list": []}}}