{"VPHC54H3": {"breath_req": "Arts, Literature & Language", "description": "Art criticism as a complex set of practices performed not only by critics, art historians, curators and the like, but also by artists (and collectors). The traditional role of art critics in the shaping of an art world, and the parallel roles played by other forms of writing about art and culture (from anthropology, sociology, film studies). ", "prerequisite": {"list": [], "str": "2.0 full credits at the B-level from VPA, VPH, and/or VPS"}, "title": "VPHC54H3  Art Writing ", "code": "VPHC54H3"}, "ASTB03H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "4.0 full credits"}, "title": "ASTB03H3  Great Moments in Astronomy ", "exclusions": {"list": ["AST210H"], "str": "AST210H"}, "description": "An examination of the people, the background and the events associated with some major advances in astronomy.Emphasis is given to the role of a few key individuals and to how their ideas have revolutionized our understanding of nature and the Universe. The perspective gained is used to assess current astronomical research and its impact on society.", "code": "ASTB03H3"}, "ANTD25H3": {"breath_req": "Natural Sciences", "description": "This course will examine the social and cultural contexts of animal-to-human disease transmission globally, and the public risks associated zoonoses present here in Canada. The course will incorporate both anthropological and epidemiological perspectives.Science credit", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3", "HLTA01H3", "ANTC35H3", "SOCB06H3", "STAB22H3"], "str": "ANTB14H3 and ANTB15H3 and (HLTA01H3) and [ANTC35H3 or (SOCB06H3) or STAB22H3]"}, "title": "ANTD25H3  Medical Primatology: Public Health Perspectives on Zoonotic Diseases ", "code": "ANTD25H3"}, "ANTC52H3": {"breath_req": "Arts, Literature & Language", "description": "Language and ways of speaking are foundational to political cultures. This course covers the politics of language in the age of globalization, including multiculturalism and immigration, citizenship, race and ethnicity, post-colonialism, and indigeneity. Ethnographic examples are drawn from a variety of contexts, including Canadian official bilingualism and First Nations.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC52H3  Global Politics of Language ", "code": "ANTC52H3"}, "ACMD01H3": {"breath_req": "Arts, Literature & Language", "description": "An advanced study of the arts, culture and/or media sector through reflective practice. Students will further engage with work places as \"learning laboratories\", and play a mentorship role for students in earlier stages of the experiential education process.", "prerequisite": {"list": ["ACMC01H3"], "str": "ACMC01H3"}, "title": "ACMD01H3  ACMEE Applied Practice II ", "code": "ACMD01H3"}, "VPHC73H3": {"breath_req": "Social & Behavioural Sciences", "description": "The interplay among visual, performing and literary arts and experience of exile, diaspora, displacement and placemaking: how the nomadic, transitional nature of today's world influences contemporary artists' practices. Readings from art history, visual anthropology, cultural studies, ethnic studies and literary criticism. Considerations of memory, autobiography, community and liminality in relation to experiences of local Canadian artists.", "exclusions": {"list": ["VPAB09H3"], "str": "(VPAB09H3)"}, "title": "VPHC73H3  Home, Away and In Between: Artists, Art, and Identity ", "code": "VPHC73H3"}, "VPHB68H3": {"breath_req": "Arts, Literature & Language", "description": "This course explores the relationship between visuality and practices of everyday life. It looks at the interaction of the political, economic and aesthetic aspects of mass media with the realm of \"fine\" arts across history and cultures. We will explore notions of the public, the mass, and the simulacrum.", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB68H3  Art and the Everyday: Mass Culture and the Visual Arts ", "code": "VPHB68H3"}, "ANTC59H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3", "MDSA01H3", "MDSB05H3", "ACMB01H3"], "str": "[ANTB19H3 and ANTB20H3] or [MDSA01H3 and MDSB05H3 and ACMB01H3]"}, "title": "ANTC59H3  Anthropology of Language and Media ", "exclusions": {"list": ["ANTB21H3", "MDSB02H3", "MDSC21H3"], "str": "(ANTB21H3), (MDSB02H3), MDSC21H3"}, "description": "Anthropology studies language and media in ways that show the impact of cultural context. This course introduces this approach and also considers the role of language and media with respect to intersecting themes: ritual, religion, gender, race/ethnicity, power, nationalism, and globalization. Class assignments deal with lecturers, readings, and students' examples. Same as MDSC21H3", "code": "ANTC59H3"}, "ANTC19H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines economic arrangements from an anthropological perspective. A key insight to be examined concerns the idea that by engaging in specific acts of production, people produce themselves as particular kinds of human beings. Topics covered include gifts and commodities, consumption, global capitalism and the importance of objects as cultural mediators in colonial and post-colonial encounters.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC19H3  Producing People and Things: Economics and Social Life ", "code": "ANTC19H3"}, "VPHB39H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3", "ACMA01H3"], "str": "VPHA46H3 or ACMA01H3"}, "title": "VPHB39H3  Ten Key Words in Art History: Unpacking Methodology ", "exclusions": {"list": ["FAH102H"], "str": "FAH102H"}, "description": "Key concepts in art history, including intention, meaning, style, materiality, identity, production, reception, gender, visuality, and history. Students will explore critical questions such as whether and how to read artist's biographies into their art. This course helps students understand the discipline and develops critical thinking and research skills required in advanced courses.", "code": "VPHB39H3"}, "ANTD20H3": {"breath_req": "Social & Behavioural Sciences", "description": "A field-based research seminar exploring the cultural dimensions of community and sense of place. Partnering with community-based organizations in Scarborough and the GTA, students will investigate topical issues in the immediate urban environment from an anthropological perspective. Yearly foci may include food, heritage, diaspora, and family.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and [at least 1.0 credit at the C-level in Socio-Cultural Anthropology courses]"}, "title": "ANTD20H3  Culture and Community ", "code": "ANTD20H3"}, "ANTB16H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the creation or invention of a Canadian national identity in literature, myth and symbolism, mass media, and political culture. Ethnographic accounts that consider First Nations, regional, and immigrant identities are used to complicate the dominant story of national unity. Area course", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3 or [any 4.0 credits in ANT, HLT, IDS, CIT, GGR, POL, SOC or HCS courses]"}, "title": "ANTB16H3  Canadian Cultural Identities ", "code": "ANTB16H3"}, "AFSA03H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["AFSA01H3", "IDSA01H3"], "str": "AFSA01H3 or IDSA01H3"}, "title": "AFSA03H3  Experiencing Development in Africa ", "exclusions": {"list": ["IDSA02H3"], "str": "IDSA02H3"}, "description": "This experiential learning course allows students to experience first hand the realities, challenges, and opportunities of working with development organizations in Africa. The goal is to allow students to actively engage in research, decision-making, problem solving, partnership building, and fundraising, processes that are the key elements of development work.Same as IDSA02H3", "code": "AFSA03H3"}, "ACMD91H3": {"description": "Independent study of an advanced and intensive kind, under the direction of a faculty member. The material studied should bear some significant relation to the student's previous work, and should differ significantly in content and/or concentration from topics offered in other courses.Students are advised that they must obtain consent from the supervising instructor before registering for these courses. The student should submit to the instructor a statement of objectives and proposed content for the course; this should be done by 15 April for 'F' courses and by 1 December for 'S' courses. If the proposal is approved, two faculty members from relevant disciplines will supervise and evaluate the work.", "prerequisite": {"list": [], "str": "3.0 credits at the B-level in the Department of Arts, Culture and Media."}, "exclusions": {"list": ["HUMD91H3"], "str": "(HUMD91H3)"}, "title": "ACMD91H3  Supervised Readings ", "code": "ACMD91H3"}, "VPHC53H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "1.0 credit in art history or in Asian or medieval European history."}, "title": "VPHC53H3  The Silk Routes ", "exclusions": {"list": ["GASC53H3"], "str": "GASC53H3"}, "description": "The Silk Routes were a lacing of highways connecting Central, South and East Asia and Europe. Utilizing the Royal Ontario Museum's collections, classes held at the Museum and U of T Scarborough will focus on the art produced along the Silk Routes in 7th to 9th century Afghanistan, India, China and the Taklamakhan regions. Same as GASC53H3", "code": "VPHC53H3"}, "ANTC99H3": {"breath_req": "Natural Sciences", "description": "This course examines 65 million years of evolutionary history for non-human primates. The primary emphasis will be on the fossil record. Topics covered may include the reconstruction of behaviour from fossil remains, the evolution of modern primate groups, and the origins of the Order.", "prerequisite": {"list": ["ANTA01H3", "ANTB14H3"], "str": "ANTA01H3 or ANTB14H3"}, "title": "ANTC99H3  Primate Evolution ", "code": "ANTC99H3"}, "VPAB16H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the theories and practice of leadership, employee and volunteer management, and organizational behaviour as they apply to the not-for-profit arts sector.", "prerequisite": {"list": ["VPAA10H3", "VPAA12H3"], "str": "VPAA10H3 and VPAA12H3"}, "title": "VPAB16H3  Managing and Leading in Cultural Organizations ", "code": "VPAB16H3"}, "VPHC52H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["VPHA46H3", "ACMB01H3"], "str": "[1.0 credit in History] or [VPHA46H3 and ACMB01H3 and an additional 1.0 credit in VPH courses]"}, "title": "VPHC52H3  Ethiopia: Seeing History ", "exclusions": {"list": ["AFSC52H3", "HISC52H3"], "str": "AFSC52H3, HISC52H3"}, "description": "This course uses a focus on material history and visual culture to explore Ethiopia from the fourth through the nineteenth century, with particular emphasis on the Christian Church, the monarchy, links with both the Mediterranean world and the Indian subcontinent, and the relationship of individuals to their social, economic, artistic and geographic environments.Same as AFSC52H3 and HISC52H3", "code": "VPHC52H3"}, "ANTD35H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTC47H3", "ANTC48H3"], "str": "ANTC47H3 and ANTC48H3"}, "title": "ANTD35H3  Bioarchaeology ", "exclusions": {"list": ["ANT434H", "ANT441H"], "str": "ANT434H, ANT441H"}, "description": "This course will focus on a new direction in anthropology, exploring the potential of skeletal remains in reconstructing past lifeways. This seminar style class will build upon concepts introduced in Human Osteology courses. Additionally, more advanced methods of reconstructing patterns of subsistence, diet, disease, demography and physical activity.", "code": "ANTD35H3"}, "ANTC61H3": {"breath_req": "Social & Behavioural Sciences", "description": "Social and symbolic aspects of the body, the life-cycle, the representation and popular explanation of illness, the logic of traditional healing systems, the culture of North American illness and biomedicine, mental illness, social roots of disease, innovations in health care delivery systems.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3", "HLTB42H3"], "str": "[ANTB19H3 and ANTB20H3] or HLTB42H3"}, "title": "ANTC61H3  Medical Anthropology: Illness and Healing in Cultural Perspective ", "code": "ANTC61H3"}, "ANTD41H3": {"breath_req": "Social & Behavioural Sciences", "description": "Taught by an advanced PhD student or postdoctoral fellow, and based on his or her doctoral research and area of expertise, this course presents a unique opportunity to explore intensively a particular Socio-Cultural or Linguistic Anthropology topic in-depth. Topics vary from year to year.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "[ANTB19H3 and ANTB20H3] and at least 2.0 credits at the C-level in Sociocultural Anthropology]"}, "title": "ANTD41H3  Topics in Emerging Scholarship in Socio-Cultural Anthropology ", "code": "ANTD41H3"}, "ANTB18H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3"}, "title": "ANTB18H3  Development, Inequality and Social Change in Latin America ", "exclusions": {"list": ["ANTC08H3"], "str": "(ANTC08H3)"}, "description": "This course addresses Latin American systems of inequality in relation to national and transnational political economy, from colonialism to neoliberalism; how ideas of race, culture, and nation intersect with development thinking and modernization agendas; and how the poor and marginalized have accommodated, resisted, and transformed cultural and political domination.Area course", "code": "ANTB18H3"}, "VPHB78H3": {"breath_req": "Arts, Literature & Language", "description": "Local arts institutions are often taken for granted but understanding how and why collections are formed, why they are significant, and how they relate to larger art historical contexts provides important object-based learning opportunities. Students will explore these issues using a focused collection in the Royal Ontario Museum, the Aga Khan Museum or the Textile Museum.", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB78H3  Our Town, Our Art: Local Collections I ", "code": "VPHB78H3"}, "ANTC09H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores Anthropological approaches to kinship and family arrangements. In addition to examining the range of forms that family arrangements can take cross-culturally, we also examine how kinship configurations have changed within our own society in recent years. Topics to be covered include trans-national adoption, \"mail-order-brides\", new reproductive technologies and internet dating.", "prerequisite": {"list": ["ANTA02H3", "ANTB19H3", "ANTB20H3"], "str": "ANTA02H3 and ANTB19H3 and ANTB20H3"}, "title": "ANTC09H3  Sex, Love, and Intimacy: Anthropological Approaches to Kinship and Marriage ", "code": "ANTC09H3"}, "ANTC67H3": {"breath_req": "Quantitative Reasoning", "description": "Epidemiology is the study of disease and its determinants in populations. It is grounded in the biomedical paradigm, statistical reasoning, and that risk is context specific. This course will examine such issues as: methods of sampling, types of controls, analysis of data, and the investigation of epidemics.Science credit", "prerequisite": {"list": [], "str": "Any B-level course in Anthropology or Biology and any statistics course."}, "title": "ANTC67H3  Foundations in Epidemiology ", "code": "ANTC67H3"}, "ANTC53H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3", "MDSA01H3", "MDSB05H3", "ACMB01H3"], "str": "[ANTB19H3 and ANTB20H3] or [MDSA01H3 and MDSB05H3 and ACMB01H3]"}, "title": "ANTC53H3  Anthropology of Media and Publics ", "exclusions": {"list": ["MDSC53H3"], "str": "MDSC53H3"}, "description": "How do media work to circulate texts, images, and stories? Do media create unified publics? How is the communicative process of media culturally-distinct? This course examines how anthropologists have studied communication that occurs through traditional and new media. Ethnographic examples drawn from several contexts.Same as MDSC53H3", "code": "ANTC53H3"}, "VPAC22H3": {"breath_req": "Arts, Literature & Language", "description": "Special topics for intensive practical, theoretical and/or experiential study of some specific aspects of Arts Management. The topic(s) to be explored in this course will change from session to session.", "prerequisite": {"list": ["VPAA10H3", "VPAA12H3", "VPAB16H3", "ACMB01H3"], "str": "10.0 credits, including VPAA10H3, VPAA12H3, VPAB16H3, and ACMB01H3"}, "title": "VPAC22H3  Special Topics in Arts Management II ", "code": "VPAC22H3"}, "ANTD22H3": {"description": "This seminar course will examine contemporary theory and questions in primatology and carefully examine the types of data that researchers collect to answer their research questions. Science credit", "prerequisite": {"list": ["ANTB22H3"], "str": "ANTB22H3 "}, "title": "ANTD22H3  Theory and Methodology in Primatology ", "code": "ANTD22H3"}, "ANTC18H3": {"breath_req": "Social & Behavioural Sciences", "description": "Urban spaces, neighbourhoods, and institutions have at different times been the focus of ethnographic studies of cities. In this course we will examine the role of culture, cultural diversity, space and performance in urban institutions.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "[ANTB19H3 and ANTB20H3] or [1.5 credits at the B-level in CIT courses]"}, "title": "ANTC18H3  Urban Anthropology ", "code": "ANTC18H3"}, "ACMD02H3": {"breath_req": "Arts, Literature & Language", "description": "An advanced study of the arts, culture and/or media sector through reflective practice. Students will further synthesize their classroom and work place / learning laboratory experiences, and play a mentorship role for students in earlier stages of the experiential education process.", "prerequisite": {"list": ["ACMD01H3"], "str": "ACMD01H3"}, "title": "ACMD02H3  ACMEE Applied Practice III ", "code": "ACMD02H3"}, "ANTD13H3": {"description": "An advanced seminar course primarily for majors and specialists in biological anthropology. Topic to be announced annually.", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3"], "str": "ANTB14H3 and ANTB15H3 and at least one C-level course in biological anthropology."}, "title": "ANTD13H3  Frontiers of Anthropology: A Biological Perspective ", "code": "ANTD13H3"}, "VPAC15H3": {"breath_req": "Arts, Literature & Language", "description": "A survey of the principles, structures and patterns of cultural policy and arts funding, both nationally and internationally. The course will explore a wide range of cultural policy issues, addressing both the subsidized arts and cultural industries sectors, and exploring the strengths and weaknesses of particular policy approaches.", "prerequisite": {"list": ["VPAA10H3", "VPAB05H3", "ACMB01H3", "SOCB58H3"], "str": "[8.0 credits, including VPAA10H3 and VPAB05H3 and ACMB01H3] or [8.0 credits, including SOCB58H3 and registration in the Minor in Culture, Creativity, and Cities]"}, "title": "VPAC15H3  Cultural Policy ", "code": "VPAC15H3"}, "AFSA01H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An interdisciplinary introduction to the history and development of African Studies with Africa's place in the wider world a key theme. Students critically engage with African and diasporic histories, cultures, social structures, economies, and belief systems. Course material is drawn from Archaeology, History, Anthropology, Geography, Literatures, the Arts and Women's Studies.", "exclusions": {"list": ["NEW150Y"], "str": "NEW150Y"}, "title": "AFSA01H3  Africa in the World: An Introduction ", "code": "AFSA01H3"}, "ANTC14H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines why, when, and how gender inequality became an anthropological concern by tracing the development of feminist thought in a comparative ethnographic framework.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC14H3  Feminism and Anthropology ", "code": "ANTC14H3"}, "ANTC35H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "ANTA01H3 and ANTA02H3"}, "title": "ANTC35H3  Quantitative Methods in Anthropology ", "exclusions": {"list": ["MGEB11H3", "ECMB11H3", "PSYB07H3", "SOCB06H3", "STAB22H3"], "str": "MGEB11H3/(ECMB11H3), PSYB07H3, (SOCB06H3), STAB22H3"}, "description": "A consideration of quantitative data and analytical goals, especially in archaeology and biological anthropology. Some elementary computer programming, and a review of program packages suitable for anthropological analyses will be included. Science credit", "code": "ANTC35H3"}, "ANTC41H3": {"breath_req": "Natural Sciences", "description": "Human adaptability refers to the human capacity to cope with a wide range of environmental conditions, including aspects of the physical environment like climate (extreme cold and heat), high altitude, geology, as well as aspects of the socio-cultural milieu, such as pathogens (disease), nutrition and malnutrition, migration, technology, and social change. Science credit", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3", "BIOA01H3", "BIOA02H3"], "str": "[ANTB14H3 and ANTB15H3] or [BIOA01H3 and BIOA02H3]"}, "title": "ANTC41H3  Environmental Stress, Culture and Human Adaptability ", "code": "ANTC41H3"}, "ANTB14H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTA01H3"], "str": "ANTA01H3"}, "title": "ANTB14H3  Biological Anthropology: Beginnings ", "exclusions": {"list": ["ANT203Y"], "str": "ANT203Y"}, "description": "This course surveys humanity's origin. The synthetic theory of evolution, its principles, processes, evidence and application underlie this course. Lecture topics and laboratory projects include: evolutionary theory, human variation, human adaptability, primate biology, and behaviour, taxonomy and classification, paleontological principles and human origins. Science credit", "code": "ANTB14H3"}, "ANTC07H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the intersection of the social and the material by examining the role of objects in making worlds. We examine the relationship between people, culture, and 'things' through topics such as commodification and consumption, collecting and representation, technology and innovation, art and artifact, and the social life of things.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC07H3  Material Worlds ", "code": "ANTC07H3"}, "VPHB64H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB64H3  Baroque Visions ", "exclusions": {"list": ["FAH231H", "FAH279H"], "str": "FAH231H, FAH279H"}, "description": "This course introduces the art and culture of 17th century Europe and its colonies. Art of the Baroque era offers rich opportunities for investigations of human exploration in geographic, spiritual, intellectual and political realms. We will also consider the development of the artist and new specializations in subject and media.", "code": "VPHB64H3"}, "ANTC17H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "ANTA01H3 and ANTA02H3"}, "title": "ANTC17H3  Human Origins: New Discoveries ", "exclusions": {"list": ["ANT332Y"], "str": "(ANT332Y)"}, "description": "The study of human origins in light of recent approaches surrounding human evolution. New fossil finds present new approaches and theory. This course will examine some of these, particularly the process of speciation and hominisation with specific reference to the emergence of Homo. Labs permit contact with fossils in casts. Science credit", "code": "ANTC17H3"}, "ANTB65H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3"}, "title": "ANTB65H3  An Introduction to Pacific Island Societies ", "exclusions": {"list": ["ANTC65H3"], "str": "(ANTC65H3)"}, "description": "Introduces the cultures and peoples of the Pacific. Examines the ethnography of the region, and the unique contributions that Pacific scholarship has made to the development of anthropological theory. Explores how practices of exchange, ritual, notions of gender, death and images of the body serve as the basis of social organization. Area course", "code": "ANTB65H3"}, "VPAB15H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to public programming, community arts, and education within the arts organization and beyond. This course will consider the practical and the broader historical, social and policy issues related to the relationship between arts programming and audiences. ", "prerequisite": {"list": ["VPAA10H3"], "str": "At least 4.0 credits including VPAA10H3"}, "title": "VPAB15H3  Arts Education and Outreach ", "code": "VPAB15H3"}, "AFSC55H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISC50H3", "HISC51H3"], "str": "AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3 or (HISC50H3) or (HISC51H3)"}, "title": "AFSC55H3  War and Society in Modern Africa ", "exclusions": {"list": ["HISC55H3"], "str": "HISC55H3"}, "description": "Conflict and social change in Africa from the slave trade to contemporary times. Topics include the politics of resistance, women and war, repressive and weak states, the Cold War, guerrilla movements, resource predation. Case studies of anti-colonial rebellions, liberation wars, and civil conflicts will be chosen from various regions._Same as HISC55H3Africa and Asia Area", "code": "AFSC55H3"}, "ANTC25H3": {"breath_req": "Social & Behavioural Sciences", "description": "How are we to understand the relationship between psychological universals and diverse cultural and social forms in the constitution of human experience? Anthropology's dialogue with Freud; cultural construction and expression of emotions, personhood, and self.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC25H3  Anthropology and Psychology ", "code": "ANTC25H3"}, "VPHD48H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "1.5 credits at the C-level in VPH courses"}, "title": "VPHD48H3  Advanced Seminar in Art History and Visual Culture ", "exclusions": {"list": ["FAH470H"], "str": "FAH470H"}, "description": "What is art history and visual culture? What do we know, and need to know, about how we study the visual world? This capstone course for senior students will examine the ambiguities, challenges, methods and theories of the discipline. Students will practice methodological and theoretical tenets, and follow independent research agendas.", "code": "VPHD48H3"}, "ANTD24H3": {"breath_req": "Social & Behavioural Sciences", "description": "An overview of the history of socio-cultural anthropology. This course focuses on certain key theoretical debates which run through it and largely determine the \"state of the art\" today. Evolutionary, diffusionist, psychological, cross-cultural, functionalist, structuralist, hermeneutical and other classical approaches are among those that will be considered through the works of major figures like Tylor, Durkheim, Boas, Kroeber, Malinowski, Radcliffe-Brown, Levi-Strauss, and others, up to the present. An attempt will be made to understand these individuals in terms of the social and intellectual climates in which they wrote.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least 1.0 credit at the C-level in socio-cultural anthropology"}, "title": "ANTD24H3  The History of Anthropological Thought ", "code": "ANTD24H3"}, "IMCB05H3": {"breath_req": "Natural Sciences", "description": "Practical experience in locating, collecting, and interpreting scientific information for the purpose of designing laboratory procedures. Students work individually under faculty supervision in a lab setting to perform the laboratory procedures and record the results and present a formal report. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB01H3", "IMCB02H3"], "str": "IMCB01H3 and IMCB02H3"}, "title": "IMCB05H3  Microbiology Project ", "code": "IMCB05H3"}, "ANTD04H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the social life of violence, its cultural production and political effects in a global perspective. It asks how social worlds are made and unmade through, against, and after violent events, how violence is remembered and narrated, and how ethnography might respond to experiences of suffering, trauma, and victimhood. ", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least one additional C-level course in socio-cultural anthropology."}, "title": "ANTD04H3  The Anthropology of Violence and Suffering ", "code": "ANTD04H3"}, "VPAD07H3": {"breath_req": "Social & Behavioural Sciences", "description": "Transformations in social and cultural institutions have been achieved through the agency of individuals who have embedded the values of pluralism in their personal and professional lives. Students will explore model examples and will develop projects they might use to advance this aim in a variety of professional situations.", "prerequisite": {"list": ["VPAB06H3", "VPAB07H3"], "str": "(VPAB06H3) or VPAB07H3"}, "title": "VPAD07H3  Agency and Pluralism in Social and Cultural Transformations ", "code": "VPAD07H3"}, "ACMA01H3": {"breath_req": "Arts, Literature & Language", "description": "ACMA01H3 surveys the cultural achievements of the humanities in visual art, language, music, theatre, and film within their historical, material, and philosophical contexts. Students gain understanding of the meanings of cultural works and an appreciation of their importance in helping define what it means to be human.", "exclusions": {"list": ["HUMA01H3"], "str": "(HUMA01H3)"}, "title": "ACMA01H3  Exploring Key Questions in the Arts, Culture and Media ", "code": "ACMA01H3"}, "ANTD15H3": {"description": "An advanced seminar course primarily for specialists and majors in Anthropology. Topic changes annually and is linked to the theme of our seminar series for the year. Students will attend talks by 2-3 guest speakers in addition to the regular seminar. In previous years, the theme has been Masculinities, Pilgrimage, History and Historicities.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least two C-level courses in socio-cultural anthropology"}, "title": "ANTD15H3  Frontiers of Socio-Cultural Anthropology ", "code": "ANTD15H3"}, "VPAB13H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["VPAA10H3"], "str": "VPAA10H3"}, "title": "VPAB13H3  Financial Management for Arts Managers ", "exclusions": {"list": ["MGTB03H3"], "str": "MGTB03H3"}, "description": "An introduction to financial management issues faced by arts and cultural managers. The topics include an introduction to basic accounting concepts, financial statement preparation and analysis, internal control and management information systems, budgeting and programming, cash and resource management, and various tax-related issues.", "code": "VPAB13H3"}, "VPHA46H3": {"breath_req": "Arts, Literature & Language", "description": "How and why are objects defined as Art? How do these definitions vary across cultures and time periods? Studying different approaches to writing art history and considering a wide range of media from photography to printmaking and installation arts.", "exclusions": {"list": ["FAH100Y", "FAH101H"], "str": "(FAH100Y), FAH101H"}, "title": "VPHA46H3  Ways of Seeing: Introduction to Art Histories ", "code": "VPHA46H3"}, "ANTC16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTA01H3", "ANTB14H3", "ANTC17H3"], "str": "ANTA01H3 or ANTB14H3 or ANTC17H3"}, "title": "ANTC16H3  The Foundation and Theory of Human Origins ", "exclusions": {"list": ["ANT332Y"], "str": "(ANT332Y)"}, "description": "The study of human origins in light of recent approaches surrounding human evolution. This course will examine some of these, particularly the process of speciation, with specific reference to the emergence of Homo. Fossils will be examined, but the emphasis will be on the interpretations of the process of hominisation through the thoughts and writings of major workers in the field. Science credit", "code": "ANTC16H3"}, "ANTA02H3": {"breath_req": "Social & Behavioural Sciences", "description": "How does an anthropological perspective enable us to understand cultural difference in an interconnected world? In this course, students will learn about the key concepts of culture, society, and language. Drawing upon illustrations of family, economic, political, and religious systems from a variety of the world's cultures, this course will introduce students to the anthropological approach to studying and understanding human ways of life.", "exclusions": {"list": ["ANT100Y", "ANT102H"], "str": "ANT100Y, ANT102H"}, "title": "ANTA02H3  Introduction to Anthropology: Society, Culture and Language ", "code": "ANTA02H3"}, "ANTD40H3": {"breath_req": "Natural Sciences", "description": "Taught by an advanced PhD student or postdoctoral fellow, and based on his or her doctoral research and area of expertise, this course presents a unique opportunity to explore intensively a particular Evolutionary or Archaeological Anthropology topic in-depth. Topics vary from year to year.", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3"], "str": "[ANTB14H3 and ANTB15H3] and [at least 2.0 credits at the C-level in Evolutionary Anthropology]"}, "title": "ANTD40H3  Topics in Emerging Scholarship in Evolutionary Anthropology ", "code": "ANTD40H3"}, "IMCB01H3": {"breath_req": "Natural Sciences", "description": "Basic principles of microbiology including study of microscopic organisms (bacteria, viruses, protozoans, algae, and fungi), the isolation, cultivation and identification of microbes, host-parasite relationships as they relate to disease, microbial and molecular genetics, growth and control of microbes, and the human immune response to microbes. Limited to students in the Joint Program in Applied Microbiology or the Joint Program in Environmental Science and Technology.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "IMCB01H3  Microbiology Basics ", "code": "IMCB01H3"}, "IMCC02H3": {"breath_req": "Natural Sciences", "description": "Basic genetics using microorganisms, with concepts verified through lab experiments. Isolating and identifying nucleic acids, observing gene function, and effecting simple gene transfers. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB06H3"], "str": "IMCB06H3"}, "title": "IMCC02H3  Microbial Genetics ", "code": "IMCC02H3"}, "IMCB06H3": {"breath_req": "Natural Sciences", "description": "Quality control and quality assurance as they apply to the pharmaceutical industry, based on current government regulations. Students acquire knowledge of microbial production and assay methods, enumerate and identify microorganisms from commercial products, and evaluate the anti-microbial effectiveness of disinfectants, preservatives, and antibiotics. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB04H3"], "str": "IMCB04H3"}, "title": "IMCB06H3  Pharmaceutical Microbiology ", "code": "IMCB06H3"}, "ANTD10H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "[ANTB19H3 and ANTB20H3] and [at least 1.0 credit at the C-level in socio-cultural anthropology courses]"}, "title": "ANTD10H3  The Anthropology of 'Life' Itself ", "exclusions": {"list": ["ANTC11H3"], "str": "(ANTC11H3)"}, "description": "This course will examine cultural understandings of ‘life’ – What is life? What is a life? How do humans value (or alternatively not value) life in different social and cultural settings? What constitutes a ‘good life’? To what degree are cultural understandings of ‘life’ entangled with those of ‘death’.", "code": "ANTD10H3"}, "VPAB07H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["VPAA10H3"], "str": "4.0 full credits, including VPAA10H3"}, "title": "VPAB07H3  Equity and Diversity in Arts Organizations ", "exclusions": {"list": ["VPAD06H3"], "str": "(VPAD06H3)"}, "description": "The importance of equity and diversity within Canadian cultural values, and how these challenges are advanced within arts organizations. The development and use of critical tools to assess the values, principles and policies of arts organizations, and strategies aimed at changing these organizations so that they are non-discriminatory and inclusive.", "code": "VPAB07H3"}, "ASTB23H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["MATA30H3", "MATA36H3", "MATA37H3", "PHYA21H3"], "str": "MATA30H3 and [MATA36H3 or MATA37H3] and PHYA21H3"}, "title": "ASTB23H3  Astrophysics of Stars, Galaxies and the Universe ", "exclusions": {"list": ["ASTB21H3", "ASTC22H3", "AST221H", "AST222H"], "str": "(ASTB21H3), (ASTC22H3), [AST221H and AST222H]"}, "description": "Overview of astrophysics (except planetary astrophysics). Appropriate level for science students. Structure and evolution of stars, white dwarfs, neutron stars. Structure of Milky Way. Classification of galaxies. Potential theory, rotation curves, orbits, dark matter. Spiral patterns. Galaxy clusters. Mergers. Black holes in active galactic nuclei. Expansion of universe, dark energy.", "code": "ASTB23H3"}, "ANTD31H3": {"description": "Directed critical examination of specific problems in Anthropology, based on library and/or field research.These courses are available in exceptional circumstances and do not duplicate regular course offerings. Students are advised that they must obtain consent from the supervising instructor before registering. Individual tutorials, as arranged. A minimum B plus average is normally required to be considered for these courses. May be science credit or area course depending on topic.", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "ANTA01H3 and ANTA02H3 and 2.0 full credits in Anthropology, one of which must be at the C-level. Permission of the instructor."}, "title": "ANTD31H3  Advanced Research in Anthropology ", "code": "ANTD31H3"}, "ANTD32H3": {"description": "Directed critical examination of specific problems in Anthropology, based on library and/or field research. These courses are available in exceptional circumstances and do not duplicate regular course offerings. Students are advised that they must obtain consent from the supervising instructor before registering. Individual tutorials, as arranged. A minimum B plus average is normally required to be considered for these courses. May be science credit or area course depending on topic. ", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "ANTA01H3 and ANTA02H3 and 2.0 full credits in Anthropology, one of which must be at the C-level. Permission of the instructor."}, "title": "ANTD32H3  Advanced Research in Anthropology ", "code": "ANTD32H3"}, "IMCB02H3": {"breath_req": "Natural Sciences", "description": "Practical applications of the concepts covered in IMCB01H3. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "IMCB02H3  Microbial Techniques ", "code": "IMCB02H3"}, "AFSC30H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any B-level course in African Studies, Linguistics, History, or Women's and Gender Studies"}, "title": "AFSC30H3  Language and Society in the Arab World ", "exclusions": {"list": ["HISC96H3"], "str": "HISC96H3"}, "description": "An examination of the relationship between language, society and identity in the Arab world, with special emphasis on North Africa. Topics include: colonial and postcolonial periods; the role of Arabic in pan-Arab identity; multilingualism, class and education; ideologies of gender and language; and ethno-linguistic revitalization among Berbers in North Africa.Same as HISC96H3", "code": "AFSC30H3"}, "VPHD42Y3": {"description": "A course offering the opportunity for advanced investigation of an area of interest; for students who are nearing completion of art history programs and who have already acquired independent research skills. Students must locate a willing supervisor and topics must be identified and approved by the end of the previous term.", "prerequisite": {"list": [], "str": "1.0 credit at the C-level in art history. Students are advised that they must obtain consent from the supervising instructor before registering for these courses."}, "title": "VPHD42Y3  Supervised Reading in Art History ", "code": "VPHD42Y3"}, "AFSC70H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "AFSC70H3  The Caribbean Diaspora ", "exclusions": {"list": ["HISC70H3"], "str": "HISC70H3"}, "description": "The migration of Caribbean peoples to the United States, Canada, and Europe from the late 19th century to the present. The course considers how shifting economic circumstances and labour demands, the World Wards, evolving imperial relationships, pan-Africanism and international unionism, decolonization, natural disasters, and globalization shaped this migration. Same as HISC70H3", "code": "AFSC70H3"}, "ANTC66H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the global cultural phenomenon of tourism. Using case studies and historical perspectives, we investigate the complex motivations and consequences of travel, the dimensions of tourism as development, the ways tourism commodifies daily life, the politics of tourism representation, and the intersection of travel, authenticity and modernity.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC66H3  Anthropology of Tourism ", "code": "ANTC66H3"}, "ANTD16H3": {"breath_req": "Natural Sciences", "description": "This course is designed for advanced students seeking an intensive examination of specific problems in medical Anthropology. Problems to be discussed include: genetic disorders in families and populations, the interaction of malnutrition and infectious diseases in human populations, chronic non-infectious diseases in populations today, and epidemiology and medical anthropology as complementary disciplines. Science credit", "prerequisite": {"list": ["ANTC62H3"], "str": "ANTC62H3 and one additional C-level full credit in Biological Anthropology"}, "title": "ANTD16H3  Biomedical Anthropology ", "code": "ANTD16H3"}, "VPAD12H3": {"description": "A capstone course providing the opportunity for students to reflect on and synthesize the knowledge and skills gained in previous courses and related experiences.", "prerequisite": {"list": ["VPAC13H3"], "str": "At least 16.0 full credits including VPAC13H3."}, "exclusions": {"list": [], "str": "Restricted to students in the Specialist program in Arts Management"}, "title": "VPAD12H3  Senior Seminar in Arts Management ", "code": "VPAD12H3"}, "ANTC27H3": {"breath_req": "Natural Sciences", "description": "Primates are an intensely social order of animals showing wide variation in group size, organization and structure. Using an evolutionary perspective, this course will focus on why primates form groups and how their relationships with different individuals are maintained, with reference to other orders of animals. The form and function of different social systems, mating systems, and behaviours will be examined. ", "prerequisite": {"list": ["ANTB22H3"], "str": "ANTB22H3"}, "title": "ANTC27H3  Primate Sociality ", "code": "ANTC27H3"}, "ANTB20H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3 or [any 4.0 credits in ANT, HLT, IDS, CIT, GGR, POL, SOC or HCS courses]"}, "title": "ANTB20H3  Culture, Politics and Globalization ", "exclusions": {"list": ["ANT204Y", "ANT204H"], "str": "ANT204Y, ANT204H"}, "description": "This course is a further examination of approaches to the study of human cultural diversity in an interconnected world. Through ethnographic accounts and documentary films, students examine the effects of globalization through the political dimensions of culture and the global flows of technology, religion, kinship networks, migration, capital and crime.", "code": "ANTB20H3"}, "VPAC16H3": {"breath_req": "Arts, Literature & Language", "description": "This course is a study of legal and practical human resource issues from an arts management perspective. Topics will include copyright, freedom of expression, censorship, and issues related to labour relations and contracts in the cultural sector.", "prerequisite": {"list": ["VPAA10H3", "ACMB01H3"], "str": "8.0 credits including VPAA10H3 and ACMB01H3"}, "title": "VPAC16H3  Legal and Human Resources Issues in Arts Management ", "code": "VPAC16H3"}, "VPAA12H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPAA10H3"], "str": "VPAA10H3"}, "title": "VPAA12H3  Audience and Resource Development ", "exclusions": {"list": ["VPAB12H3", "VPAB14H3"], "str": "(VPAB12H3), (VPAB14H3)"}, "description": "An introduction to the essential and interconnected areas of marketing and fundraising in the arts.", "code": "VPAA12H3"}, "VPAB05H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to key concepts and issues in contemporary cultural theory. Emphasizes critical reading, thinking, and writing. Students will engage with a wide range of theoretical and methodological developments in the study of art and culture, including, cultural studies, feminism, and postmodernism.", "prerequisite": {"list": ["VPAA10H3", "SOCB58H3"], "str": "[4.0 credits, including VPAA10H3] or [SOCB58H3 and an additional 4.0 credits]"}, "title": "VPAB05H3  Introduction to Contemporary Cultural Theory ", "code": "VPAB05H3"}, "ANTD05Y3": {"breath_req": "Social & Behavioural Sciences", "description": "This course provides students with experience in carrying out ethnographic research in the Greater Toronto Area. Working with the Center for Ethnography, students define and execute individual research projects of their own design. The course provides students with the opportunity to present and discuss their unfolding research, as well as to present the findings of their research. This course culminates in an original research paper.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3", "ANTC60H3", "ANTC70H3"], "str": "[ANTB19H3 and ANTB20H3 and [(ANTC60H3) or ANTC70H3]] and [an additional 1.0 credit at the C-level in socio-cultural anthropology] and [a cumulative GPA of 2.7, or permission of the instructor]. Preference will be given to Specialists and Majors in Anthropology, in that order."}, "title": "ANTD05Y3  Advanced Fieldwork Methods in Social and Cultural Anthropology ", "code": "ANTD05Y3"}, "VPAC21H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPAA10H3", "VPAA12H3", "VPAB16H3", "ACMB01H3"], "str": "10.0 credits, including VPAA10H3, VPAA12H3, VPAB16H3, and ACMB01H3"}, "title": "VPAC21H3  Special Topics in Arts Management I ", "exclusions": {"list": ["VPAD13H3"], "str": "(VPAD13H3)"}, "description": "Special topics for intensive practical, theoretical and/or experiential study of some specific aspects of Arts Management. The topic(s) to be explored in this course will change from session to session.", "code": "VPAC21H3"}, "ANTC62H3": {"breath_req": "Natural Sciences", "description": "The examination of health and disease in ecological and socio-cultural perspective. Emphasis is placed on variability of populations in disease susceptibility and resistance in an evolutionary context. With its sister course, ANTC61H3, this course is designed to introduce students to the basic concepts and principles of medical anthropology. Principles of epidemiology, patterns of inheritance and biological evolution are considered. Science credit", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3"], "str": "ANTB14H3 and ANTB15H3"}, "title": "ANTC62H3  Medical Anthropology: Biological and Demographic Perspectives ", "code": "ANTC62H3"}, "ANTB05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3", "AFSA01H3"], "str": "ANTA02H3 or AFSA01H3"}, "title": "ANTB05H3  Culture and Society in Africa ", "exclusions": {"list": ["AFSB05H3"], "str": "AFSB05H3"}, "description": "An overview of the range and diversity of African social institutions, religious beliefs and ritual, kinship, political and economic organization, pre-colonial, colonial and post-colonial experience.Same as AFSB05H3 Area course", "code": "ANTB05H3"}, "ACMD93Y3": {"description": "Independent study of an advanced and intensive kind, under the direction of a faculty member. The material studied should bear some significant relation to the student's previous work, and should differ significantly in content and/or concentration from topics offered in other courses.Students are advised that they must obtain consent from the supervising instructor before registering for these courses. The student should submit a statement of objectives and proposed content for the course to the instructor by 15 April for 'F' and 'Y' courses and by 1 December for 'S' courses. If the proposal is approved, two faculty members from relevant disciplines will supervise and evaluate the work.", "prerequisite": {"list": [], "str": "3.0 credits at the B-level in the Department of Arts, Culture and Media."}, "exclusions": {"list": ["HUMD93Y3"], "str": "(HUMD93Y3)"}, "title": "ACMD93Y3  Supervised Readings ", "code": "ACMD93Y3"}, "ANTC89H3": {"breath_req": "Social & Behavioural Sciences", "description": "What makes the Middle East unique as a world region? This course considers topics like transnational religious movements, imperial and nationalist histories, issues of language diversity, the impact of new communication technologies, and regional conflicts.Ethnographic examples are drawn from different contexts.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC89H3  The Anthropology of the Middle East ", "code": "ANTC89H3"}, "VPHB73H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMA01H3", "VPHA46H3", "GASA01H3"], "str": "ACMA01H3 or VPHA46H3 or GASA01H3"}, "title": "VPHB73H3  Visualizing Asia ", "exclusions": {"list": ["GASB73H3", "FAH260H"], "str": "GASB73H3, FAH260H"}, "description": "A survey of the art of China, Japan, Korean, India, and Southeast Asia. We will examine a wide range of artistic production, including ritual objects, painting, calligraphy, architectural monuments, textile, and prints. Special attention will be given to social contexts, belief systems, and interregional exchanges. Same as GASB73H3", "code": "VPHB73H3"}, "ACMB02H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to investigative research methods where the humanities and social sciences meet including visual, documentary, ethnographic, interview and other qualitative tools for analyzing social and cultural practices. Students develop skills to identify research inquiries, formulate approaches to investigate, locate, collect and learn from data, analyze evidence, and communicate results.", "exclusions": {"list": ["ACMA02H3"], "str": "(ACMA02H3)"}, "title": "ACMB02H3  Methods of Inquiry and Investigation for ACM Programs ", "code": "ACMB02H3"}, "IMCB04H3": {"breath_req": "Natural Sciences", "description": "An introduction through theory and laboratory work to microorganisms of importance to the food and dairy industries. Quality control of raw materials and finished products, microbial metabolism, food and drug regulations and guidelines, theory of Good Manufacturing Practice for food manufacturers and Hazard Analysis and Critical Control Point Programs (HACCP). Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB01H3"], "str": "IMCB01H3"}, "title": "IMCB04H3  Food Microbiology ", "code": "IMCB04H3"}, "ANTB66H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3 or [any 4.0 credits]"}, "title": "ANTB66H3  Spiritual Paths: A Comparative Anthropology of Pilgrimage ", "exclusions": {"list": ["RLG215H"], "str": "RLG215H"}, "description": "A comparison of pilgrimage in different religious traditions, including Christian, Buddhist, Muslim, Hindu and those of indigenous communities (such as the Huichol of Mexico) will introduce students to the anthropology of religion. We will consider the aspirations and experiences of various pilgrims, while being mindful of cultural similarities and differences.", "code": "ANTB66H3"}, "ANTB36H3": {"breath_req": "Social & Behavioural Sciences", "description": "A cultural and comparative study of apocalyptic thought, practice, and representation around the world. It explores the conditions that inspire end times thinking and the uses it serves. Cases may include: millenarian movements, Revelation, colonialism, epidemics, infertility, deindustrialization, dystopian science fiction, nuclear war, climate change, and zombies.", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3"}, "title": "ANTB36H3  Anthropology of the End of the World ", "code": "ANTB36H3"}, "VPAA06H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the use of computers in the visual and performing arts. Demonstrations, workshops and an introductory survey of applications and usage will illustrate current standards and consider future possibilities of the handling of information (including text, images, sound and data). Projects will allow opportunities for practical experience.", "exclusions": {"list": ["CSCA02H3"], "str": "(CSCA02H3)"}, "title": "VPAA06H3  Visual and Performing Arts Management in the Digital Age ", "code": "VPAA06H3"}, "AFSD51H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSB51H3", "HISB51H3", "HISD50H3"], "str": "8.0 credits including AFSB51H3/HISB51H3 or HISD50H3"}, "title": "AFSD51H3  Southern Africa: Colonial Rule, Apartheid and Liberation ", "exclusions": {"list": ["HISD51H3"], "str": "HISD51H3"}, "description": "A seminar study of southern African history from 1900 to the present. Students will consider industrialization in South Africa, segregation, apartheid, colonial rule, liberation movements, and the impact of the Cold War. Historiography and questions of race, class and gender will be important. Extensive reading and student presentations are required.Same as HISD51H3Africa and Asia Area", "code": "AFSD51H3"}, "VPAB17H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the real-world application of knowledge and skills in arts and arts-related organizations. This course allows students to build on foundational studies and develop discipline-specific knowledge and skills through experiential methods (including a short-term field placement) and objective study.", "prerequisite": {"list": ["VPAA12H3", "VPAB16H3"], "str": "VPAA12H3 and VPAB16H3"}, "title": "VPAB17H3  From Principles to Practices in Arts Management ", "code": "VPAB17H3"}, "ASTA02H3": {"breath_req": "Natural Sciences", "description": "The structure and evolution of stars and galaxies is considered, with our own galaxy, the Milky Way, providing the opportunity for detailed study of a well-observed system. Even this system challenges us with many unanswered questions, and the number of questions increases with further study of the universe and its large-scale character. Current models and methods of study of the universe will be considered. The course is suitable for both science and non-science students.", "exclusions": {"list": ["AST121H", "AST201H"], "str": "AST121H, AST201H"}, "title": "ASTA02H3  Introduction to Astronomy and Astrophysics II: Beyond the Sun and Planets ", "code": "ASTA02H3"}, "ANTD06H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course considers the reading and writing of ethnography - the classic genre of socio-cultural anthropology. We examine what differentiates ethnography from other forms of research and how to distinguish ethnographic works of high quality. Also considered are the politics of representation, including how ethnographic writing may reflect unequal relationships of power.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least two additional C-level courses (1.0 credit) in socio-cultural anthropology."}, "title": "ANTD06H3  Reading Ethnography ", "code": "ANTD06H3"}, "VPAC13H3": {"breath_req": "Arts, Literature & Language", "description": "This course provides a broad foundation of project management and planning knowledge and skills. Topics such as project and special event management (including tours, festivals, etc.), and strategic and business planning (including entrepreneurship) will be discussed in the context of organizational processes.", "prerequisite": {"list": ["VPAB13H3", "VPAB16H3", "ACMB01H3"], "str": "8.0 credits including VPAB13H3, VPAB16H3 and ACMB01H3"}, "title": "VPAC13H3  Planning and Project Management in the Arts and Cultural Sector ", "code": "VPAC13H3"}, "ANTD19H3": {"breath_req": "Natural Sciences", "description": "A large percentage of nonhuman primate species are at risk of extinction due mostly to human-induced processes. Relying on theory from Conservation Biology, this course will consider the intrinsic and extrinsic factors that lead to some primate species being threatened, while others are able to deal with anthropogenic influences. Students will critically examine conservation tactics and the uniqueness of each situation will be highlighted. ", "prerequisite": {"list": ["ANTB22H3"], "str": "ANTB22H3"}, "title": "ANTD19H3  Primate Conservation ", "code": "ANTD19H3"}, "ANTC42H3": {"breath_req": "Natural Sciences", "description": "Human adaptability refers to the human capacity to cope with a wide range of environmental conditions. Emphasis is placed on human growth and development in stressed and non-stressed environments. Case studies are used extensively. Science credit ", "prerequisite": {"list": ["ANTC41H3"], "str": "ANTC41H3"}, "title": "ANTC42H3  Human Growth, Development and Adaptability ", "code": "ANTC42H3"}, "AFSC97H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSA01H3", "AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3"], "str": "AFSA01H3 or AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3"}, "title": "AFSC97H3  Women in Sub-Saharan Africa ", "exclusions": {"list": ["HISC97H3"], "str": "HISC97H3"}, "description": "This course examines women in Sub-Saharan Africa in the pre-colonial, colonial and postcolonial periods. It covers a range of topics including slavery, colonialism, prostitution, nationalism and anti-colonial resistance, citizenship, processes of production and reproduction, market and household relations, and development. Same as HISC97H3", "code": "AFSC97H3"}, "VPHC74H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB39H3", "VPHB73H3", "HISB58H3", "GASB31H3", "GASB33H3", "GASB35H3"], "str": "2 full credits at the B-level in Art History, Asian History, and/or Global Asia Studies, including at least one of VPHB39H3, VPHB73H3, HISB58H3, (GASB31H3), GASB33H3, or (GASB35H3)."}, "title": "VPHC74H3  A Tale of Three Cities: Introduction to Contemporary Art in China ", "exclusions": {"list": ["GASC74H3"], "str": "GASC74H3"}, "description": "An introduction to Chinese contemporary art focusing on three cities: Beijing, Shanghai, and Guangzhou. Increasing globalization and China's persistent self-renovation has brought radical changes to cities, a subject of fascination for contemporary artists. The art works will be analyzed in relation to critical issues such as globalization and urban change. Same as GASC74H3", "code": "VPHC74H3"}, "VPAC17H3": {"breath_req": "Arts, Literature & Language", "description": "An advanced study of marketing within the arts and cultural sector. This course facilitates a sophisticated understanding of the knowledge and skills required for an arts manager to be responsive to varied market groups and changing market environments and successfully bring art and audiences together.", "prerequisite": {"list": ["VPAA10H3", "VPAA12H3", "ACMB01H3"], "str": "VPAA10H3 and VPAA12H3 and ACMB01H3"}, "title": "VPAC17H3  Arts Marketing ", "code": "VPAC17H3"}, "VPHB77H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMA01H3", "VPHA46H3", "GASA01H3"], "str": "ACMA01H3 or VPHA46H3 or GASA01H3"}, "title": "VPHB77H3  Modern Asian Art ", "exclusions": {"list": ["GASB77H3", "FAH262H"], "str": "GASB77H3, FAH262H"}, "description": "An introduction to modern Asian art through domestic, regional, and international exhibitions. Students will study the multilayered new developments of art and art institutions in China, Japan, Korea, India, Thailand, and Vietnam, as well as explore key issues such as colonial modernity, translingual practices, and multiple modernism. Same as GASB77H3", "code": "VPHB77H3"}, "AFSD07H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSA01H3", "IDSA01H3", "AFSA03H3", "IDSA02H3"], "str": "8.0 credits including [AFSA01H3 or IDSA01H3] and [AFSA03H3/IDSA02H3] and [1.0 credit at the B-level in AFS or IDS courses]"}, "title": "AFSD07H3  Extractive Industries in Africa ", "exclusions": {"list": ["IDSD07H3"], "str": "IDSD07H3"}, "description": "This course examines resource extraction in African history. We examine global trade networks in precolonial Africa, and the transformations brought by colonial extractive economies. Case studies, from diamonds to uranium, demonstrate how the resource curse has affected states and economies, especially in the postcolonial period.Same as IDSD07H3", "code": "AFSD07H3"}, "ANTC15H3": {"breath_req": "Social & Behavioural Sciences", "description": "Complements and extends ANTC14H3 by exploring cultural constructions of male and female in a range of societies and institutions.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC15H3  Genders and Sexualities ", "code": "ANTC15H3"}, "ANTC69H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores key themes, theories, and thinkers that have shaped anthropological thought, past and present. In any given year we will focus on the work of a particular important thinker or a school of thought. As we examine trends and approaches that have been influential to the field, we consider the debates these have generated, the ethnographic innovations they have inspired, and their relevance for core debates in anthropology. Topics and readings will be chosen annually by the instructor.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC69H3  Ideas That Matter: Key Themes and Thinkers in Anthropology ", "code": "ANTC69H3"}, "ANTB15H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTA01H3", "HLTA02H3", "HLTA03H3"], "str": "ANTA01H3 or [HLTA02H3 and HLTA03H3]"}, "title": "ANTB15H3  Contemporary Human Evolution and Variation ", "exclusions": {"list": ["ANT203Y", "HLTB20H3"], "str": "ANT203Y, HLTB20H3"}, "description": "Basic to the course is an understanding of the synthetic theory of evolution and the principles, processes, evidence and application of the theory. Laboratory projects acquaint the student with the methods and materials utilized Biological Anthropology. Specific topics include: the development of evolutionary theory, the biological basis for human variation, the evolutionary forces, human adaptability and health and disease. Science credit Same as HLTB20H3", "code": "ANTB15H3"}, "IMCB08H3": {"breath_req": "Natural Sciences", "description": "Theory and practical applications of Biochemistry. Theory focuses on the most important molecules found in living systems. Practical applications include the preparation of soap, testing of food oils, identification of sugars, paper chromatography of amino acid, titration of amino acids, and isolation of casein from milks. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["CHMB42H3"], "str": "CHMB42H3"}, "title": "IMCB08H3  Biochemistry and Applications I ", "code": "IMCB08H3"}, "VPHC75H3": {"breath_req": "Arts, Literature & Language", "description": "This course focuses on the ideas, career and œuvre of a single artist. Exploration and comparison of works across and within the context of the artist's output provides substantial opportunities for deeper levels of interpretation, understanding and assessment. Students will utilize and develop research skills and critical methodologies appropriate to biographical investigation.", "prerequisite": {"list": ["VPHB39H3", "ACMB01H3"], "str": "VPHB39H3 and ACMB01H3 and [an additional 1.0 credit at the B-level in Art History, Studio or Arts Management courses]"}, "title": "VPHC75H3  The Artist, Maker, Creator ", "code": "VPHC75H3"}, "VPHC72H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "CRTB01H3", "CRTB02H3"], "str": "ACMB01H3 and CRTB01H3 and CRTB02H3"}, "title": "VPHC72H3  Art, the Museum, and the Gallery ", "exclusions": {"list": ["CRTC72H3"], "str": "CRTC72H3"}, "description": "Art and the settings in which it is seen in cities today. Some mandatory classes to be held in Toronto museums and galleries, giving direct insight into current exhibition practices and their effects on viewer's experiences of art; students must be prepared to attend these classes.Same as CRTC72H3", "code": "VPHC72H3"}, "VPHB63H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB63H3  Fame, Glory and Spectacle: 14th-16th Century Art in Italy ", "exclusions": {"list": ["FAH230H"], "str": "FAH230H"}, "description": "This course is an introduction to art and visual culture produced in Italy ca. 1350-1550. Students will explore new artistic media and techniques, along with critical issues of social, cultural, intellectual, theoretical and religious contexts that shaped the form and function of art made during this era.", "code": "VPHB63H3"}, "ACMD92H3": {"description": "Independent study of an advanced and intensive kind, under the direction of a faculty member. The material studied should bear some significant relation to the student's previous work, and should differ significantly in content and/or concentration from topics offered in other courses.Students are advised that they must obtain consent from the supervising instructor before registering for these courses. The student should submit to the instructor a statement of objectives and proposed content for the course; this should be done by 15 April for 'F' courses and by 1 December for 'S' courses. If the proposal is approved, two faculty members from relevant disciplines will supervise and evaluate the work.", "prerequisite": {"list": [], "str": "3.0 credits at the B-level in the Department of Arts, Culture and Media."}, "exclusions": {"list": ["HUMD92H3"], "str": "(HUMD92H3)"}, "title": "ACMD92H3  Supervised Readings ", "code": "ACMD92H3"}, "ANTC80H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores ideas of race and racist practice, both past and present. Socio-cultural perspectives on race and racism must address a central contradiction: although biological evidence suggests that racial categories are not scientifically valid, race and racism are real social phenomena with real consequences. In order to address this contradiction, the course will examine the myriad ways that race is produced and reproduced, as well as how racism is perpetuated and sustained.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC80H3  Race and Racism:  Anthropological Insights ", "code": "ANTC80H3"}, "IMCC03H3": {"breath_req": "Natural Sciences", "description": "Biochemistry and the theory of evolution; evidence for, and condition of, life during ancient times. Products, importance, function, classification, and control of enzymes. Energy balances of glycolysis and aerobic/anaerobic metabolism of carbohydrates and fats. Application of biochemistry to the growth and control of microorganisms and higher living forms. Limited to students in the Joint Program in Applied Microbiology. ", "prerequisite": {"list": ["IMCB08H3"], "str": "IMCB08H3"}, "title": "IMCC03H3  Biochemistry and Applications II ", "code": "IMCC03H3"}, "ANTC04H3": {"description": "A directed exploration of specific topics in Anthropology, based on extensive investigation of the literature.These courses are available in exceptional circumstances and do not duplicate regular course offerings. Students are advised that they must obtain consent from the supervising instructor before registering. Individual tutorials, as arranged. A minimum B plus average is normally required to be considered for these courses. May be science credit or area course depending on topic.", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "Permission of the instructor and ANTA01H3 and ANTA02H3 and one B-level full credit in Anthropology in the appropriate sub-field (biological or cultural)."}, "title": "ANTC04H3  Directed Reading in Anthropology ", "code": "ANTC04H3"}, "ANTB19H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3 or [any 4.0 credits in ANT, HLT, IDS, CIT, GGR, POL, SOC or HCS courses]"}, "title": "ANTB19H3  Ethnography and the Comparative Study of Human Societies ", "exclusions": {"list": ["ANT204Y", "ANT207H1"], "str": "ANT204Y, ANT207H1"}, "description": "This course introduces students to the theory and practice of ethnography, the intensive study of people's lives as shaped by social relations, cultural beliefs, and historical forces. Various topics, including religion, economics, politics, and kinship introduce students to key anthropological concepts and theoretical developments in the field.", "code": "ANTB19H3"}, "ANTD99H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTB14H3"], "str": "ANTB14H3 and at least one C-level course (1.0 credit) in biological anthropology."}, "title": "ANTD99H3  Advanced Topics in Primate Evolution ", "exclusions": {"list": ["ANTD13H3"], "str": "ANTD13H3 if completed in the 2010/2011 academic year"}, "description": "This course will examine questions of particular controversy in the study of Primate Evolution. Topics to be covered may include the ecological context of primate origins, species recognition in the fossil record, the identification of the first anthropoids, and the causes of extinction of the subfossil lemurs.Science credit", "code": "ANTD99H3"}, "ASTA01H3": {"breath_req": "Natural Sciences", "description": "The solar neighbourhood provides examples of astronomical bodies that can be studied by both ground-based and space vehicle based-observational instruments. The astronomical bodies studied range from cold and rocky planets and asteroids to extremely hot and massive bodies, as represented by the sun. This course considers astronomical bodies and their evolution, as well as basic parts of physics, chemistry, etc., required to observe them and understand their structure. The course is suitable for both science and non-science students.", "exclusions": {"list": ["AST101H"], "str": "AST101H"}, "title": "ASTA01H3  Introduction to Astronomy and Astrophysics I: The Sun and Planets ", "code": "ASTA01H3"}, "ANTC32H3": {"breath_req": "Social & Behavioural Sciences", "description": "Can ethnographic research help us make sense of various political situations and conflicts around the world? In this course we will review different approaches to power and politics in classical and current anthropology. We will consider notions of the state, political agency and power, civil society, authoritarianism and democracy.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC32H3  Political Anthropology ", "code": "ANTC32H3"}, "ACMB01H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any 2.0 credits"}, "title": "ACMB01H3  Critical Reading, Thinking and Writing for ACM Programs ", "exclusions": {"list": ["ACMA01H3"], "str": "ACMA01H3 (if taken before the 2016-17 academic year)"}, "description": "Academic study in the Department of Arts, Culture and Media is distinguished by critical, historical and practice-based approaches to text, image, sound and performance. This course focuses on critical reading, thinking and writing skills while introducing students to humanistic inquiry through lectures, readings, discussions, and attendance of campus performances and gallery exhibits. This is a writing intensive course that offers students regular constructive feedback on their work.", "code": "ACMB01H3"}, "VPHC63H3": {"breath_req": "Arts, Literature & Language", "description": "This seminar-format course will offer students the opportunity to investigate critical theories and methodologies of the early modern period (roughly 1400-1700). Focusing on such topics as a single artist, artwork or theme, students will become immersed in an interdisciplinary study that draws on impressive local materials from public museum and library collections.", "prerequisite": {"list": ["VPHA46H3", "VPHB63H3", "VPHB64H3", "VPHB74H3"], "str": "VPHA46H3 and [one of VPHB63H3 or VPHB64H3 or VPHB74H3]."}, "title": "VPHC63H3  Explorations in Early Modern Art ", "code": "VPHC63H3"}, "VPHB74H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB74H3  Art in Early Modern Europe: Renaissances Outside of Italy ", "exclusions": {"list": ["FAH230H", "FAH274H"], "str": "FAH230H, FAH274H"}, "description": "This course explores the rich visual culture produced in northern and central Europe 1400-1600. Topics such as the rise of print culture, religious conflict, artistic identity, contacts with other cultures and the development of the art market will be explored in conjunction with new artistic techniques, styles and materials.", "code": "VPHB74H3"}, "ANTB22H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course will provide students with a general introduction to the behaviour and ecology of non-human primates (prosimians, Old and New World monkeys, and apes), with a particular emphasis on social behaviour. The course will consist of lectures reinforced by course readings; topics covered will include dominance, affiliation, social and mating systems, communication, and reproduction.Science credit", "prerequisite": {"list": ["ANTA01H3"], "str": "ANTA01H3"}, "title": "ANTB22H3  Primate Behaviour ", "code": "ANTB22H3"}, "VPHC68H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB58H3", "VPHB59H3"], "str": "VPHB58H3 or VPHB59H3"}, "title": "VPHC68H3  Art in Global Cities ", "exclusions": {"list": ["VPHC52H3"], "str": "(VPHC52H3)"}, "description": "This course looks at the global city as a hub for the creation of visual, performing arts and architecture. How have cyberspace and increased transnational flows of art and artists changed the dynamic surrounding urban arts? What are the differences between the arts within the modern and global contemporary city? ", "code": "VPHC68H3"}, "ANTC20H3": {"breath_req": "Social & Behavioural Sciences", "description": "What limits exist or can be set to commoditized relations? To what extent can money be transformed into virtue, private goods into the public \"Good\"? We examine the anthropological literature on gift-giving, systems of exchange and value, and sacrifice. Students may conduct a short ethnographic project on money in our own society, an object at once obvious and mysterious.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC20H3  Gifts, Money and Morality ", "code": "ANTC20H3"}, "ANTC40H3": {"breath_req": "Quantitative Reasoning", "description": "An examination of the biological, demographic, ecological and socio-cultural determinants of human and non-human population structure and the interrelationships among them. Emphasis is given to constructing various demographic measures of mortality, fertility and immigration and their interpretation. Science credit", "prerequisite": {"list": ["ANTB14H3", "ANTB15H3"], "str": "ANTB14H3 and ANTB15H3 and any statistics course"}, "title": "ANTC40H3  Methods and Analysis in Anthropological Demography ", "code": "ANTC40H3"}, "VPHC42H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB53H3", "ACMB01H3"], "str": "VPHB53H3 and ACMB01H3"}, "title": "VPHC42H3  Gothic Art and Architecture ", "exclusions": {"list": ["FAH328H", "FAH351H", "FAH369H"], "str": "FAH328H, FAH351H (UTM only), (FAH369H)"}, "description": "Current scholarship is expanding and challenging how we decide \"what is Gothic?\" We will examine a variety of artworks, considering artistic culture, social, cultural, and physical contexts as well. Style, techniques, patronage, location in time and space, and importance of decoration (sculpture, stained glass, painting, tapestry) will be among topics discussed.", "code": "VPHC42H3"}, "IMCC04H3": {"breath_req": "Natural Sciences", "description": "During this course, students will study the basic principles of environmental microbiology through lectures and laboratory experiments including soil sampling and nutrient cycling. Students will also explore the application of biotechnology to environmental issues including bioremediation and the benefits and risks that genetically modified organisms pose to the environment. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB06H3"], "str": "IMCB06H3"}, "title": "IMCC04H3  Environmental Microbiology ", "code": "IMCC04H3"}, "ASTC02H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ASTB23H3"], "str": "ASTB23H3"}, "title": "ASTC02H3  Practical Astronomy: Instrumentation and Data Analysis ", "exclusions": {"list": ["AST325H", "AST326Y"], "str": "AST325H, AST326Y"}, "description": "A hands-on introduction to astronomical observing using the UTSC telescope. Lectures cover topics of astronomical instrumentation and data reduction. Observations of Solar System planets, moons, planetary nebula, globular clusters and galaxies will be made. Students will present their results in the style of a scientific paper and a talk.", "code": "ASTC02H3"}, "ANTC10H3": {"breath_req": "Social & Behavioural Sciences", "description": "A critical probe of the origins, concepts, and practices of regional and international development in cultural perspective. Attention is paid to how forces of global capitalism intersect with local systems of knowledge and practice.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC10H3  Anthropological Perspectives on Development ", "code": "ANTC10H3"}, "IMCB03H3": {"breath_req": "Natural Sciences", "description": "The use and function of a variety of chemical instruments for the purpose of chemical analysis. Students learn to perform accurate measurements and/or analyses of experimental samples, and acquire proficiency in laboratory procedures of instrumental analysis as applied to QC, government, and industry standards. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "CHMA10H3 and CHMA11H3"}, "title": "IMCB03H3  Lab Instrumentation ", "code": "IMCB03H3"}, "VPHC45H3": {"breath_req": "Arts, Literature & Language", "description": "Special topics in twentieth-century painting and sculpture. The subject will change from time to time. After introductory sessions outlining the subject and ways of getting information about it, seminar members will research and present topics of their choice.", "prerequisite": {"list": [], "str": "1.0 credit in modern art history at the B-level."}, "title": "VPHC45H3  Seminar in Modern and Contemporary Art ", "code": "VPHC45H3"}, "AFSB50H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSA01H3"], "str": "Any modern history course, or AFSA01H3"}, "title": "AFSB50H3  Africa in the Era of the Slave Trade ", "exclusions": {"list": ["HISB50H3", "HISC50H3", "HIS295H", "HIS396H", "HIS396Y"], "str": "HISB50H3, (HISC50H3), HIS295H, HIS396H, (HIS396Y)"}, "description": "An introduction to the history of Sub-Saharan Africa, from the era of the slave trade to the colonial conquests. Throughout, the capacity of Africans to overcome major problems will be stressed. Themes include slavery and the slave trade; pre-colonial states and societies; economic and labour systems; and religious change. Same as HISB50H3", "code": "AFSB50H3"}, "AFSB05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["AFSA01H3", "ANTA02H3"], "str": "AFSA01H3 or ANTA02H3"}, "title": "AFSB05H3  Culture and Society in Africa ", "exclusions": {"list": ["ANTB05H3"], "str": "ANTB05H3"}, "description": "An overview of the range and diversity of African social institutions, religious beliefs and ritual, kinship, political and economic organization, pre-colonial, colonial and post-colonial experience.Same as ANTB05H3", "code": "AFSB05H3"}, "ANTC68H3": {"breath_req": "Natural Sciences", "description": "Colonization, globalization and socio-ecological factors play an important role in origin, maintenance and emergence of old and new infectious diseases in human populations such as yellow fever, cholera, influenza, SARS. Issues of co-morbidity, the epidemiological transition, syndemics and the impact of global warming on the emergence of new diseases are discussed.Science credit", "prerequisite": {"list": [], "str": "Any B-level course in Anthropology or Biology and any statistics course."}, "title": "ANTC68H3  Deconstructing Epidemics ", "code": "ANTC68H3"}, "ANTC24H3": {"breath_req": "Social & Behavioural Sciences", "description": "Does schizophrenia exist all over the world? Does depression look different in China than it does in Canada? By examining how local understandings of mental illness come into contact with Western psychiatric models, this course considers the role of culture in the experience, expression, definition, and treatment of mental illness and questions the universality of Western psychiatric categories.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3", "HLTB42H3"], "str": "[ANTB19H3 and ANTB20H3] or HLTB42H3"}, "title": "ANTC24H3  Culture, Mental Illness, and Psychiatry ", "code": "ANTC24H3"}, "VPHC49H3": {"breath_req": "Arts, Literature & Language", "description": "The class will read selected recent cultural theory and art theory and consider its implications for a variety of works of art, and will investigate selected exhibition critiques and the critical discourse surrounding the oeuvres of individual artists.", "prerequisite": {"list": ["VPHA46H3", "VPHB39H3", "ACMB01H3"], "str": "VPHA46H3 and VPHB39H3 and ACMB01H3"}, "title": "VPHC49H3  Advanced Studies in Art Theory ", "code": "VPHC49H3"}, "ANTC34H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course considers dimensions of transnationalism as a mode of human sociality and site for cultural production. Topics covered include transnational labour migration and labour circuits, return migration, the transnational dissemination of electronic imagery, the emergence of transnational consumer publics, and the transnational movements of refugees, kinship networks, informal traders and religions.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "[ANTB19H3 and ANTB20H3] or [any 8.0 credits in ANT, HLT, IDS, CIT, GGR, POL, SOC or HCS courses]"}, "title": "ANTC34H3  The Anthropology of Transnationalism ", "code": "ANTC34H3"}, "VPHC41H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB53H3"], "str": "VPHB53H3"}, "title": "VPHC41H3  Carolingian and Romanesque Art ", "exclusions": {"list": ["VPHB42H3", "FAH215H"], "str": "(VPHB42H3), FAH215H"}, "description": "Major artistic and architectural monuments of Europe from the Carolingian renaissance to the renaissance of the twelfth century, considered in relation to geographical context, to monasticism and pilgrimage, to artistic developments of the contemporary Mediterranean world, and to the art and architecture of the later Roman Empire, Byzantium and Armenia, Islam and the art of the invasion period.", "code": "VPHC41H3"}, "ANTD17H3": {"breath_req": "Natural Sciences", "description": "This seminar course will examine the clinical, epidemiological and public health literature on osteoporosis and other conditions impacting skeletal health. The course will also explore the potential economic impacts of osteoporosis on Canada's health care system given emerging demographic changes.Science credit", "prerequisite": {"list": ["ANTC47H3", "ANTC48H3"], "str": "ANTC47H3 and ANTC48H3"}, "title": "ANTD17H3  Medical Osteology: Public Health Perspectives on Human Skeletal Health ", "code": "ANTD17H3"}, "ANTD01H3": {"breath_req": "Social & Behavioural Sciences", "description": "An ethnographic inquiry into the culturally configured human body as a reservoir of experiential knowledge, focus of symbolism, and site of social, moral, and political control. ", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least 1.0 credit at the C-level in socio-cultural anthropology."}, "title": "ANTD01H3  The Body in Culture and Society ", "code": "ANTD01H3"}, "ANTB35H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ANTA02H3", "MDSA01H3"], "str": "ANTA02H3 or MDSA01H3"}, "title": "ANTB35H3  Kids These Days:  Youth, Language and Media ", "exclusions": {"list": ["ANTB21H3", "MDSB09H3"], "str": "(ANTB21H3), MDSB09H3"}, "description": "Across the globe, youth represent both positive and negative aspects of the future. Drawing on ethnographic examples from many cultural contexts, this course asks how youthful generations form around changing language and new media technologies. Topics include: gender, sexuality, indigeneity, race/ethnicity, class, diaspora. Same as MDSB09H3 ", "code": "ANTB35H3"}, "IMCB07H3": {"breath_req": "Natural Sciences", "description": "The principles of food preparation science including HACCP, organoleptic evaluation and survey techniques, tools for the measurement of food, and the physics of food preparation. Food components and their sources, and an introduction to food additives and contamination. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["CHMB42H3"], "str": "CHMB42H3"}, "title": "IMCB07H3  Food Chemistry ", "code": "IMCB07H3"}, "AFSD52H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISC55H3"], "str": "8.0 credits including AFSB50H3/HISB50H3 or AFSB51H3/HISB51H3 or HISC55H3"}, "title": "AFSD52H3  East African Societies in Transition ", "exclusions": {"list": ["HISD52H3"], "str": "HISD52H3"}, "description": "A seminar study of East African peoples from late pre-colonial times to the 1990's, emphasizing their rapid although uneven adaptation to integration of the region into the wider world. Transitions associated with migrations, commercialization, religious change, colonial conquest, nationalism, economic development and conflict, will be investigated. Student presentations are required. Same as HISD52H3", "code": "AFSD52H3"}, "VPAA10H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the theories and practices of arts management primarily within the not-for-profit sector. It is a general survey course that will introduce the broad context of arts in Canadian society and provide an overview of the artistic and administrative issues currently faced by the arts and cultural community.", "title": "VPAA10H3  Introduction to Arts Management ", "code": "VPAA10H3"}, "AFSB51H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Modern Sub-Saharan Africa, from the colonial conquests to the post-colonial era of structural adjustment. The emphasis is on both structure and agency in a hostile world. Themes include conquest and resistance; colonial economies; gender and ethnicity; religious and political movements; development and underdevelopment, post-colonial conflicts, as well as cultural achievements._Same as HISB51H3", "exclusions": {"list": ["HISB51H3", "HISC51H3", "HIS396H", "HIS396Y"], "str": "HISB51H3, (HISC51H3), HIS396H, (HIS396Y)"}, "title": "AFSB51H3  Twentieth Century Africa ", "code": "AFSB51H3"}, "ASTC25H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["MATB41H3", "PHYA21H3"], "str": "MATB41H3 and PHYA21H3"}, "title": "ASTC25H3  Astrophysics of Planetary Systems ", "exclusions": {"list": ["ASTB21H3", "ASTC22H3", "AST221H", "AST222H"], "str": "(ASTB21H3), (ASTC22H3), [AST221H and AST222H]"}, "description": "Overview of planetary astrophysics at a level appropriate for science students. Planets as a by-product of star formation: theory and observations. Protostellar/protoplanetary disks. Planetesimal and planet formation. Solar system versus extrasolar planetary systems. Giant planets, terrestrial planets, dwarf planets and minor bodies in the Solar System: interiors and environments.", "code": "ASTC25H3"}, "VPAD14H3": {"description": "A directed research and/or project-oriented course for students who have demonstrated a high level of academic maturity and competence. Qualified students will have the opportunity to investigate an area of interest to both student and the Director in traditional or emerging subjects related to the field of Arts Management. ", "prerequisite": {"list": [], "str": "At least 1 full credit in Arts Management at the C-level. Written consent and approval of a formal proposal in the approved format must be obtained from the supervising instructor and Program Director by the last date of classes in the previous academic session."}, "exclusions": {"list": ["MGTD80H3"], "str": "MGTD80H3"}, "title": "VPAD14H3  Independent Studies in Arts Management ", "code": "VPAD14H3"}, "ANTA01H3": {"breath_req": "Natural Sciences", "description": "An introduction to Biological Anthropology and Archaeology. Concentrates on the origins and evolution of human life, including both biological and archaeological aspects, from the ancient past to the present. Science credit", "exclusions": {"list": ["ANT100Y", "ANT101H"], "str": "ANT100Y, ANT101H"}, "title": "ANTA01H3  Introduction to Anthropology: Becoming Human ", "code": "ANTA01H3"}, "VPHB59H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3", "VPHB39H3"], "str": "VPHA46H3 or VPHB39H3"}, "title": "VPHB59H3  Current Art Practices ", "exclusions": {"list": ["FAH245H", "FAH246H"], "str": "FAH245H, FAH246H"}, "description": "Shifts in theory and practice in art of the past fifty years. Studying selected artists' works from around the world, we explore how notions of modern art gave way to new ideas about media, patterns of practice, and the relations of art and artists to the public, to their institutional contexts, and to globalized cultures.", "code": "VPHB59H3"}, "ANTD07H3": {"description": "This course allows students to examine particular culture areas at an advanced level. Regions to be covered may include South Asia, East Asia, the Muslim World, Latin America, The Pacific, Europe, Africa, or North America. Specific case studies from the region will be used to highlight theoretical and ethnographic issues. ", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and [at least one previous area course] and at least one additional C-level course in socio-cultural anthropology."}, "title": "ANTD07H3  Advanced Regional Seminar ", "code": "ANTD07H3"}, "VPHB58H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB58H3  Modern Art and Culture ", "exclusions": {"list": ["FAH245H", "FAH246H"], "str": "FAH245H, FAH246H"}, "description": "A study of nineteenth and twentieth century arts and visual media, across genres and cultures. What did modernity mean in differnt cultural contexts? How is 'modern' art or 'modernism' defined? How did the dynamic cultural, economic, and socio-political shifts of the globalizing and industrializing modern world affect the visual ars and their framing?", "code": "VPHB58H3"}, "ANTC70H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3 and at least 0.5 credit at the C-level in socio-cultural anthropology courses"}, "title": "ANTC70H3  Ethnographic Methods in Anthropology: Past, Present, and Future ", "exclusions": {"list": ["ANTC60H3"], "str": "(ANTC60H3)"}, "description": "This course is an exploration of the ongoing significance of the ethnographic method to the practice of research in socio-cultural anthropology. How and why have ethnographic methods become so central to anthropology, and what can we continue to learn with them? Students complement readings and lectures on theories and practices of ethnographic methods, both historical and contemporary, with exercises and assignments designed to provide first-hand experience in carrying out various techniques of ethnographic research. We also consider the unique ethical challenges of ethnographic methods and what it means to conduct ethically sound research.", "code": "ANTC70H3"}, "ANTC03H3": {"description": "A directed exploration of specific topics in Anthropology, based on extensive investigation of the literature.These courses are available in exceptional circumstances and do not duplicate regular course offerings. Students are advised that they must obtain consent from the supervising instructor before registering. Individual tutorials, as arranged. A minimum B plus average is normally required to be considered for these courses. May be science credit or area course depending on topic.", "prerequisite": {"list": ["ANTA01H3", "ANTA02H3"], "str": "Permission of the instructor and ANTA01H3 and ANTA02H3 and one B-level full credit in Anthropology in the appropriate sub-field (biological or cultural)."}, "title": "ANTC03H3  Directed Reading in Anthropology ", "code": "ANTC03H3"}, "ANTC47H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTB14H3"], "str": "ANTB14H3"}, "title": "ANTC47H3  Human and Primate Comparative Osteology ", "exclusions": {"list": ["ANT334H", "ANT334Y"], "str": "ANT334H, ANT334Y"}, "description": "A \"hands-on\" Laboratory course which introduces students to analyzing human and nonhuman primate skeletal remains using a comparative framework. The course will cover the gross anatomy of the skeleton and dentition, as well as the composition and microstructure of bone and teeth. The evolutionary history and processes associated with observed differences in human and primate anatomy will be discussed.Science credit", "code": "ANTC47H3"}, "ACMC01H3": {"breath_req": "Arts, Literature & Language", "description": "A study of the arts, culture and/or media sector through reflective practice. Students will synthesize their classroom and work place / learning laboratory experiences in a highly focused, collaborative, and facilitated way through a series of assignments and discussions.", "prerequisite": {"list": ["VPAB16H3", "VPAB17H3"], "str": "9.0 credits including VPAB16H3 and VPAB17H3 (or its equivalent with instructor permission) and successful completion of required Field Placement Preparation Activities"}, "title": "ACMC01H3  ACMEE Applied Practice I ", "code": "ACMC01H3"}, "VPHB79H3": {"breath_req": "Arts, Literature & Language", "description": "Local arts institutions are often taken for granted but understanding how and why collections are formed, why they are significant, and how they relate to larger art historical contexts provides important object-based learning opportunities. Students will explore these using a focused collection in the Art Gallery of Ontario.", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB79H3  Our Town, Our Art: Local Collections II ", "code": "VPHB79H3"}, "ANTC48H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["ANTC47H3"], "str": "ANTC47H3"}, "title": "ANTC48H3  Advanced Topics In Human Osteology ", "exclusions": {"list": ["ANT334H", "ANT334Y"], "str": "ANT334H, ANT334Y"}, "description": "A \"hands-on\" laboratory course which introduces students to the methods of analyzing human skeletal remains. Topics and analytic methods include: (1) the recovery and treatment of skeletal remains from archaeological sites; (2) odontological description, including dental pathology; (3) osteometric description; (4) nonmetric trait description; (5) methods of estimating age at death and sex; (6) quantitative analysis of metric and nonmetric data; and (7) paleopathology. Science credit", "code": "ANTC48H3"}, "AFSB01H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An interdisciplinary introduction to African and African diasporic religions, philosophies, and oral and written cultures.", "exclusions": {"list": ["AFSA02H3"], "str": "(AFSA02H3)"}, "title": "AFSB01H3  African Worldviews ", "code": "AFSB01H3"}, "VPHB50H3": {"breath_req": "Arts, Literature & Language", "description": "The centrality of photographic practice to African cultures and histories from the period of European imperialism, the rise of modernist \"primitivism\" and the birth of ethnology and anthropology to contemporary African artists living on the continent and abroad.", "prerequisite": {"list": ["VPHA46H3", "ACMA01H3", "AFSA01H3"], "str": "VPHA46H3 or ACMA01H3 or AFSA01H3"}, "title": "VPHB50H3  Africa Through the Photographic Lens ", "code": "VPHB50H3"}, "ANTC33H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC33H3  Conceptualizing Religion ", "exclusions": {"list": ["ANTB30H3"], "str": "(ANTB30H3)"}, "description": "Anthropological approaches to the origin and function of religion, and the nature of symbolism, myth, ritual, sorcery, spirit possession, and cosmology, with primary reference to the religious worlds of small-scale societies.", "code": "ANTC33H3"}, "VPAC18H3": {"breath_req": "Arts, Literature & Language", "description": "An advanced study of fundraising and resource development within the arts and cultural sector. This course facilitates a sophisticated understanding of the knowledge and skills required for an arts manager to develop and increase contributed revenue to support the artistic mission of cultural organizations.", "prerequisite": {"list": ["VPAA12H3", "VPAB13H3", "VPAB16H3", "ACMB01H3"], "str": "VPAA12H3 and VPAB13H3 and VPAB16H3 and ACMB01H3"}, "title": "VPAC18H3  Fundraising and Development in the Arts ", "code": "VPAC18H3"}, "ANTB01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines human-environmental relations from an anthropological perspective. Throughout the semester, we explore how peoples from different parts of the globe situate themselves within culturally constructed landscapes. Topics covered include ethnoecology, conservation, green consumerism, the concept of 'wilderness', and what happens when competing and differentially empowered views of the non-human world collide.", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3"}, "title": "ANTB01H3  Political Ecology ", "code": "ANTB01H3"}, "IMCC01H3": {"breath_req": "Natural Sciences", "description": "With individual consultation, guidance, and supervision, select and design a scientific protocol and perform a microbiology experiment, using researched information. A final thesis will be presented and defended orally. Limited to students in the Joint Program in Applied Microbiology.", "prerequisite": {"list": ["IMCB05H3", "IMCB06H3"], "str": "IMCB05H3 and IMCB06H3"}, "title": "IMCC01H3  Advanced Microbiology Project ", "code": "IMCC01H3"}, "ANTC58H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["CLAA04H3", "HISA07H3", "CLAB05H3", "HISB10H3", "CLAB06H3", "HISB11H3", "ANTA02H3", "ANTB19H3", "ANTB20H3", "HISB02H3", "AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISB53H3", "HISB57H3", "HISB58H3", "HISB60H3", "HISB61H3", "HISB62H3", "HISB93H3", "HISB94H3"], "str": "1.0 credit from the following:  [CLAA04H3/HISA07H3, CLAB05H3/HISB10H3, CLAB06H3/HISB11H3, ANTA02H3, ANTB19H3, ANTB20H3, HISB02H3, AFSB50H3/HISB50H3, AFSB51H3/HISB51H3, HISB53H3, HISB57H3, HISB58H3, HISB60H3, HISB61H3, HISB62H3, HISB93H3, HISB94H3]"}, "title": "ANTC58H3  Constructing the Other:  Orientalism through Time and Place ", "exclusions": {"list": ["CLAC68H3", "HISC68H3"], "str": "CLAC68H3, HISC68H3"}, "description": "This course reflects on the concept of Orientalism and how it informs the fields of Classical Studies and Anthropology. Topics to be discussed include the Orientalization of the past and the origin, role, and significance of ancient representations of the \"Other\" in contemporary discourses. Same as CLAC68H3 and HISC68H3", "code": "ANTC58H3"}, "ANTC31H3": {"breath_req": "Social & Behavioural Sciences", "description": "The nature and logic of ritual. Religious practices and projects; the interface of religion, power, morality, and history in the contemporary world.", "prerequisite": {"list": ["ANTB19H3", "ANTB20H3"], "str": "ANTB19H3 and ANTB20H3"}, "title": "ANTC31H3  Ritual and Religious Action ", "code": "ANTC31H3"}, "VPHB53H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "VPHB53H3  Medieval Art ", "exclusions": {"list": ["FAH215H", "FAH216H"], "str": "FAH215H, FAH216H"}, "description": "The origins of European artistic traditions in the early Christian, Mediterranean world; how these traditions were influenced by classical, Byzantine, Moslem and pagan forms; how they developed in an entirely new form of artistic expression in the high Middle Ages; and how they led on to the Renaissance.", "code": "VPHB53H3"}, "ANTB64H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3 or [any 4.0 credits in ANT, HLT, IDS, CIT, GGR, POL, SOC or HCS courses]"}, "title": "ANTB64H3  The Anthropology of Foods ", "exclusions": {"list": ["ANTC64H3"], "str": "(ANTC64H3)"}, "description": "This course examines the social significance of food and foodways from the perspective of cultural anthropology. We explore the beliefs and behaviours surrounding the production, distribution and consumption of food, and the role of food in shaping or revealing cultural relations, identities, political processes, and forms of globalization.", "code": "ANTB64H3"}, "ANTB09H3": {"breath_req": "Social & Behavioural Sciences", "description": "How is culture represented through visual media, from ethnographic and documentary film, to feature films, television, and new media? How do various communities re-vision themselves through mass, independent, or new media? This course investigates media and its role in the contemporary world from a socio-cultural anthropological perspective.", "prerequisite": {"list": ["ANTA02H3"], "str": "ANTA02H3"}, "title": "ANTB09H3  Culture through Film and Media ", "code": "ANTB09H3"}, "AFSC52H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["VPHA46H3", "ACMB01H3"], "str": "[1.0 credit in History] or [VPHA46H3 and ACMB01H3 and an additional 1.0 credit in VPH courses]"}, "title": "AFSC52H3  Ethiopia: Seeing History ", "exclusions": {"list": ["HISC52H3", "VPHC52H3"], "str": "HISC52H3, VPHC52H3"}, "description": "This course uses a focus on material history and visual culture to explore Ethiopia from the fourth through the nineteenth century, with particular emphasis on the Christian Church, the monarchy, links with both the Mediterranean world and the Indian subcontinent, and the relationship of individuals to their social, economic, artistic and geographic environments.Same as HISC52H3 and VPHC52H3", "code": "AFSC52H3"}}