{"CSCB58H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA48H3", "PSCB57H3"], "str": "[CSCA48H3 or PSCB57H3] and [CGPA 2.75 or enrolment in a CSC Subject POSt or enrolment in a non-CSC Subject POSt for which this course is needed to satisfy program requirements]]"}, "title": "CSCB58H3  Computer Organization ", "exclusions": {"list": ["CSC258H"], "str": "CSC258H"}, "description": "Principles of the design and operation of digital computers. Binary data representation and manipulation, Boolean logic, components of computer systems, memory technology, peripherals, structure of a CPU, assembly languages, instruction execution, and addressing techniques. There are a number of laboratory periods in which students conduct experiments with digital logic circuits.", "code": "CSCB58H3"}, "CSCC85H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB58H3", "CSCB09H3"], "str": "CSCB58H3 and CSCB09H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC85H3  Introduction to Embedded Systems ", "exclusions": {"list": ["ECE385H"], "str": "ECE385H"}, "description": "The course covers the components and fundamental principles of operation of systems built around micro-processing elements: the architecture, operation, and types of micro-processing components; sensors, actuators, signal acquisition and processing, and basic principles of control theory. Laboratory sessions involving the use of a mobile robotic platform provide hands-on experience.", "code": "CSCC85H3"}, "CSCC10H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB07H3"], "str": "CSCB07H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC10H3  Human-Computer Interaction ", "exclusions": {"list": ["CCT380H", "CSC318H"], "str": "CCT380H, CSC318H"}, "description": "The course will provide an introduction to the field of Human-Computer Interaction (HCI) with emphasis on guidelines, principles, methodologies, and tools and techniques for analyzing, designing and evaluating user interfaces. Subsequent topics include usability assessment of interactive systems, prototyping tools, information search and visualization, mobile devices, social media and social networking, and accessibility factors.", "code": "CSCC10H3"}, "CLAC24H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "One full credit in Classics or History"}, "title": "CLAC24H3  Multiculturalism and Cultural Identities in the Greek and Roman Worlds ", "exclusions": {"list": ["HISC11H3"], "str": "HISC11H3"}, "description": "A critical examination of multiculturalism and cultural identities in the Greek and Roman worlds. Special attention will be dedicated to the evidences through which these issues are documented and to their fundamental influence on the formation and evolution of ancient Mediterranean societies and cultures.Same as HISC11H3", "code": "CLAC24H3"}, "CSCD94H3": {"description": "A significant project in any area of computer science. The project may be undertaken individually or in small groups. This course is offered by arrangement with a computer science faculty member, at U of T Scarborough or the St. George campus. This course may be taken in any session and the project must be completed by the last day of classes in the session in which it is taken. Students must obtain consent from the Supervisor of Studies before registering for this course.", "prerequisite": {"list": [], "str": "[Three C-level CSC courses] and [permission of the Supervisor of Studies] and [CGPA 3.0 or enrolment in a CSC Subject POSt] Enrolment procedures: Project supervisor's note of agreement must be presented to the Supervisor of Studies, who must issue permission for registration."}, "exclusions": {"list": ["CSC494H"], "str": "CSC494H"}, "title": "CSCD94H3  Computer Science Project ", "code": "CSCD94H3"}, "CHMD79H3": {"description": "Advanced topics in biological chemistry will be covered at a modern research level. The exact topic will be announced in the Winter Session prior to the course being offered.", "prerequisite": {"list": [], "str": "Permission of the instructor. Normally recommended for individuals who have completed fifteen full credits, including at least two C-level Chemistry courses, and who are pursuing one of the Chemistry Programs."}, "title": "CHMD79H3  Topics in Biological Chemistry ", "code": "CHMD79H3"}, "CSCD58H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB58H3", "CSCB63H3", "STAB52H3"], "str": "CSCB58H3 and CSCB63H3 and STAB52H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD58H3  Computer Networks ", "exclusions": {"list": ["CSC458H"], "str": "CSC458H"}, "description": "Computer communication network principles and practice. The OSI protocol-layer model; Internet application layer and naming; transport layer and congestion avoidance; network layer and routing; link layer with local area networks, connection-oriented protocols and error detection and recovery; multimedia networking with quality of service and multicasting. Principles in the context of the working-code model implemented in the Internet.", "code": "CSCD58H3"}, "CSCA20H3": {"breath_req": "Quantitative Reasoning", "description": "An introduction to computer programming, with an emphasis on gaining practical skills. Introduction to programming, software tools, database manipulation. This course is appropriate for students with an interest in programming and computers who do not plan to pursue a Computer Science program.", "exclusions": {"list": ["CSCA08H3", "CSC108H", "CSC120H"], "str": "CSCA08H3, CSC108H, CSC120H"}, "title": "CSCA20H3  Introduction to Programming ", "code": "CSCA20H3"}, "CSCC01H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB07H3", "CSCB09H3"], "str": "CSCB07H3, CSCB09H3, and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC01H3  Introduction to Software Engineering ", "exclusions": {"list": ["CSC301H", "CSCC40H3", "CSCD08H3"], "str": "CSC301H, (CSCC40H3), (CSCD08H3)"}, "description": "Introduction to software development methodologies with an emphasis on agile development methods appropriate for rapidly-moving projects. Basic software development infrastructure; requirements elicitation and tracking; prototyping; basic project management; basic UML; introduction to software architecture; design patterns; testing.", "code": "CSCC01H3"}, "CSCD43H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCC43H3", "CSCC69H3", "CSCC73H3"], "str": "CSCC43H3 and CSCC69H3 and CSCC73H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD43H3  Database System Technology ", "exclusions": {"list": ["CSC443H"], "str": "CSC443H"}, "description": "Implementation of database management systems. Storage management, indexing, query processing, concurrency control, transaction management. Database systems on parallel and distributed architectures. Modern database applications: data mining, data warehousing, OLAP, data on the web. Object-oriented and object-relational databases.", "code": "CSCD43H3"}, "CRTB02H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3"], "str": "VPHA46H3"}, "title": "CRTB02H3  Exhibiting Art ", "exclusions": {"list": ["VPHB71H3", "FAH310H"], "str": "(VPHB71H3), FAH310H"}, "description": "A critical look at ways of exhibiting art, from a variety of international, historical and contemporary perspectives with emphasis on today's displays in public and private institutions, and on beyond-the-gallery installation, performance, and virtual art practices.", "code": "CRTB02H3"}, "CSCC69H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB07H3", "CSCB09H3", "CSCB58H3"], "str": "CSCB07H3 and CSCB09H3 and CSCB58H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC69H3  Operating Systems ", "exclusions": {"list": ["CSC369H"], "str": "CSC369H"}, "description": "Principles of operating systems. The operating system as a control program and as a resource allocator. The concept of a process and concurrency problem: synchronization, mutual exclusion, deadlock. Additional topics include memory management, file systems, process scheduling, threads, and protection.", "code": "CSCC69H3"}, "CITC07H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology"}, "title": "CITC07H3  Urban Social Policy ", "exclusions": {"list": ["CITC10H3"], "str": "CITC10H3 if taken in the 2011 Winter session"}, "description": "In recent years social policy has been rediscovered as a key component of urban governance. This course examines the last half-century of evolving approaches to social policy and urban inequality, with particular emphasis on the Canadian urban experience. Major issues examined are poverty, social exclusion, labour market changes, housing, immigration and settlement.", "code": "CITC07H3"}, "CITC17H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the engagement of citizen groups, neighbourhood associations, urban social movements, and other non-state actors in urban politics, planning, and governance. The course will discuss the contested and selective insertion of certain groups into city-regional decision-making processes and structures.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology"}, "title": "CITC17H3  Civic Engagement in Urban Politics ", "code": "CITC17H3"}, "CLAC11H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of the main genres, authors and works of ancient Greek and Latin poetry, with particular emphasis on epic, drama and lyrics. Attention will be dedicated to the study of how these works reflect the socio-cultural features of Classical Antiquity and influenced later literatures. Texts will be studied in translation.", "prerequisite": {"list": [], "str": "One full credit in Classics or English"}, "title": "CLAC11H3  Classical Literature I: Poetry ", "code": "CLAC11H3"}, "CTEC01H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["CTEB01H3", "SOCB26H3"], "str": "CTEB01H3 or SOCB26H3"}, "title": "CTEC01H3  Communication and Conflict Resolution ", "exclusions": {"list": ["CTE250H"], "str": "CTE250H"}, "description": "This course will provide theoretical knowledge about small-group interactions and their application for interpersonal communication and conflict resolution. First, we will study the role of status characteristics, cross-cultural variation in communication, and the emergence of power as they relate to the etiology of conflict. How the same facts can be re-organized in conflict management and resolution will be the focus in the second half of the course. Students will work on case studies and write reports about them.", "code": "CTEC01H3"}, "CLAC05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["CLAA04H3", "HISA07H3", "CLAB05H3", "HISB10H3", "CLAB06H3", "HISB11H3"], "str": "2.0 credits in CLA or HIS courses, including 2 of the following [CLAA04H3/HISA07H3, CLAB05H3/HISB10H3, CLAB06H3/HISB11H3]"}, "title": "CLAC05H3  Environment, Society and Economy in Ptolemaic and Roman Egypt ", "exclusions": {"list": ["IEEC52H3", "HISC10H3"], "str": "(IEEC52H3), HISC10H3"}, "description": "This course provides a review of the environmental, social and economic features of Egypt from 332 BC to 642 AD. Same as (IEEC52H3), HISC10H3.", "code": "CLAC05H3"}, "CSCD03H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "14.0 credits and enrolment in a Computer Science Subject POSt."}, "title": "CSCD03H3  Social Impact of Information Technology ", "exclusions": {"list": ["CSC300H"], "str": "CSC300H"}, "description": "The trade-offs between benefits and risks to society of information systems, and related issues in ethics and public policy. Topics will include safety-critical software; invasion of privacy; computer-based crime; the social effects of an always-online life; and professional ethics in the software industry. There will be an emphasis on current events relating to these topics.", "code": "CSCD03H3"}, "PSYB21H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Enrolment in CTEP"}, "title": "PSYB21H3  Introduction to Developmental Psychology: Focus on Education ", "exclusions": {"list": ["CTE100H", "PSYB20H3", "PSY210H"], "str": "CTE100H, PSYB20H3, PSY210H"}, "description": "Child and adolescent development in education. This course presents students with a broad and integrative overview of child development as it pertains to education. Topics are organized chronologically beginning with prenatal development and continuing through selected issues in adolescence and life-span development. In addition to the lecture component, students will complete a field placement in which they observe children's behaviour and think critically about development. (Note: course includes 12-20 hours of field placements)", "code": "PSYB21H3"}, "CHMB20H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "MATA30H3", "MATA35H3", "MATA36H3", "PHYA10H3"], "str": "[CHMA10H3 and CHMA11H3] and MATA30H3 and [MATA35H3 or MATA36H3] and PHYA10H3"}, "title": "CHMB20H3  Chemical Thermodynamics and Elementary Kinetics ", "exclusions": {"list": ["CHMB23H3", "CHM220H", "CHM221H", "CHM223H", "CHM225Y", "JCP221H"], "str": "CHMB23H3, CHM220H,CHM221H, CHM223H, CHM225Y, JCP221H"}, "description": "The concept of chemical potential; phase equilibria; solutions; chemical equilibria (including electrochemical applications); elementary reactions; multi-step and coupled reactions (with biochemical applications); elementary collision theory and transition state theory.", "code": "CHMB20H3"}, "CLAC68H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["CLAA04H3", "HISA07H3", "CLAB05H4", "HISB10H3", "CLAB06H3", "HISB11H3", "ANTA02H3", "ANTB19H3", "ANTB20H3", "HISB02H3", "AFSB50H3", "HISB50H3", "AFSB51H3", "HISB51H3", "HISB53H3", "HISB57H3", "HISB58H3", "HISB60H3", "HISB61H3", "HISB62H3", "HISB93H3", "HISB94H3"], "str": "1.0 credit from the following:  [CLAA04H3/HISA07H3, CLAB05H4/HISB10H3, CLAB06H3/HISB11H3, ANTA02H3, ANTB19H3, ANTB20H3, HISB02H3, AFSB50H3/HISB50H3, AFSB51H3/HISB51H3, HISB53H3, HISB57H3, HISB58H3, HISB60H3, HISB61H3, HISB62H3, HISB93H3, HISB94H3]"}, "title": "CLAC68H3  Constructing the Other:  Orientalism through Time and Place ", "exclusions": {"list": ["ANTC58H3", "HISC68H3"], "str": "ANTC58H3, HISC68H3"}, "description": "This course reflects on the concept of Orientalism and how it informs the fields of Classical Studies and Anthropology. Topics to be discussed include the Orientalization of the past and the origin, role, and significance of ancient representations of the \"Other\" in contemporary discourses. Same as ANTC58H3 and HISC68H3", "code": "CLAC68H3"}, "CLAC22H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "One full credit in Classics or Religion"}, "title": "CLAC22H3  Religions of the Ancient Mediterranean ", "exclusions": {"list": ["CLA366H", "NMC380Y"], "str": "CLA366H, NMC380Y"}, "description": "A comparative study of the Mesopotamian, Egyptian, Phoenician and Punic, Celtic, Palmyrene, Persian, Greco-Roman and Judeo-Christian religious beliefs and practices. Special attention will be dedicated to how they document the societies and cultures in which they flourished.", "code": "CLAC22H3"}, "CHMC31Y3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB16H3", "CHMB20H3", "CHMB23H3", "CHMB31H3", "CHMB42H3"], "str": "CHMB16H3 and [CHMB20H3 or CHMB23H3] and CHMB31H3 and CHMB42H3"}, "title": "CHMC31Y3  Intermediate Inorganic Chemistry ", "exclusions": {"list": ["CHM338H", "CHM331H"], "str": "CHM338H and CHM331H"}, "description": "A detailed discussion of the structure, bonding, spectroscopy and reactivity of transition metal compounds. After an overview of descriptive chemistry, the focus is on coordination and organometallic chemistry, with an introduction to catalysis and biocoordination chemistry. The laboratory focuses on intermediate and advanced inorganic syntheses, and classical and instrumental characterization methods. This laboratory is six hours in duration and occurs every week.", "code": "CHMC31Y3"}, "CRTD43H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB39H3", "CRTB01H3", "CRTB02H3"], "str": "11.0 credits including VPHB39H3, CRTB01H3 and CRTB02H3"}, "title": "CRTD43H3  Curating Contemporary Art ", "exclusions": {"list": ["VPHD43H3"], "str": "(VPHD43H3)"}, "description": "Curatorial practice and the responsibilities of the curator, such as the intellectual and practical tasks of producing a contemporary art exhibition, researching Canadian contemporary art and artists, building a permanent collection, administrating a public art competition, and critical writing about works of visual art in their various contexts. Studio and/or gallery visits required.", "code": "CRTD43H3"}, "CHMA10H3": {"breath_req": "Natural Sciences", "description": "This course will introduce the study of chemical transformations of matter, from a macroscopic and microscopic perspective. It starts with a quantitative description of gases, solids and solutions and develops ideas of bonding and structure in chemical compounds with a particular emphasis on organic and biological molecules. This course includes a three hour laboratory every other week.", "exclusions": {"list": ["CHM120H", "CHM140Y", "CHM151Y"], "str": "CHM120H, CHM140Y, CHM151Y"}, "title": "CHMA10H3  Introductory Chemistry I: Structure and Bonding ", "code": "CHMA10H3"}, "CSCD72H3": {"description": "A topic from theoretical computer science, selected by the instructor, will be covered. The exact topic will typically change from year to year.", "prerequisite": {"list": [], "str": "Permission of the instructor and [CGPA 3.0 or enrolment in a CSC Subject POSt]. Normally intended for students who have completed at least 8 credits."}, "title": "CSCD72H3  Topics in the Theory of Computing ", "code": "CSCD72H3"}, "CITC03H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Economics for Management Studies or Management"}, "title": "CITC03H3  Real Estate and the City ", "exclusions": {"list": ["GGRB10H3"], "str": "(GGRB10H3)"}, "description": "Operation of property markets; cities as markets in land and structures; stocks of property and flows of accommodation service; location of industry, offices and retailing within the city; rental and owner-occupied housing; depreciation and maintenance; cyclical behaviour in metropolitan property markets; impacts of local government; property taxation.", "code": "CITC03H3"}, "CLAD05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 11 full credits including 2 full credits in Classical Studies or History."}, "title": "CLAD05H3  Water Management in the Ancient Mediterranean World ", "exclusions": {"list": ["HISD10H3"], "str": "HISD10H3"}, "description": "This seminar type course addresses issues related to the relationships between ancient Mediterranean societies and their hydric environments in the Mediterranean from 5000 BC to 600 AD.Same as HISD10H3", "code": "CLAD05H3"}, "CSCA08H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": [], "str": "Grade 12 Calculus and Vectors and one other Grade 12 mathematics course."}, "title": "CSCA08H3  Introduction to Computer Science I ", "exclusions": {"list": ["CSCA20H3", "CSC108H", "CSC120H", "CSCA08H3", "CSCA48H3"], "str": "CSCA20H3, CSC108H, CSC120H. CSCA08H3 may not be taken after or concurrently with CSCA48H3."}, "description": "Programming in an object-oriented language such as Python. Program structure: elementary data types, statements, control flow, functions, classes, objects, methods. Lists; searching, sorting and complexity. This course is intended for students having a serious interest in higher level computer science courses, or planning to complete a computer science program.", "code": "CSCA08H3"}, "CITC16H3": {"breath_req": "Social & Behavioural Sciences", "description": "Most of the world's population now lives in large urban regions. How such metropolitan areas should be planned and governed has been debated for over a century. Using examples, this course surveys and critically evaluates leading historical and contemporary perspectives on metropolitan planning and governance, and highlights the institutional and political challenges to regional coordination and policy development.", "prerequisite": {"list": [], "str": "At least 1.0 credit at the B-level in ONE of the following: City Studies or Human Geography or Management or Political Science or Sociology"}, "title": "CITC16H3  Planning and Governing the Metropolis ", "code": "CITC16H3"}, "CITD01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course is designed as a culminating City Studies course in which participants are able to showcase the application of their research skills, and share their professional and disciplinary interests in a common case study. Lectures and guests will introduce conceptual frameworks, core questions and conflicts. Students will be expected to actively participate in discussions and debates, and produce shared research resources. Each student will prepare a substantial research paper as a final project.", "prerequisite": {"list": [], "str": "15.0 credits and completion of the following requirements from either the Major or Major Co-operative programs in City Studies: (2) Core Courses and (4) Methods"}, "title": "CITD01H3  City Issues and Strategies ", "code": "CITD01H3"}, "CHMC20H3": {"breath_req": "Natural Sciences", "description": "Basic statistical mechanics and applications to thermochemistry and kinetics; intermolecular interactions; concepts in reaction dynamics.", "prerequisite": {"list": ["CHMB23H3", "CHMB21H3", "MATB41H3", "PHYA21H3"], "str": "CHMB23H3 and CHMB21H3 and MATB41H3 and PHYA21H3"}, "title": "CHMC20H3  Intermediate Physical Chemistry ", "code": "CHMC20H3"}, "CSCD01H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCC01H3"], "str": "CSCC01H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD01H3  Engineering Large Software Systems ", "exclusions": {"list": ["CSC302H", "CSCD08H3"], "str": "CSC302H, (CSCD08H3)"}, "description": "An introduction to the theory and practice of large-scale software system design, development, and deployment. Project management; advanced UML; requirements engineering; verification and validation; software architecture; performance modeling and analysis; formal methods in software engineering.", "code": "CSCD01H3"}, "CITC10H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examination of one or more current issues in cities. The specific issues will vary depending on the instructor.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology"}, "title": "CITC10H3  Selected Issues in City Studies ", "code": "CITC10H3"}, "CSCB29H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA08H3", "CSCA20H3", "PSCB57H3", "CSCA08H3", "CSCA08H3", "CSCA20H3", "PSCB57H3"], "str": "[CSCA08H3 or CSCA20H3 or PSCB57H3] and 3 other credits and a CGPA of at least 2.5. Priority will be given to ETP/CTEP students. Note: This course assumes programming experience in a language such as Python, C++ or Java as provided by CSCA08H3. Students who already have this background may consult the instructor or Supervisor of Studies for advice about skipping CSCA08H3/CSCA20H3/PSCB57H3."}, "title": "CSCB29H3  Concepts in Elementary Computer Science ", "exclusions": {"list": [], "str": "This course may not be taken after - or concurrently with - any C- or D-level CSC course."}, "description": "A course specifically for students intending to become elementary or high school teachers. Computer science concepts will be discussed at a fundamental level. Topics covered: problem solving, algorithms, recursion, applications, connections to mathematics, connections to society. Throughout the course, students will apply these concepts to fit the current Ministry's Guidelines for the various grade levels. Students may be required to teach some one-hour classes to various grade levels in an approved school. This is a \"teaching friendly\" course. The course will be broken up into three distinct topics: elementary level (grades K-5), intermediate (grades 6-9), senior (grades 10-12).", "code": "CSCB29H3"}, "COGC91H3": {"description": "Supervised reading or research project.These courses provide an opportunity to pursue advanced study in a specialized area following the appropriate scheduled courses and in close consultation with the supervisor. They are not intended as a substitute for scheduled advanced courses. They are intensive research projects intended to provide laboratory/field experience in data collection and analysis. Projects must be completed over 2 consecutive terms. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report.Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book.Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, who is appointed at UTSC, will be required.", "prerequisite": {"list": [], "str": "3.0 credits at the B- or C-level in COG and/or LIN and/or PSY and permission of the supervisor. Note:  Normally students need a cumulative GPA of at least 2.7 for permission to be granted."}, "title": "COGC91H3  Supervised Study in Cognitive Science ", "code": "COGC91H3"}, "CSCA67H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": [], "str": "Grade 12 Calculus and Vectors and one other Grade 12 mathematics course"}, "title": "CSCA67H3  Discrete Mathematics ", "exclusions": {"list": ["MATA67H3", "CSCA65H3", "CSC165H", "CSC240H", "MAT102H"], "str": "MATA67H3, (CSCA65H3), CSC165H, CSC240H, MAT102H"}, "description": "Introduction to discrete mathematics: Elementary combinatorics; discrete probability including conditional probability and independence; graph theory including trees, planar graphs, searches and traversals, colouring. The course emphasizes topics of relevance to computer science, and exercises problem-solving skills and proof techniques such as well ordering, induction, contradiction, and counterexample.Same as MATA67H3", "code": "CSCA67H3"}, "CHMD39H3": {"description": "Advanced topics in inorganic chemistry will be covered at a modern research level. The exact topic will be announced in the Winter Session prior to the course being offered.", "prerequisite": {"list": [], "str": "Permission of the instructor. Normally only for individuals who have completed fifteen full credits, including at least two C-level Chemistry courses, and who are pursuing one of the Chemistry Programs."}, "title": "CHMD39H3  Topics in Inorganic Chemistry ", "code": "CHMD39H3"}, "CSCB09H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA48H3"], "str": "CSCA48H3 and [CGPA 2.75 or enrolment in a CSC Subject POSt or enrolment in a non-CSC Subject POSt for which this course is needed to satisfy program requirements]]"}, "title": "CSCB09H3  Software Tools and Systems Programming ", "exclusions": {"list": ["CSC209H"], "str": "CSC209H"}, "description": "Software techniques in a Unix-style environment, using scripting languages and a machine-oriented programming language (typically C). What goes on in the system when programs are executed. Core topics: creating and using software tools, pipes and filters, file processing, shell programming, processes, system calls, signals, basic network programming. ", "code": "CSCB09H3"}, "CITC14H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course introduces students to questions of urban ecology and environmental planning, and examines how sustainability and environmental concerns can be integrated into urban planning processes and practices.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Environmental Studies or Political Science or Sociology"}, "title": "CITC14H3  Environmental Planning ", "code": "CITC14H3"}, "CITB03H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course provides an overview of the history, theory, and politics of community development and social planning as an important dimension of contemporary urban development and change.", "prerequisite": {"list": [], "str": "Any 4.0 credits."}, "title": "CITB03H3  Social Planning and Community Development ", "code": "CITB03H3"}, "CHMD90Y3": {"description": "Course Coordinators: Artur Izmaylov (416 208-2951) aizmaylov@utsc.utoronto.ca and Frank Wania (416 287-7225) frank.wania@utoronto.ca", "prerequisite": {"list": [], "str": "Permission of the course coordinator."}, "exclusions": {"list": ["CHMD91H3", "CHMD92H3"], "str": "CHMD91H3, CHMD92H3"}, "title": "CHMD90Y3  Directed Research ", "code": "CHMD90Y3"}, "CHMB21H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB20H3"], "str": "CHMB20H3"}, "title": "CHMB21H3  Chemical Structure and Spectroscopy ", "exclusions": {"list": ["CHM223H", "CHM225Y"], "str": "CHM223H, CHM225Y"}, "description": "Atomic structure and spectra; term symbols and their meaning; valence bond theory; LCAO-MO; molecular spectroscopies.", "code": "CHMB21H3"}, "CHMB42H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA11H3", "CHMB41H3"], "str": "CHMA11H3 & CHMB41H3"}, "title": "CHMB42H3  Organic Chemistry II ", "exclusions": {"list": ["CHM247H", "CHM249H"], "str": "CHM247H, CHM249H"}, "description": "Spectroscopy of organic compounds. Aromatic substitution. Chemistry of carbonyl compounds. An introduction to the chemistry of biologically important compounds, including heterocycles, carbohydrates, amino acids, and nucleic acids.This course includes a four hour laboratory every other week.", "code": "CHMB42H3"}, "CHMB31H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "CHMA10H3 and CHMA11H3"}, "title": "CHMB31H3  Introduction to Inorganic Chemistry ", "exclusions": {"list": ["CHM238Y", "CHM231H"], "str": "CHM238Y, CHM231H"}, "description": "Fundamental periodic trends and descriptive chemistry of the main group elements are covered. The topics include structures, bonding and reactivity; solid state structures and energetics; and selected chemistry of Group 1, 2, and 13-18. The course has an accompanying practical (laboratory) component taking place every second week.", "code": "CHMB31H3"}, "CHMD69H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOC12H3", "BIOC13H3", "CHMB62H3", "CHMC31Y3"], "str": "[[BIOC12H3 and BIOC13H3] or CHMB62H3] and CHMC31Y3"}, "title": "CHMD69H3  Bioinorganic Chemistry ", "exclusions": {"list": ["CHM333H", "CHM437H"], "str": "CHM333H, CHM437H"}, "description": "This course will explore the role of metals cations in living systems. After a survey of biologically relevant ligands (such as amino and nucleic acids) the focus shifts to metal uptake and function. The course also provides a brief introduction to medicinal inorganic chemistry.", "code": "CHMD69H3"}, "CHMB43Y3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "Completion of at least 4.0 credits, including CHMA10H3 and CHMA11H3. Minimum cumulative GPA of 2.7. Permission of instructor."}, "title": "CHMB43Y3  Organic Chemistry I and II ", "exclusions": {"list": ["CHMB41H3", "CHMB42H3", "CHM138H", "CHM151Y", "CHM247H", "CHM249H", "CHM242H", "CHM245H"], "str": "CHMB41H3, CHMB42H3, CHM138H, CHM151Y, CHM247H, CHM249H, CHM242H, CHM245H"}, "description": "This course provides a comprehensive introduction to the field of organic chemistry. Major topics include organic acids/bases, stereochemistry, substitution/elimination mechanisms, reactions of alkenes/alkynes, radicals, aromatic compounds, carbonyl compounds, oxidation/reduction, radicals, spectroscopy, heterocycles and carbohydrates. Includes a 4 hour lab and 6 hours of lecture each week.", "code": "CHMB43Y3"}, "CITC15H3": {"breath_req": "Social & Behavioural Sciences", "description": "The course examines Canadian local public finance in comparative perspective and discusses the implications of municipal finance for urban public policy, planning, and the provision of municipal services. Topics include local government revenue sources and expenditures, the politics of municipal budgeting and intergovernmental fiscal relations, and how public finance influences urban form.", "prerequisite": {"list": [], "str": "At least 1.0 credit at the B-level in ONE of the following: City Studies or Human Geography or Economics for Management Studies or Management or Political Science or Sociology"}, "title": "CITC15H3  Taxing and Spending: Public Finance in Canadian Cities ", "code": "CITC15H3"}, "CSCD90H3": {"breath_req": "Quantitative Reasoning", "description": "In this capstone course, students will work in teams to develop a viable product prototype following the methodologies and techniques covered in CSCD54H3. Students will produce written reports, short videos pitching their idea, and a final presentation showcasing their proposed innovation, as it would be pitched to potential investors. The course instructor and TAs will provide close supervision and mentorship throughout the project.", "prerequisite": {"list": [], "str": "A minimum of 2.5 credits at the B-level or higher in CSC courses"}, "title": "CSCD90H3  The Startup Sandbox ", "code": "CSCD90H3"}, "CITC04H3": {"breath_req": "Social & Behavioural Sciences", "description": "Constitutional authority, municipal corporations, official plans, zoning bylaws, land subdivision and consents, development control, deed restrictions and common interest developments, Ontario Municipal Board.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology"}, "title": "CITC04H3  Municipal and Planning Law in Ontario ", "code": "CITC04H3"}, "CITC02H3": {"description": "This will be a service learning course based in Scarborough communities in which students learn about community issues first-hand by volunteering for community based organizations. Student evaluation will be based on completion of volunteer hours and grading of student journals that will: 1. Describe the service work, and 2. Reflect on the service work and relate it to lectures and required readings.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in CIT courses"}, "title": "CITC02H3  Learning in Community Service ", "code": "CITC02H3"}, "CLAA04H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to the main features of the ancient civilizations of the Mediterranean world from the development of agriculture to the spread of Islam. Long term socio-economic and cultural continuities and ruptures will be underlined, while a certain attention will be dedicated to evidences and disciplinary issues.Same as HISA07H3", "exclusions": {"list": ["HISA07H3"], "str": "HISA07H3"}, "title": "CLAA04H3  The Ancient Mediterranean World ", "code": "CLAA04H3"}, "CSCB36H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA48H3", "CSCA65H3", "CSCA67H3"], "str": "CSCA48H3 and [(CSCA65H3) or CSCA67H3] and[CGPA 2.75 or enrolment in a CSC Subject POSt or enrolment in a non-CSC Subject POSt for which this course is needed to satisfy program requirements]]"}, "title": "CSCB36H3  Introduction to the Theory of Computation ", "exclusions": {"list": ["CSC236H", "CSC240H"], "str": "CSC236H, CSC240H"}, "description": "Mathematical induction with emphasis on applications relevant to computer science. Aspects of mathematical logic, correctness proofs for iterative and recursive algorithms, solutions of linear and divide-and-conquer recurrences, introduction to automata and formal languages.", "code": "CSCB36H3"}, "CITC12H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the structure of local government, how local Government is managed, how policy decisions are made. Viewing Canadian cities in comparative perspective, topics include the organization and authority of the mayor, council, civic bureaucracy, and special-purpose bodies, and their roles in the making and implementation of public policies; ethical and conflict-of-interest dilemmas; collective bargaining; and provincial oversight of municipal affairs.", "prerequisite": {"list": [], "str": "At least 1.0 credit at the B-level in ONE of the following: City Studies or Human Geography or Economics for Management Studies or Management or Political Science or Sociology"}, "title": "CITC12H3  City Structures and City Choices: Local Government, Management, and Policymaking ", "code": "CITC12H3"}, "CRTC72H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "CRTB01H3", "CRTB02H3"], "str": "ACMB01H3 and CRTB01H3 and CRTB02H3"}, "title": "CRTC72H3  Art, the Museum, and the Gallery ", "exclusions": {"list": ["VPHC72H3"], "str": "VPHC72H3"}, "description": "Art and the settings in which it is seen in cities today. Some mandatory classes to be held in Toronto museums and galleries, giving direct insight into current exhibition practices and their effects on viewer's experiences of art; students must be prepared to attend these classes.Same as VPHC72H3", "code": "CRTC72H3"}, "CHMC11H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB16H3"], "str": "CHMB16H3"}, "title": "CHMC11H3  Principles of Analytical Instrumentation ", "exclusions": {"list": ["CHM317H"], "str": "CHM317H"}, "description": "An introduction to the workings and application of modern analytical instrumentation. A range of modern instrumentation including NMR spectroscopy, Mass Spectrometry, Microscopy. Light Spectroscopy (visible, Ultra Violet, Infrared, Fluorescence, Phosphorescence), X-ray, Chromatography and electrochemical separations will be addressed. Principles of measurement; detection of photons, electrons and ions; instrument and experiment design and application; noise reduction techniques and signal-to-noise optimization will be covered.", "code": "CHMC11H3"}, "CSCD92H3": {"breath_req": "Quantitative Reasoning", "description": "Students will examine an area of interest through reading papers and texts. This course is offered by arrangement with a computer science faculty member. It may be taken in any session, and must be completed by the last day of classes in the session in which it is taken.", "prerequisite": {"list": [], "str": "Students must obtain consent from the Supervisor of Studies before registering for this course."}, "title": "CSCD92H3  Readings in Computer Science ", "code": "CSCD92H3"}, "CHMA11H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3"], "str": "CHMA10H3"}, "title": "CHMA11H3  Introductory Chemistry II: Reactions and Mechanisms ", "exclusions": {"list": ["CHM139H", "CHM140Y", "CHM151Y"], "str": "CHM139H, CHM140Y, CHM151Y"}, "description": "In this course reactions and equilibria in chemical systems are explored through their thermodynamic properties and chemical kinetics. Acid/base and solubility equilibria will be discussed along with topics in electrochemistry. This course includes a three hour laboratory every other week.", "code": "CHMA11H3"}, "CLAB05H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A survey of the history and culture of the Greek world from the Minoan period to the Roman conquest of Egypt (ca 1500-30 BC). Special attention will be dedicated to the nature, variety and limits of the available evidences, to socio-cultural interactions as well as to historical processes of continuities and ruptures.Same as HISB10H3", "exclusions": {"list": ["CLA230H", "HISB10H3"], "str": "CLA230H, HISB10H3"}, "title": "CLAB05H3  History and Culture of the Greek World ", "code": "CLAB05H3"}, "CITC08H3": {"breath_req": "Social & Behavioural Sciences", "description": "An examination of community development as the practice of citizens and community organizations to empower individuals and groups to improve the social and economic wellbeing of their communities and neighbourhoods. The course will consider different approaches to community development and critically discuss their potential for positive urban social change.", "prerequisite": {"list": [], "str": "[At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology]"}, "title": "CITC08H3  Cities and Community Development ", "code": "CITC08H3"}, "CSCD71H3": {"description": "A topic from computer science, selected by the instructor, will be covered. The exact topic will typically change from year to year.", "prerequisite": {"list": [], "str": "Permission of the instructor and [CGPA 3.0 or enrolment in a CSC Subject POSt]. Normally intended for students who have completed at least 8 credits."}, "title": "CSCD71H3  Topics in Computer Science ", "code": "CSCD71H3"}, "CTLA02H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "No more than 10.0 credits completed. Students are required to take a diagnostic test of their academic English skills to be conducted by the English Language Development Centre in advance of the first day of class."}, "title": "CTLA02H3  Exploring Inter-Cultural Perspectives in Academic Contexts ", "exclusions": {"list": ["HUMA11H3", "LGGA11H3"], "str": "(HUMA11H3), (LGGA11H3)"}, "description": "This course develops students' language, academic and communication skills through a critical exploration of Canadian culture and academic expectations. Using audio-visual and textual media, students learn through interactive online and in-class discussions. This course aims to foster dynamic academic acculturation for international students and develop their multi-literate engagement in English.", "code": "CTLA02H3"}, "CSCD70H3": {"breath_req": "Quantitative Reasoning", "description": "The goal of this course is to examine the design and implementation of a compiler optimized for modern parallel architectures. Students will learn about common optimizations, intermediate representations (IRs), control-flow and dataflow analysis, dependence graphs, instruction scheduling, and register allocation. Advanced topics include static single assignment, memory hierarchy optimizations and parallelization, compiling for multicore machines, memory dependence analysis, automatic vectorization/thread extraction, and predicated/speculative execution.", "prerequisite": {"list": ["CSCB63H3", "CSCC69H3"], "str": "CSCB63H3 and CSCC69H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD70H3  Compiler Optimization ", "code": "CSCD70H3"}, "CITB04H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course is the foundations course for the city governance concentration in the City Studies program, and provides an introduction to the study of urban politics with particular emphasis on different theoretical and methodological approaches to understanding urban decision-making, power, and conflict.", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "CITB04H3  City Politics ", "code": "CITB04H3"}, "CHMB41H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "CHMA10H3 and CHMA11H3"}, "title": "CHMB41H3  Organic Chemistry I ", "exclusions": {"list": ["CHM138H", "CHM151Y"], "str": "CHM138H, CHM151Y"}, "description": "Chemical bonding and an introduction to aliphatic and aromatic compounds. Conformational analysis and stereochemistry. Free radical reactions of alkanes. Chemistry of alkenes, dienes, and alkynes. Substitution and elimination reactions. This course includes a four hour laboratory every other week.", "code": "CHMB41H3"}, "CHMC16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMC11H3"], "str": "CHMC11H3"}, "title": "CHMC16H3  Analytical Instrumentation ", "exclusions": {"list": ["CHM317H"], "str": "CHM317H"}, "description": "A laboratory course to complement CHMC11H3, Principles of Analytical Instrumentation. This course provides a practical introduction and experience in the use of modern analytical instrumentation with a focus on the sampling, sample preparation (extraction, clean-up, concentration, derivatization), instrumental trace analysis and data interpretation of various pharmaceutical, biological and environmental samples.This course includes a four hour laboratory every week.", "code": "CHMC16H3"}, "COGC92H3": {"description": "Supervised reading or research project.These courses provide an opportunity to pursue advanced study in a specialized area following the appropriate scheduled courses and in close consultation with the supervisor. They are not intended as a substitute for scheduled advanced courses. They are intensive research projects intended to provide laboratory/field experience in data collection and analysis. Projects must be completed over 2 consecutive terms. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report.Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book.Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, who is appointed at UTSC, will be required.", "prerequisite": {"list": [], "str": "3.0 credits at the B- or C-level in COG and/or LIN and/or PSY and permission of the supervisor.  Note:  Normally students need a cumulative GPA of at least 2.7 for permission to be granted."}, "title": "COGC92H3  Supervised Study in Cognitive Science ", "code": "COGC92H3"}, "CSCD37H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCC37H3", "MATB24H3", "MATB41H3"], "str": "CSCC37H3 and MATB24H3 and MATB41H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD37H3  Analysis of Numerical Algorithms for Computational Mathematics ", "exclusions": {"list": ["CSCC50H3", "CSCC51H3", "CSC350H", "CSC351H"], "str": "(CSCC50H3), (CSCC51H3), CSC350H, CSC351H"}, "description": "Most mathematical models of real systems cannot be solved analytically and the solution of these models must be approximated by numerical algorithms. The efficiency, accuracy and reliability of numerical algorithms for several classes of models will be considered. In particular, models involving least squares, non-linear equations, optimization, quadrature, and systems of ordinary differential equations will be studied.", "code": "CSCD37H3"}, "CSCB20H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": [], "str": "Some experience with programming in an imperative language such as Python, Java or C."}, "title": "CSCB20H3  Introduction to Databases and Web Applications ", "exclusions": {"list": [], "str": "This course may not be taken after - or concurrently with - any C- or D-level CSC course."}, "description": "A practical introduction to databases and Web app development. Databases: terminology and applications; creating, querying and updating databases; the entity-relationship model for database design. Web documents and applications: static and interactive documents; Web servers and dynamic server-generated content; Web application development and interface with databases.", "code": "CSCB20H3"}, "CSCC09H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB09H3", "CSCC43H3"], "str": "CSCB09H3 and CSCC43H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC09H3  Programming on the Web ", "exclusions": {"list": ["CSC309H"], "str": "CSC309H"}, "description": "An introduction to software development on the web. Concepts underlying the development of programs that operate on the web. Operational concepts of the internet and the web, static and dynamic client content, dynamically served content, n-tiered architectures, web development processes and security on the web.", "code": "CSCC09H3"}, "CHMB55H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3"], "str": "CHMA10H3 and CHMA11H3"}, "title": "CHMB55H3  Environmental Chemistry ", "exclusions": {"list": ["CHM310H"], "str": "CHM310H"}, "description": "An investigation of aspects of chemical substances and processes as they occur in the environment, including both naturally occurring and synthetic chemicals.This course will include an introduction to atmospheric chemistry, aqueous chemistry, some agricultural and industrial chemistry, and chemical analysis of contaminants and pollutants.", "code": "CHMB55H3"}, "CSCB07H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA48H3"], "str": "CSCA48H3 and [CGPA 2.75 or enrolment in a CSC Subject POSt or enrolment in a non-CSC Subject POSt for which this course is needed to satisfy program requirements]     ]"}, "title": "CSCB07H3  Software Design ", "exclusions": {"list": ["CSC207H"], "str": "CSC207H"}, "description": "An introduction to software design and development concepts, methods, and tools, using a statically-typed object-oriented language such as Java. Topics from: version control, build management, unit testing, refactoring, object oriented design and development, design patterns and advanced IDE usage.", "code": "CSCB07H3"}, "CRTB01H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any 2.0 credits at A-level"}, "title": "CRTB01H3  Introduction to Curating Art ", "exclusions": {"list": ["VPHB72H3", "FAH301H5", "FAH310H5"], "str": "(VPHB72H3), FAH301H5, FAH310H5"}, "description": "An introduction to the theory, ethics and contexts of art museum/gallery curatorial practice. Emphasis on communication through exploring interpretations and considering ethical practice. Students will learn specialized knowledge, resources, references and methodologies and explore professional and academic responsibilities of art-based curatorial work.", "code": "CRTB01H3"}, "CHMD89H3": {"breath_req": "Natural Sciences", "description": "The 'twelve principles' of green chemistry will be discussed in the context of developing new processes and reactions (or modifying old ones) to benefit society while minimizing their environmental impact. Examples will be taken from the recent literature as well as from industrial case studies.", "prerequisite": {"list": ["CHMB31H3", "CHMC41H3", "CHMC42H3"], "str": "CHMB31H3 and [CHMC41H3 or CHMC42H3]"}, "title": "CHMD89H3  Introduction to Green Chemistry ", "code": "CHMD89H3"}, "CTLB03H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Completion of 4.0 full credits and selection of a U of T Scarborough major or specialist subject POSt and acceptance of the Service Learning and Outreach application which can be accessed through the website: http://ctl.utsc.utoronto.ca/sl/. GPA and communication skills will also be considered."}, "title": "CTLB03H3  Introduction to Service Learning ", "exclusions": {"list": ["SCIB01H3", "SCIB02H3", "SCIB03H3"], "str": "(SCIB01H3), (SCIB02H3), (SCIB03H3)"}, "description": "In this experiential learning course, students apply discipline-specific academic concepts as they work with community partners in the service of others. Working either within the academic community or with a discipline-related off-campus community partner, students develop problem-solving, professional communication, and self-reflective learning skills.", "code": "CTLB03H3"}, "CHMC47H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB41H3", "CHMB42H3"], "str": "CHMB41H3 and CHMB42H3"}, "title": "CHMC47H3  Bio-Organic Chemistry ", "exclusions": {"list": ["CHM347H"], "str": "CHM347H"}, "description": "The chemistry of heterocycles, nucleic acids, terpenes, steroids and other natural products; amino acids, proteins and carbohydrates; introduction to enzyme structure and catalysis.This course includes a four hour laboratory every week.", "code": "CHMC47H3"}, "CLAB06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A survey of the history and culture of the ancient Roman world, from the Etruscan period to the Justinian dynasty (ca 800 BC-600 AD). Special attention will be dedicated to the nature, variety and limits of the available evidences, to socio-cultural interactions as well as to historical processes of continuities and ruptures.Same as HISB11H3", "exclusions": {"list": ["CLA231H", "HISB11H3"], "str": "CLA231H, HISB11H3"}, "title": "CLAB06H3  History and Culture of the Roman World ", "code": "CLAB06H3"}, "CSCC46H3": {"breath_req": "Quantitative Reasoning", "description": "How networks underlie the social, technological, and natural worlds, with an emphasis on developing intuitions for broadly applicable concepts in network analysis. Topics include: introductions to graph theory, network concepts, and game theory; social networks; information networks; the aggregate behaviour of markets and crowds; network dynamics; information diffusion; popular concepts such as \"six degrees of separation\", the \"friendship paradox\", and the \"wisdom of crowds\".", "prerequisite": {"list": ["CSCB63H3", "STAB52H3", "MATA22H3", "MATA23H3"], "str": "CSCB63H3 and STAB52H3 and [MATA22H3 or MATA23H3] and [a CGPA of 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC46H3  Social and Information Networks ", "code": "CSCC46H3"}, "CSCA48H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCA08H3"], "str": "CSCA08H3"}, "title": "CSCA48H3  Introduction to Computer Science II ", "exclusions": {"list": ["CSC148H"], "str": "CSC148H"}, "description": "Abstract data types and data structures for implementing them. Linked data structures. Object Oriented Programming. Encapsulation and information-hiding. Testing. Specifications. Analyzing the efficiency of programs. Recursion.", "code": "CSCA48H3"}, "CSCD95H3": {"description": "Same description as CSCD94H3. Normally a student may not take two project half-courses on closely related topics or with the same supervisor. If an exception is made allowing a second project on a topic closely related to the topic of an earlier project, higher standards will be applied in judging it. We expect that a student with the experience of a first project completed will be able to perform almost at the level of a graduate student.", "prerequisite": {"list": ["CSCD94H3"], "str": "CSCD94H3 Enrolment procedures: Project supervisor's note of agreement must be presented to the Supervisor of Studies, who must issue permission for registration."}, "exclusions": {"list": ["CSC495H"], "str": "CSC495H"}, "title": "CSCD95H3  Computer Science Project ", "code": "CSCD95H3"}, "CSCC73H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB63H3", "STAB52H3"], "str": "CSCB63H3 and STAB52H3; [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC73H3  Algorithm Design and Analysis ", "exclusions": {"list": ["CSC373H", "CSC375H", "CSC364H"], "str": "CSC373H, CSC375H, CSC364H"}, "description": "Standard algorithm design techniques: divide-and-conquer, greedy strategies, dynamic programming, linear programming, randomization, and possibly others. ", "code": "CSCC73H3"}, "CHMC41H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB41H3", "CHMB42H3"], "str": "CHMB41H3 and CHMB42H3"}, "title": "CHMC41H3  Organic Reaction Mechanisms ", "exclusions": {"list": ["CHM348H"], "str": "CHM348H"}, "description": "Theory and mechanisms of organic reactions; principles of structure, introduction to aromaticity, spectroscopy and polymers. Theories of bonding. The laboratory experiments are designed to complement the topics covered in lectures. Offered in odd numbered years, alternating years with CHMC42H3.This course includes a four hour laboratory every week.", "code": "CHMC41H3"}, "CSCB63H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB36H3"], "str": "CSCB36H3 and [CGPA 2.75 or enrolment in a CSC Subject POSt or enrolment in a non-CSC Subject POSt for which this course is needed to satisfy program requirements]]"}, "title": "CSCB63H3  Design and Analysis of Data Structures ", "exclusions": {"list": ["CSC263H", "CSC265H"], "str": "CSC263H, CSC265H"}, "description": "Design, analysis, implementation and comparison of efficient data structures for common abstract data types. Priority queues: heaps and mergeable heaps. Dictionaries: balanced binary search trees, B-trees, hashing. Amortization: data structures for managing dynamic tables and disjoint sets. Data structures for representing graphs. Graph searches.", "code": "CSCB63H3"}, "CHMB62H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "CHMB41H3"], "str": "CHMA10H3, CHMA11H3, CHMB41H3"}, "title": "CHMB62H3  Introduction to Biochemistry ", "exclusions": {"list": ["BIOC12H3", "BIOC13H3", "BCH210H", "BCH242Y", "BCH311H", "CHM361H", "CHM362H"], "str": "BIOC12H3, BIOC13H3, BCH210H, BCH242Y, BCH311H, CHM361H, CHM362H"}, "description": "This course is designed as an introduction to the molecular structure of living systems. Topics will include the physical and chemical properties of proteins, enzymes, fatty acids, lipids, carbohydrates, metabolism and biosynthesis. Emphasis will be placed on the relationships between the chemical structure and biological function.", "code": "CHMB62H3"}, "CLAA06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A study of Greek and Roman mythologies. Special attention will be dedicated to the sources through which these representational patterns are documented and to their influence on Mediterranean civilizations and arts.", "exclusions": {"list": ["CLA204H", "CLAA02H3", "CLAA03H3"], "str": "CLA204H, (CLAA02H3), (CLAA03H3)"}, "title": "CLAA06H3  Ancient Mythology II: Greece and Rome ", "code": "CLAA06H3"}, "CHMD91H3": {"description": "Course Coordinators: Artur Izmaylov (416 208-2951) Email: aizmaylov@utsc.utoronto.ca and Frank Wania (416 287-7225) Email: frank.wania@utoronto.ca", "prerequisite": {"list": [], "str": "Permission of the course coordinator."}, "exclusions": {"list": ["CHMD90Y3", "CHMD92H3"], "str": "CHMD90Y3, CHMD92H3"}, "title": "CHMD91H3  Directed Research ", "code": "CHMD91H3"}, "CITC09H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to the study of the history of urban planning with particular emphasis on the investigation of the planning ideas, and the plans, that have shaped Toronto and its surrounding region through the twentieth century. The course will consider international developments in planning thought together with their application to Toronto and region.", "prerequisite": {"list": [], "str": "At least 1.5 credits at the B-level in ONE of the following course subject areas: CIT or GGR or POL or SOC"}, "title": "CITC09H3  Introduction to Planning History: Toronto and Its Region ", "code": "CITC09H3"}, "CTLA01H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "No more than 10.0 credits completed. Students are required to take a diagnostic test of academic English skills to be conducted by the English Language Development Centre in advance of the first day of class."}, "title": "CTLA01H3  Foundations in Effective Academic Communication ", "exclusions": {"list": ["HUMA19H3", "LGGA19H3", "LGGA99H3", "CTLA19H3"], "str": "(HUMA19H3), (LGGA19H3), (LGGA99H3), (CTLA19H3)."}, "description": "This highly interactive course for English Language Learners who find Academic English a challenge aims to fast-track the development of critical thinking, reading, writing and oral communication skills. Through emphasizing academic writing and rapid expansion of vocabulary, students will gain practical experience with university-level academic texts and assignment expectations.", "code": "CTLA01H3"}, "CHMC21H3": {"breath_req": "Natural Sciences", "description": "Advanced topics in Physical Chemistry with emphasis on biochemical systems. Spectroscopic methods for (bio) molecular structure determination, including IR, NMR, UV/VIS; colloid chemistry; polymers and bio-polymers, bonding structure and statistical mechanics; physical chemistry of membranes, active transport and diffusion; oscillatory (bio)chemical reactions.", "prerequisite": {"list": ["CHMB20H3", "CHMB23H3", "CHMB21H3", "MATB41H3", "PHYA21H3"], "str": "[CHMB20H3 or CHMB23H3] and CHMB21H3 and MATB41H3 and PHYA21H3"}, "title": "CHMC21H3  Topics in Biophysical Chemistry ", "code": "CHMC21H3"}, "CHMC42H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB41H3", "CHMB42H3"], "str": "CHMB41H3 and CHMB42H3"}, "title": "CHMC42H3  Organic Synthesis ", "exclusions": {"list": ["CHM346H"], "str": "CHM346H"}, "description": "Principles of synthesis organic and functional group transformations; compound stereo-chemistry, spectroscopy and structure elucidation. Offered in even-numbered years alternating with CHMC41H3.This course includes a four hour laboratory every week.", "code": "CHMC42H3"}, "CITC01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course engages students in a case study of some of the issues facing urban communities and neighbourhoods today. Students will develop both community-based and academic research skills by conducting research projects in co-operation with local residents and businesses, non-profit organizations, and government actors and agencies.", "prerequisite": {"list": [], "str": "[At least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Political Science or Sociology]"}, "title": "CITC01H3  Urban Communities and Neighbourhoods Case Study: East Scarborough ", "code": "CITC01H3"}, "CTEB01H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PSYB21H3", "SOCA01H3", "SOCA02H3"], "str": "PSYB21H3 or [(SOCA01H3) and (SOCA02H3)]"}, "title": "CTEB01H3  Equity and Diversity in Education ", "exclusions": {"list": ["CTE200H"], "str": "CTE200H"}, "description": "Focuses on raising awareness and sensitivity to issues related to equity, diversity and inclusion facing teachers and students in diverse schools and cultural communities. It includes field experience that entails observation of, and participation in equity and diversity efforts in a culturally-rooted school and/or community organization.", "code": "CTEB01H3"}, "CSCD18H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MATB24H3", "MATB41H3", "CSCB09H3", "CSCC37H3"], "str": "MATB24H3 and MATB41H3 and [CSCB09H3 or proficiency in C] and CSCC37H3 and [a CGPA of at least 3.0 or enrolment in a Computer Science Subject POSt]"}, "title": "CSCD18H3  Computer Graphics ", "exclusions": {"list": ["CSC418H"], "str": "CSC418H"}, "description": "The course will cover in detail the principles and algorithms used to generate high-quality, computer generated images for fields as diverse as scientific data visualization, modeling, computer aided design, human computer interaction, special effects, and video games. Topics covered include image formation, cameras and lenses, object models, object manipulation, transformations, illumination, appearance modeling, and advanced rendering via ray-tracing and path-tracing. Throughout the course, students will implement a working rendering engine in a suitable programming language.", "code": "CSCD18H3"}, "CITC18H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["STAB22H3"], "str": "[STAB22H3 or equivalent] and [at least 1.5 credits at the B-level in ONE of the following: City Studies or Human Geography or Economics for Management Studies or Management or Political Science]"}, "title": "CITC18H3  Urban Transportation Policy Analysis ", "exclusions": {"list": ["GGR324H", "GGRC18H3"], "str": "GGR324H, (GGRC18H3)"}, "description": "Demand forecasting; methodology of policy analysis; impacts on land values, urban form and commuting; congestion; transit management; regulation and deregulation; environmental impacts and safety.", "code": "CITC18H3"}, "CTLA10H3": {"breath_req": "Social & Behavioural Sciences", "description": "Students in this course develop foundational academic skills while critically exploring current research on cognitive, academic and mental health benefits of exercise and healthy nutrition. Lectures are complemented by activities at Toronto Pan Am Sports Centre to foster students’ application of course materials to both their learning and their health.", "title": "CTLA10H3  Personal Health and Optimal Learning ", "code": "CTLA10H3"}, "CHMD59H3": {"description": "Advanced topics in environmental chemistry will be covered at a modern research level. The exact topic will be announced in the Winter Session prior to the course being offered.", "prerequisite": {"list": [], "str": "Permission of the instructor. Normally recommended for individuals who have completed fifteen full credits, including at least two C-level Chemistry courses, and who are pursuing one of the Chemistry Programs."}, "title": "CHMD59H3  Topics in Environmental Chemistry ", "code": "CHMD59H3"}, "CITD30H3": {"breath_req": "Social & Behavioural Sciences", "description": "An independent studies course open only to students in the Major and Major Co-op programs in City Studies. An independent studies project will be carried out under the supervision of an individual faculty member.", "prerequisite": {"list": [], "str": "15.0 credits, including completion of the following requirements of the Major/Major Co-op programs in City Studies: 1) Introduction to Social Science Thought, 2) Core Courses, 4) Methods; and a cumulative GPA of at least 2.5"}, "title": "CITD30H3  Supervised Research Project ", "code": "CITD30H3"}, "CRTD44H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB39H3", "CRTB01H3", "CRTB02H3"], "str": "11.0 credits including VPHB39H3, CRTB01H3 and CRTB02H3"}, "title": "CRTD44H3  Curating Historical Art ", "exclusions": {"list": ["VPHD44H3"], "str": "(VPHD44H3)"}, "description": "Time and history bring different factors to our understanding and interpretation of artworks. Students will explore both intellectual and practical factors concerning curating historical art, from conservation, research, and handling issues to importance of provenance, collecting, and display, through workshops, critical writing and discussion, field trips, and guest speakers.", "code": "CRTD44H3"}, "CSCC11H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MATB24H3", "MATB41H3", "STAB52H3"], "str": "MATB24H3 and MATB41H3 and STAB52H3 and [CGPA 3.0 or enrolment in a CSC, STA or Quantitative Analysis Subject POSt]."}, "title": "CSCC11H3  Introduction to Machine Learning and Data Mining ", "exclusions": {"list": ["CSC411H", "CSCD11H3"], "str": "CSC411H, (CSCD11H3)"}, "description": "An introduction to methods for automated learning of relationships on the basis of empirical data. Classification and regression using nearest neighbour methods, decision trees, linear and non-linear models, class-conditional models, neural networks, and Bayesian methods. Clustering algorithms and dimensionality reduction. Model selection. Problems of over-fitting and assessing accuracy. Problems with handling large databases.", "code": "CSCC11H3"}, "CITD05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["CITB02H3"], "str": "8.0 credits including CITB02H3 and 1.0 credit at the B-level in CIT courses"}, "title": "CITD05H3  City Studies Workshop I ", "exclusions": {"list": ["CITC05H3"], "str": "(CITC05H3)"}, "description": "City Studies Workshop I provides training in a range of career-oriented research, consulting, and professional skills. Through a series of 4-week modules, students will develop professional practice oriented skills, such as conducting public consultations, participating in design charrettes, making public presentations, writing policy briefing notes, conducting stakeholder interviews, working with community partner organizations, organizing and running public debates, and participant observation of council meetings and policy processes at Toronto City Hall.", "code": "CITD05H3"}, "CHMB23H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "MATA30H3", "MATA35H3", "MATA36H3", "PHYA10H3"], "str": "CHMA10H3 and CHMA11H3 and MATA30H3 and [MATA35H3 or MATA36H3] and PHYA10H3"}, "title": "CHMB23H3  Introduction to Chemical Thermodynamics and Kinetics: Theory and Practice ", "exclusions": {"list": ["CHMB20H3", "CHM220H", "CHM225Y", "JCP221H", "CHM221H"], "str": "CHMB20H3, CHM220H, CHM225Y, JCP221H/CHM221H"}, "description": "This course explores the concepts of chemical potential, phase equilibria, solutions, chemical equilibria (including electrochemical applications), elementary reactions, multi-step and coupled reactions (with biochemical applications), elementary collision theory and transition state theory.", "code": "CHMB23H3"}, "CHMC25H3": {"breath_req": "Natural Sciences", "description": "This course provides a comprehensive introduction to the field of computational quantum chemistry. It is organized to give a hands-on experience in applying modern computational methods (e.g. density functional theory) for investigating various physical properties of molecules and materials: vibrational and electronic spectroscopy, magnetic and electric field response properties.", "prerequisite": {"list": ["CHMB21H3", "PHYB56H3"], "str": "CHMB21H3 or PHYB56H3. Minimum cumulative GPA of 2.7. Permission of instructor."}, "title": "CHMC25H3  Quantum Chemistry ", "code": "CHMC25H3"}, "CHMD71H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMC41H3", "CHMC42H3", "CHMC47H3"], "str": "[CHMC41H3 or CHMC42H3] and CHMC47H3"}, "title": "CHMD71H3  Pharmaceutical Chemistry ", "exclusions": {"list": ["CHM440H"], "str": "CHM440H"}, "description": "The course focuses on the important concepts in the design and synthesis of drugs. The course may include the principles of pharmacology, drug metabolism and toxicology. Strategies for generating valuable active compounds and structure/activity relationships involved in selective transformations of available building blocks into diversely functionalized derivatives will be discussed. The course provides an overview of reactions used at different stages of the drug development process, using representative examples from the literature and case studies of drugs where applicable.", "code": "CHMD71H3"}, "CITD06H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["CITB02H3"], "str": "8.0 credits including [CITB02H3 and 1.0 credit at the B-level in CIT courses]"}, "title": "CITD06H3  City Studies Workshop II ", "exclusions": {"list": ["CITC06H3"], "str": "(CITC06H3)"}, "description": "City Studies Workshop I provides training in a range of career-oriented research, consulting, and professional skills. Through a series of 4-week modules, students will develop professional practice oriented skills, such as conducting public consultations, participating in design charrettes, making public presentations, writing policy briefing notes, conducting stakeholder interviews, working with community partner organizations, organizing and running public debates, and participant observation of council meetings and policy processes at Toronto City Hall.", "code": "CITD06H3"}, "CSCC37H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["MATA36H3", "MATA37H3", "MATA23H3"], "str": "[MATA36H3 or MATA37H3] & MATA23H3 & [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC37H3  Introduction to Numerical Algorithms for Computational Mathematics ", "exclusions": {"list": ["CSCC36H3", "CSCC50H3", "CSCC51H3", "CSC336H", "CSC350H", "CSC351H", "CSC338H"], "str": "(CSCC36H3), (CSCC50H3), (CSCC51H3), CSC336H, CSC350H, CSC351H, CSC338H"}, "description": "An introduction to computational methods for solving problems in linear algebra, non-linear equations, approximation and integration. Floating-point arithmetic; numerical algorithms; application of numerical software packages.", "code": "CSCC37H3"}, "CITB02H3": {"breath_req": "Social & Behavioural Sciences", "description": "A review of the major characteristics and interpretations of cities, urban processes and urban change as a foundation for the Program in City Studies. Ideas from disciplines including Anthropology, Economics, Geography, Planning, Political Science and Sociology, are examined as ways of understanding cities.", "prerequisite": {"list": [], "str": "Any 4.0 credits."}, "title": "CITB02H3  Foundations of City Studies ", "code": "CITB02H3"}, "CSCD54H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "A minimum of 2.5 credits at the B-level or higher in CSC courses"}, "title": "CSCD54H3  Technology Innovation and Entrepreneurship ", "exclusions": {"list": ["CSC454H"], "str": "CSC454H"}, "description": "This course examines high-Tech innovation and entrepreneurship, principles of operation of successful high-tech enterprises, customer identification and validation, product development, business models, lean startup techniques, and financing of high-technology ventures. Students will work in teams to develop their own innovative product idea, and will produce a sound business plan to support their product.", "code": "CSCD54H3"}, "COGD10H3": {"description": "Supervised reading or research project. These courses provide an opportunity to pursue advanced study in a specialized area following the appropriate scheduled courses and in close consultation with the supervisor. They are not intended as a substitute for scheduled advanced courses. They are intensive research projects intended to provide laboratory/field experience in data collection and analysis. Projects must be completed over 2 consecutive terms. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report. Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book. Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, who is appointed at UTSC, will be required.", "prerequisite": {"list": [], "str": "3.0 credits at the B- or C-level in COG and/or LIN and/or PSY and permission of the supervisor.  Note:  Normally students need a cumulative GPA of at least 2.7 for permission to be granted."}, "title": "COGD10H3  Supervised Study in Cognitive Science ", "code": "COGD10H3"}, "CLAA05H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A study of Mesopotamian and Egyptian mythologies. Special attention will be dedicated to the sources through which these representational patterns are documented and to their influence on Mediterranean civilizations and arts.", "exclusions": {"list": ["CLAA05H3", "NMC380Y"], "str": "CLAA05H3 may not be taken after or concurrently with NMC380Y"}, "title": "CLAA05H3  Ancient Mythology I: Mesopotamia and Egypt ", "code": "CLAA05H3"}, "CSCC63H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB36H3", "CSCB63H3"], "str": "CSCB36H3 and CSCB63H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC63H3  Computability and Computational Complexity ", "exclusions": {"list": ["CSC363H", "CSC365H", "CSC364H"], "str": "CSC363H, CSC365H, CSC364H"}, "description": "Introduction to the theory of computability: Turing machines, Church's thesis, computable and non-computable functions, recursive and recursively enumerable sets, reducibility. Introduction to complexity theory: models of computation, P, NP, polynomial time reducibility, NP-completeness, further topics in complexity theory.Note: Although the courses CSCC63H3 and CSCC73H3 may be taken in any order, it is recommended that CSCC73H3 be taken first.", "code": "CSCC63H3"}, "CITD10H3": {"breath_req": "Social & Behavioural Sciences", "description": "Designed primarily for final-year City Studies Majors, this research seminar is devoted to the analysis and discussion of current debates and affairs in City Studies using a variety of theoretical and methodological approaches. Specific content will vary from year to year. Seminar format with active student participation.", "prerequisite": {"list": [], "str": "15.0 credits, including completion of the following requirements of the Major/Major Co-op programs in City Studies: (1) Introduction to Social Science Thought, (2) Core Courses, and (4) Methods"}, "title": "CITD10H3  Seminar in Selected Issues in City Studies ", "code": "CITD10H3"}, "CHMB16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMA10H3", "CHMA11H3", "MATA30H3", "MATA35H3", "MATA36H3"], "str": "CHMA10H3 and CHMA11H3 and MATA30H3 and [MATA35H3 or MATA36H3]"}, "title": "CHMB16H3  Techniques in Analytical Chemistry ", "exclusions": {"list": ["CHM217H"], "str": "CHM217H"}, "description": "An introduction to the principles and methods of classical analysis and the provision of practical experience in analytical laboratory techniques. The course deals primarily with quantitative chemical analysis. Classical methods of volumetric analysis, sampling techniques, statistical handling of data are studied, as well as a brief introduction to spectro-chemical methods. This course includes a four hour laboratory every week.", "code": "CHMB16H3"}, "CSCC24H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB07H3", "CSCB09H3"], "str": "CSCB07H3 and CSCB09H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC24H3  Principles of Programming Languages ", "exclusions": {"list": ["CSC324H"], "str": "CSC324H"}, "description": "Major topics in the design, definition, analysis, and implementation of modern programming languages. Study of programming paradigms: procedural (e.g., C, Java, Python), functional (e.g., Scheme, ML, Haskell) and logic programming (e.g., Prolog, Mercury).", "code": "CSCC24H3"}, "CSCC43H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB09H3", "CSCB63H3"], "str": "CSCB09H3 and CSCB63H3 [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCC43H3  Introduction to Databases ", "exclusions": {"list": ["CSC343H"], "str": "CSC343H"}, "description": "Introduction to database management systems. The relational data model. Relational algebra. Querying and updating databases: the SQL query language. Application programming with SQL. Integrity constraints, normal forms, and database design. Elements of database system technology: query processing, transaction management. ", "code": "CSCC43H3"}, "CLAB20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "The representation of the classical world and historical events in film. How the Greek and Roman world is reconstructed by filmmakers, their use of spectacle, costume and furnishings, and the influence of archaeology on their portrayals. Films will be studied critically for historical accuracy and faithfulness to classical sources.Same as HISB12H3", "exclusions": {"list": ["HISB12H3", "CLA388H"], "str": "HISB12H3, CLA388H"}, "title": "CLAB20H3  The Classical World in Film ", "code": "CLAB20H3"}, "CHMD92H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMC41H3", "CHMC42H3", "CHMC31Y3"], "str": "One of CHMC41H3, CHMC42H3 or CHMC31Y3"}, "title": "CHMD92H3  Advanced Chemistry Laboratory Course ", "exclusions": {"list": ["CHMD90Y3", "CHMD91H3"], "str": "CHMD90Y3, CHMD91H3"}, "description": "A lab course designed to introduce students to modern synthetic methods while performing multi-step syntheses. The course will consist of two, six hour lab days every week. Students will develop advanced practical synthetic and analytic skills by working with important reactions taken from different chemistry disciplines.", "code": "CHMD92H3"}, "CSCD84H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCC24H3", "STAB52H3"], "str": "CSCC24H3 and STAB52H3 and [CGPA 3.0 or enrolment in a CSC subject POSt]"}, "title": "CSCD84H3  Artificial Intelligence ", "exclusions": {"list": ["CSC484H", "CSC384H"], "str": "CSC484H, CSC384H"}, "description": "A study of the theories and algorithms of Artificial Intelligence. Topics include a subset of: search, game playing, logical representations and reasoning, planning, natural language processing, reasoning and decision making with uncertainty, computational perception, robotics, and applications of Artificial Intelligence. Assignments provide practical experience of the core topics.", "code": "CSCD84H3"}, "CITB08H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to economic analysis of cities, topics include: theories of urban economic growth; the economics of land use, urban structure, and zoning; the economics of environments, transportation, and sustainability; public finance, cost-benefit analysis, the provision of municipal goods and services, and the new institutional economics.", "prerequisite": {"list": [], "str": "Any 4.0 credits."}, "title": "CITB08H3  Economy of Cities ", "code": "CITB08H3"}, "CSCD27H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["CSCB09H3", "CSCB36H3"], "str": "CSCB09H3 and CSCB36H3 and [CGPA 3.0 or enrolment in a CSC Subject POSt]"}, "title": "CSCD27H3  Computer and Network Security ", "exclusions": {"list": ["CSC427H"], "str": "CSC427H"}, "description": "Public and symmetric key algorithms and their application; key management and certification; authentication protocols; digital signatures and data integrity; secure network and application protocols; application, system and network attacks and defences; intrusion detection and prevention; social engineering attacks; risk assessment and management.", "code": "CSCD27H3"}, "CLAC02H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A detailed study of a theme in Classical Civilization.Topics will vary from session to session and may be drawn from such areas as the archaeological history of the Roman world, Greek and Roman religion, ancient education or Roman law.", "prerequisite": {"list": [], "str": "One full credit in Classics or History"}, "title": "CLAC02H3  Selected Topics in Classical Civilization ", "code": "CLAC02H3"}, "CHMD16H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["CHMB55H3", "CHMC11H3"], "str": "CHMB55H3 and CHMC11H3"}, "title": "CHMD16H3  Environmental and Analytical Chemistry ", "exclusions": {"list": ["CHMC16H3", "CHM317H", "CHM410H"], "str": "CHMC16H3, CHM317H, CHM410H"}, "description": "Students will learn about analytical techniques used in environmental chemistry, including: gas and liquid chromatography, mass spectrometry, atomic absorption, and ultraviolet-visible spectroscopy. Environmental sampling and ecotoxicology will also be covered. Students will carry out laboratory analyses and receive hands-on training with analytical instrumentation commonly used in environmental chemistry.", "code": "CHMD16H3"}, "CITB01H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 4.0 credits."}, "title": "CITB01H3  Canadian Cities and Planning ", "exclusions": {"list": ["GGRB06H3"], "str": "(GGRB06H3)"}, "description": "After reviewing the history of urban and regional planning in Canada, this course considers alternative ideologies, models of public choice, the role of the planner, the instruments of planning, tools for the analysis of planning, and planning in the context of the space economy.", "code": "CITB01H3"}, "CLAC01H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "One full credit in Classics or in English or another literature"}, "title": "CLAC01H3  Selected Topics in Classical Literature ", "exclusions": {"list": ["CLA300H"], "str": "CLA300H"}, "description": "A detailed study of an author or a genre in Classical Literature in Translation.Topics will vary from session to session and will alternate between Greek and Roman Epic, Greek and Roman Tragedy and Greek and Roman Comedy.", "code": "CLAC01H3"}, "CLAC12H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of the main genres, authors and works of ancient Greek and Latin prose. History, rhetoric, biography, letters and the novel will be studied. Attention will be dedicated to the study of how these works reflect the socio-cultural features of Classical Antiquity and influenced later literatures. Texts will be studied in translation.", "prerequisite": {"list": [], "str": "One full credit in Classics or English"}, "title": "CLAC12H3  Classical Literature II: Prose ", "code": "CLAC12H3"}}