{"GASB57H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A survey of South Asian history. The course explores diverse and exciting elements of this long history, such as politics, religion, trade, literature, and the arts, keeping in mind South Asia's global and diasporic connections. Africa and Asia AreaSame as HISB57H3", "exclusions": {"list": ["HIS282Y", "HIS282H", "HISB57H3"], "str": "HIS282Y, HIS282H, HISB57H3"}, "title": "GASB57H3  Sub-Continental Histories: South Asia in the World ", "code": "GASB57H3"}, "GGRD09H3": {"breath_req": "Social & Behavioural Sciences", "description": "How do gender relations shape different spaces? We will explore how feminist geographers have approached these questions from a variety of scales - from the home, to the body, to the classroom, to the city, to the nation, drawing on the work of feminist geographers.Area of focus: Social/Cultural Geography", "prerequisite": {"list": ["GGRB13H3", "CITB02H3", "WSTB05H3"], "str": "13.0 credits including [GGRB13H3 or CITB02H3 or WSTB05H3]"}, "title": "GGRD09H3  Feminist Geographies ", "code": "GGRD09H3"}, "GGRD10H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines links between health and human sexuality. Particularly explores sexually transmitted infections. Attention will be given to the socially and therefore spatially constructed nature of sexuality. Other themes include sexual violence, masculinities and health, reproductive health, and transnational relationships and health. Examples will be taken from a variety of countries.Area of focus: Social/Cultural Geography", "prerequisite": {"list": ["GGRB13H3", "IDSB04H3", "WSTB05H3"], "str": "13.0 credits including [GGRB13H3 or IDSB04H3 or WSTB05H3]"}, "title": "GGRD10H3  Health and Sexuality ", "code": "GGRD10H3"}, "GASA02H3": {"breath_req": "Arts, Literature & Language", "description": "This course introduces Global Asia Studies through the study of cultural and social institutions in Asia. Students will critically study important elements of culture and society over different periods of history and in different parts of Asia. They will engage in intensive reading and writing for humanities.", "title": "GASA02H3  Introduction to Global Asia Studies ", "code": "GASA02H3"}, "GASB15H3": {"breath_req": "Arts, Literature & Language", "description": "The course will provide students with an introduction to the arts of South Asia, from classical to modern, and from local to global. Fields of study may include music, dance, drama, literature, film, graphic arts, decorative arts, magic, yoga, athletics, and cuisine, fields viewed as important arts for this society.", "title": "GASB15H3  The Arts of South Asia ", "code": "GASB15H3"}, "GASD59H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["HISB58H3", "GASB58H3"], "str": "At least 8.0 fce completed, or [HISB58H3 or GASB58H3]"}, "title": "GASD59H3  Law and Society in Chinese History ", "exclusions": {"list": ["HISD59H3"], "str": "HISD59H3"}, "description": "A seminar course on Chinese legal tradition and its role in shaping social, political, economic, and cultural developments, especially in late imperial and modern China. Topics include the foundations of legal culture, regulations on sexuality, women's property rights, crime fictions, private/state violence, laws of ethnicities, prison reforms and modernization. 0.5 pre-1800 credit Africa and Asia Area Same as HISD59H3", "code": "GASD59H3"}, "GASD20H3": {"description": "This seminar examines the transformation and perpetuation of gender relations in contemporary Chinese societies. It pays specific attention to gender politics at the micro level and structural changes at the macro level through in-depth readings and research.Same as SOCD20H3", "prerequisite": {"list": ["SOCB05H3", "GASA01H3", "GASA02H3"], "str": "[SOCB05H3 and one C-level course in SOC] or  [GASA01H3 and GASA02H3 and one C-level course from the options in requirement #2 of the Specialist or Major programs in Global Asia Studies]"}, "exclusions": {"list": ["SOCD20H3"], "str": "SOCD20H3"}, "title": "GASD20H3  Advanced Seminar: Social Change and Gender Relations in Chinese Societies ", "code": "GASD20H3"}, "GGRC50H3": {"breath_req": "Social & Behavioural Sciences", "description": "Explores the social geography of education, especially in cities. Topics include geographical educational inequalities; education, class and race; education, the family, and intergenerational class immobility; the movement of children to attend schools; education and the right to the city.Areas of focus: Urban or Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC50H3  Geographies of Education ", "code": "GGRC50H3"}, "GASC41H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["ACMB01H3"], "str": "4.0 credits, including ACMB01H3"}, "title": "GASC41H3  Media and Popular Culture in East Asia ", "exclusions": {"list": ["MDSC41H3"], "str": "MDSC41H3"}, "description": "This course introduces students to media industries and commercial popular cultural forms in East Asia. Topics include reality TV, TV dramas, anime, and manga as well as issues such as regional cultural flows, global impact of Asian popular culture, and the localization of global media in East Asia. Same as MDSC41H3", "code": "GASC41H3"}, "GASB73H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHA46H3", "GASA01H3"], "str": "VPHA46H3 or GASA01H3"}, "title": "GASB73H3  Visualizing Asia ", "exclusions": {"list": ["VPHB73H3", "FAH261H"], "str": "VPHB73H3, FAH261H"}, "description": "A survey of the art of China, Japan, Korea, India, and Southeast Asia. We will examine a wide range of artistic production, including ritual objects, painting, calligraphy, architectural monuments, textile, and prints. Special attention will be given to social contexts, belief systems, and interregional exchanges. Same as VPHB73H3", "code": "GASB73H3"}, "GASD06H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "8.0 credits completed including 1.0 credit in GAS or HIS courses at the B-level or above"}, "title": "GASD06H3  Global History of Crime and Punishment since 1750 ", "exclusions": {"list": ["HISD06H3"], "str": "HISD06H3"}, "description": "An exploration of the global problem of crime and punishment. The course investigates how the global processes of colonialism, industrialization, capitalism and liberalization affected modern criminal justice and thus the state-society relationship and modern citizenry in different cultures across time and space. Same as HISD06H3 Transnational Area", "code": "GASD06H3"}, "GASD40H3": {"description": "The Chinese government has played a central role in the development of print, electronic and digital media. Recent changes in the political economy of Chinese media have had strong political and cultural implications. This senior seminar course examines the complex and dynamic interplay of media and politics in contemporary China.", "prerequisite": {"list": ["GASA01H3", "GASA02H3"], "str": "[GASA01H3 and GASA02H3] and one C-level course from the options in the Specialist or Major program requirement #2"}, "title": "GASD40H3  Senior Seminar: Issues in Chinese Media Studies ", "code": "GASD40H3"}, "GASC33H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course critically examines different aspects of Buddhism in global context. It is offered as part of the prestigious TLKY Visiting Professor program.", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "GASC33H3  Critical Perspectives in Global Buddhism ", "code": "GASC33H3"}, "GGRC56H3": {"breath_req": "Social & Behavioural Sciences", "description": "Cultural Politics and political economy of travel and mobilities across time and space. Covers migration and immigration, tourism and travel encounters, diaspora and displacement, religious missions and pilgrimages, study abroad and working holiday, transportation and communication technologies, and narratives of time travel. Addresses how these extraordinary and everyday mobilities and immobilities inform geographies of race, gender, sexuality, and nation.Area of focus: Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC56H3  Spaces of Travel: Unsettling Migration, Tourism, and Everyday Mobilities ", "code": "GGRC56H3"}, "GGRC25H3": {"breath_req": "Social & Behavioural Sciences", "description": "Land reform, which entails the redistribution of private and public lands, is broadly associated with struggles for social justice. It embraces issues concerning how land is transferred (through forceful dispossession, law, or markets), and how it is currently held. Land inequalities exist all over the world, but they are more pronounced in the developing world, especially in countries that were affected by colonialism. Land issues, including land reform, affect most development issues.Area of focus: Environmental Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC25H3  Land Reform and Development ", "code": "GGRC25H3"}, "GASC42H3": {"breath_req": "Arts, Literature & Language", "description": "This course offers students a critical perspective on film and popular cultures in South Asia. Topics include Bombay, Tamil, and other regional filmic industries, their history, production, and distribution strategies, their themes and musical genres, and a critical look at the larger social and political meanings of these filmic cultures. ", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "GASC42H3  Film and Popular Culture in South Asia ", "code": "GASC42H3"}, "GASC40H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["ACMB01H3"], "str": "4.0 credits, including ACMB01H3"}, "title": "GASC40H3  Chinese Media and Politics ", "exclusions": {"list": ["MDSC40H3"], "str": "MDSC40H3"}, "description": "This course examines the complex and dynamic interplay of media and politics in contemporary China, and the role of the government in this process.Same as MDSC40H3", "code": "GASC40H3"}, "GASB33H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines the global spread of different versions of Buddhism across historical and contemporary societies.", "title": "GASB33H3  Global Buddhism in Historical and Contemporary Societies ", "code": "GASB33H3"}, "GASB74H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the social circulation of Asian-identified foods and beverages using research from geographers, anthropologists, sociologists, and historians to understand their changing roles in ethnic entrepreneur-dominated cityscapes of London, Toronto, Singapore, Hong Kong, and New York. Foods under study include biryani, curry, coffee, dumplings, hoppers, roti, and tea. Same as HISB74H3", "exclusions": {"list": ["HISB74H3"], "str": "HISB74H3"}, "title": "GASB74H3  Asian Foods and Global Cities ", "code": "GASB74H3"}, "GGRC40H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC40H3  Megacities and Global Urbanization ", "exclusions": {"list": ["CITC40H3"], "str": "(CITC40H3)"}, "description": "The last 50 years have seen dramatic growth in the global share of population living in megacities over 10 million population, with most growth in the global south. Such giant cities present distinctive infrastructure, health, water supply, and governance challenges, which are increasingly central to global urban policy and health.Area of focus: Urban Geography", "code": "GGRC40H3"}, "GASB20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines the role of gender in shaping social institutions in Asia.", "title": "GASB20H3  Gender and Social Institutions in Asia ", "code": "GASB20H3"}, "GGRD19H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["GGRB13H3", "SOCB60H3"], "str": "13.0 credits including [GGRB13H3 or SOCB60H3]"}, "title": "GGRD19H3  Spaces of Multiraciality: Critical Mixed Race Theory ", "exclusions": {"list": ["GGRC19H3"], "str": "(GGRC19H3)"}, "description": "From Tiger Woods to Mariah Carey, the popular mixed race phenomenon has captured the popular imagination and revealed the contradictory logic of categorization underpinning racial divisions. We will explore the complexities of racial identity formation to illuminate the experiences of those who fall outside the prevailing definitions of racial identities.Area of focus: Social/Cultural Geography", "code": "GGRD19H3"}, "GASD30H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "1.0 credit at the B-level and 1.0 credit at the C-level in WST courses, or other Humanities and Social Sciences courses"}, "title": "GASD30H3  Asians and Aliens: Techno-Orientalism and Global Asian Futurity ", "exclusions": {"list": ["WSTD30H3"], "str": "WSTD30H3"}, "description": "This course examines how popular culture projects its fantasies and fears about the future onto Asia through sexualized and racialized technology. Through the lens of techno-Orientalism this course explores questions of colonialism, imperialism and globalization in relation to cyborgs, digital industry, high-tech labor, and internet/media economics. Topics include the hyper-sexuality of Asian women, racialized and sexualized trauma and disability. This course requires student engagement and participation. Students are required to watch films in class, and creative assignments such as filmmaking and digital projects are encouraged.  Same as WSTD30H3", "code": "GASD30H3"}, "GGRC24H3": {"breath_req": "Social & Behavioural Sciences", "description": "Explores the processes through which segments of societies come to understand their natural surroundings, the social relations that produce those understandings, popular representations of nature, and how 'the environment' serves as a consistent basis of social struggle and contestation.Areas of focus: Environmental Geography; Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC24H3  Socio-Natures and the Cultural Politics of 'The Environment' ", "code": "GGRC24H3"}, "GGRC13H3": {"breath_req": "Social & Behavioural Sciences", "description": "Geographical approach to the politics of contemporary cities with emphasis on theories and structures of urban political processes and practices. Includes nature of local government, political powers of the property industry, big business and community organizations and how these shape the geography of cities.Area of focus: Urban Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC13H3  Urban Political Geography ", "code": "GGRC13H3"}, "GGRC33H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines issues of urban form and structure, urban growth and planning in the Toronto region. Current trends in population, housing, economy, environment, governance, transport, urban design and planning practices at the local level and the regional scale will be examined critically.Area of focus: Urban Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC33H3  The Toronto Region ", "code": "GGRC33H3"}, "GGRB30H3": {"breath_req": "Quantitative Reasoning", "description": "This course provides a practical introduction to digital mapping and spatial analysis using a geographic information system (GIS). The course is designed to provide hands-on experience using GIS to analyse spatial data, and create maps that effectively communicate data meanings. Students are instructed in GIS methods and approaches that are relevant not only to Geography but also to many other disciplines. In the lectures, we discuss mapping and analysis concepts and how you can apply them using GIS software. In the practice exercises and assignments, you then learn how to do your own data analysis and mapping, gaining hands-on experience with ArcGIS software, the most widely used GIS software.", "exclusions": {"list": ["GGR272H", "GGR278H"], "str": "GGR272H, GGR278H"}, "title": "GGRB30H3  Fundamentals of GIS I ", "code": "GGRB30H3"}, "GGRC26H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course addresses the translation of environmentalisms into formalized processes of environmental governance; and examines the development of environmental institutions at different scales, the integration of different forms of environmental governance, and the ways in which processes of governance relate to forms of environmental practice and management.Area of focus: Environmental Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC26H3  Geographies of Environmental Governance ", "code": "GGRC26H3"}, "GASB58H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["GASA01H3", "GASA02H3", "HISA01H3", "HISA02H3"], "str": "GASA01H3 or GASA02H3 or (HISA01H3) or (HISA02H3)"}, "title": "GASB58H3  Modern Chinese History ", "exclusions": {"list": ["HIS280Y", "HISB58H3"], "str": "HIS280Y, HISB58H3"}, "description": "This course provides an overview of the historical changes and continuities of the major cultural, economic, political, and social institutions and practices in modern Chinese history. Africa and Asia AreaSame as HISB58H3.", "code": "GASB58H3"}, "GASB05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["MDSA01H3"], "str": "MDSA01H3 and any 4.0 credits"}, "title": "GASB05H3  Media and Globalization ", "exclusions": {"list": ["MDSB05H3"], "str": "MDSB05H3"}, "description": "This course introduces students to the variety of ways cultural and social theorists have addressed notions of \"globalization\" and the media; It will also focus on media systems and practices over different parts of the Global South: in particular, Asian, Latin American, and Middle Eastern countries.Same as MDSB05H3", "code": "GASB05H3"}, "GGRC34H3": {"breath_req": "Social & Behavioural Sciences", "description": "Significant recent transformations of geographic knowledge are being generated by the ubiquitous use of smartphones and other distributed sensors, while web-based platforms such as Open Street Map and Public Participation GIS (PPGIS) have made crowd-sourcing of geographical data relatively easy. This course will introduce students to these new geographical spaces, approaches to creating them, and the implications for local democracy and issues of privacy they pose.Area of focus: Urban Geography", "prerequisite": {"list": ["GGRB05H3", "GGRB30H3"], "str": "GGRB05H3 or GGRB30H3"}, "title": "GGRC34H3  Crowd-sourced Urban Geographies ", "code": "GGRC34H3"}, "GASD56H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["SOCB60H3"], "str": "[8.0 credits, at least 2.0 of which should be at the B- or C-level in Modern History] or [15.0 credits, including SOCB60H3]"}, "title": "GASD56H3  'Coolies' and Others: Asian Labouring Diasporas in the British Empire ", "exclusions": {"list": ["HISD56H3"], "str": "HISD56H3"}, "description": "'Coolie' labourers formed an imperial diaspora linking South Asia and China to the Caribbean, Africa, the Indian Ocean, South-east Asia, and North America. The long-lasting results of this history are evident in the cultural and ethnic diversity of today's Caribbean nations and Commonwealth countries such as Great Britain and Canada. Africa and Asia Area Same as HISD56H3", "code": "GASD56H3"}, "GGRC48H3": {"breath_req": "Social & Behavioural Sciences", "description": "How have social and economic conditions deteriorated for many urban citizens? Is the geographic gap widening between the rich and the poor? This course will explore the following themes: racialization of poverty, employment and poverty, poverty and gender socio-spatial polarization, and housing and homelessness.Area of focus: Urban Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC48H3  Geographies of Urban Poverty ", "code": "GGRC48H3"}, "GASC43H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course explores the development of colonialism, modernity, and nationalism in modern Japan, Korea, China, and Taiwan. Key issues include sexuality, race, medicine, mass media, and consumption.", "prerequisite": {"list": ["GASB20H3", "GASB58H3", "HISB58H3", "GASC20H3"], "str": "Any one of [GASB20H3 or GASB58H3/HISB58H3 or GASC20H3]"}, "title": "GASC43H3  Colonialisms and Cultures in Modern East Asia ", "code": "GASC43H3"}, "GASC59H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "4.0 credits and [an additional 0.5 credit in HCS or ANT courses]"}, "title": "GASC59H3  The Making of Tamil Worlds ", "exclusions": {"list": ["HISC59H3", "GASB54H3", "HISB54H3"], "str": "HISC59H3, (GASB54H3), (HISB54H3)"}, "description": "This course explores the transnational history of Tamil worlds. In addition to exploring modern Tamil identities, the course will cover themes such as mass migration, ecology, social and economic life, and literary history.", "code": "GASC59H3"}, "GGRC12H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["GGRA30H3", "GGRB05H3", "CITB02H3"], "str": "Any 8.0 credits including GGRA30H3 and [GGRB05H3 or CITB02H3]"}, "title": "GGRC12H3  Transportation Geography ", "exclusions": {"list": ["GGR370H", "GGR424H"], "str": "GGR370H, GGR424H"}, "description": "Transportation systems play a fundamental role in shaping social, economic and environmental outcomes in a region. This course explores geographical perspectives on the development and functioning of transportation systems, interactions between transportation and land use, and costs and benefits associated with transportation systems including: mobility, accessibility, congestion, pollution, and livability.Area of focus: Urban Geography", "code": "GGRC12H3"}, "GGRD01H3": {"description": "An independent studies course open only to students in the Major Program in Human Geography. An independent studies project will be carried out under the supervision of an individual faculty member.", "prerequisite": {"list": ["GGRB02H3"], "str": "13.0 credits including GGRB02H3"}, "title": "GGRD01H3  Supervised Research Project ", "code": "GGRD01H3"}, "GGRA02H3": {"breath_req": "Social & Behavioural Sciences", "description": "Globalization from the perspective of human geography. The course examines how the economic, social, political, and environmental changes that flow from the increasingly global scale of human activities affect spatial patterns and relationships, the character of regions and places, and the quality of life of those who live in them.", "exclusions": {"list": ["GGR107H", "GGR107Y", "GGR117Y"], "str": "GGR107H, (GGR107Y), GGR117Y"}, "title": "GGRA02H3  The Geography of Global Processes ", "code": "GGRA02H3"}, "GASA01H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course introduces Global Asia Studies through studying historical and political perspectives on Asia. Students will learn how to critically analyze major historical texts and events to better understand important cultural, political, and social phenomena involving Asia and the world. They will engage in intensive reading and writing for humanities.Same as HISA06H3", "exclusions": {"list": ["HISA06H3"], "str": "HISA06H3"}, "title": "GASA01H3  Introducing Global Asia and its Histories ", "code": "GASA01H3"}, "GGRB55H3": {"breath_req": "Social & Behavioural Sciences", "description": "The course introduces core concepts in cultural geography such as race and ethnicity, identity and difference, public and private, landscape and environment, faith and community, language and tradition, and mobilities and social change. Emphasis will be on cross-disciplinary, critical engagement with current events, pop culture, and visual texts including comics, photos, and maps.Area of Focus: Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "GGRB55H3  Cultural Geography ", "code": "GGRB55H3"}, "GGRA35H3": {"breath_req": "Social & Behavioural Sciences", "description": "Scarborough is a place of rapidly changing social geographies, and now contains one of the world's most extraordinary mixes of people. What do these changes mean, how can we understand and interpret them? This course introduces Human Geography as the study of people, place, and community through field trips, interviews, and guest lectures.", "title": "GGRA35H3  The Great Scarborough Mashup: People, Place, Community, Experience ", "code": "GGRA35H3"}, "GGRB02H3": {"breath_req": "Social & Behavioural Sciences", "description": "Many of today's key debates - for instance, on globalization, the environment, and cities - draw heavily from geographical thinking and what some have called the \"spatial turn\" in the social sciences. This course introduces the most important methodological and theoretical aspects of contemporary geographical and spatial thought, and serves as a foundation for other upper level courses in Geography.", "prerequisite": {"list": [], "str": "Any 4 credits"}, "title": "GGRB02H3  The Logic of Geographical Thought ", "code": "GGRB02H3"}, "GGRC32H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["STAB23H3", "GGRB30H3"], "str": "Any 8.0 credits including [STAB23H3 and GGRB30H3]"}, "title": "GGRC32H3  Essential Spatial Analysis ", "exclusions": {"list": ["GGR276H"], "str": "GGR276H"}, "description": "This course builds on introductory statistics and GIS courses by introducing students to the core concepts and methods of spatial analysis. With an emphasis on spatial thinking in an urban context, topics such as distance decay, distance metrics, spatial interaction, spatial distributions, and spatial autocorrelation will be used to quantify spatial patterns and identify spatial processes. These tools are the essential building blocks for the quantitative analysis of urban spatial data.Area of focus: Urban Geography", "code": "GGRC32H3"}, "GGRC45H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines the localized consequences of global processes. Toronto will be used as a site for understanding how individuals interact with and experience the effects of globalizing forces differently based on their unique conditions of life and how they respond to the challenges and opportunities of a globalized world.Areas of focus: Urban or Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC45H3  Local Geographies of Globalization ", "code": "GGRC45H3"}, "GGRC01H3": {"description": "An independent supervised reading course open only to students in the Major Program in Human Geography. An independent literature review research project will be carried out under the supervision of an individual faculty member.", "prerequisite": {"list": [], "str": "10 full credits including completion of the following requirements for the Major Program in Human Geography: 1) Introduction, 2) Theory and Concepts, 3) Methods; and a cumulative GPA of at least 2.5."}, "title": "GGRC01H3  Supervised Readings in Human Geography ", "code": "GGRC01H3"}, "GASD71H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Examines the central place of cuisine to families, societies, and cultures across Global Asian societies and their diasporas, using tastes, culinary work techniques, community-based research, oral histories, digital humanities and multi-media experiential learning, as well as critical reading and writing. ", "prerequisite": {"list": [], "str": "8.0 credits, including 1.0 credit from any program offered by the Department of Historical and Cultural Studies"}, "title": "GASD71H3  Cuisine, Culture, and Societies Across Global Asia ", "code": "GASD71H3"}, "GGRB05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 4 credits"}, "title": "GGRB05H3  Urban Geography ", "exclusions": {"list": ["GGR124H", "GGR124Y"], "str": "GGR124H, (GGR124Y)"}, "description": "This course will develop understanding of the geographic nature of urban systems and the internal spatial patterns and activities in cities. Emphasis is placed on the North American experience with some examples from other regions of the world. The course will explore the major issues and problems facing contemporary urban society and the ways they are analysed.Area of Focus: Urban Geography", "code": "GGRB05H3"}, "GGRC27H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA01H3", "ECMA01H3", "GGRB02H3", "GGRB05H3", "CITB01H3", "CITB02H3", "MGEB01H3", "ECMB01H3", "MGEB02H3", "ECMB02H3", "MGEB05H3", "ECMB05H3", "MGEB06H3", "ECMB06H3"], "str": "MGEA01H3/(ECMA01H3) and [(GGRB02H3 and GGRB05H3) or (CITB01H3 and CITB02H3)] or [[MGEB01H3/(ECMB01H3) or MGEB02H3/(ECMB02H3)] and [MGEB05H3/(ECMB05H3) or MGEB06H3/(ECMB06H3)]]"}, "title": "GGRC27H3  Location and Spatial Development ", "exclusions": {"list": ["GGRB27H3", "GGR220Y"], "str": "(GGRB27H3), GGR220Y"}, "description": "Location of a firm; market formation and areas; agricultural location; urban spatial equilibrium; trade and spatial equilibrium; locational competition; equilibrium for an industry; trade and location.Area of focus: Urban Geography", "code": "GGRC27H3"}, "GGRB03H3": {"breath_req": "Arts, Literature & Language", "description": "This courseaims to developcriticalreading and writing skills of human geography students. Through a variety of analytical, reflexive, and descriptive writing assignments, students will practice how to draft, revise,and edit their writing onspatial concepts.Students will learn how to conduct research for literature reviews,organize materials, and produce scholarly papers. They will also learn to cultivate their writing voice by engaging in a range of writing styles and forms such as blog posts, critical commentaries, travelogues, field notes, and research briefs. The course emphasizes writing clearly, succinctly, and logically.", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "GGRB03H3  Writing Geography ", "code": "GGRB03H3"}, "GGRC02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC02H3  Population Geography ", "exclusions": {"list": ["GGR323H", "GGR208H"], "str": "GGR323H, GGR208H"}, "description": "An examination of the geographical dimension to human population through the social dynamics of fertility, mortality and migration. Themes include disease epidemics, international migration, reproductive technologies, and changing family structure.Area of focus: Social/Cultural Geography", "code": "GGRC02H3"}, "GASC45H3": {"breath_req": "Arts, Literature & Language", "description": "This course offers students a critical perspective on film and popular cultures in East Asia. The course examines East Asian filmic industries, and the role they play in shaping worldviews, aesthetics, ethical norms, folk beliefs, and other socio-cultural aspects in China, Hong Kong, Taiwan, Korea, and Japan.", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "GASC45H3  Film and Popular Cultures in East Asia ", "code": "GASC45H3"}, "GGRD08H3": {"breath_req": "Social & Behavioural Sciences", "description": "Designed for final-year Human Geography Majors, this seminar is devoted to analysis and discussion of advanced theoretical and methodological issues in Environmental Geography. Specific content will vary from year to year. Seminar format with active student participation.Area of focus: Environmental Geography", "prerequisite": {"list": ["GGRB21H3"], "str": "13.0 credits including GGRB21H3"}, "title": "GGRD08H3  Research Seminar in Environmental Geography ", "code": "GGRD08H3"}, "GASC50H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["HISB58H3"], "str": "HISB58H3 or an equivalent B-level history course in East Asia."}, "title": "GASC50H3  Comparative Studies of East Asian Legal Cultures ", "exclusions": {"list": ["HISC56H3"], "str": "HISC56H3"}, "description": "An introduction to the distinctive East Asian legal tradition shared by China, Japan, and Korea through readings about selected thematic issues. Students will learn to appreciate critically the cultural, political, social, and economic causes and effects of East Asian legal cultures and practices. Same as HISC56H3 ", "code": "GASC50H3"}, "GGRD14H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines links between politics of difference, social justice and cities. Covers theories of social justice and difference with a particular emphasis placed on understanding how contemporary capitalism exacerbates urban inequalities and how urban struggles such as Occupy Wall Street seek to address discontents of urban dispossession. Examples of urban social struggles will be drawn from global North and South.Areas of focus: Urban or Social/Cultural Geography", "prerequisite": {"list": ["GGRB05H3", "GGRB13H3", "CITB02H3", "IDSB06H3"], "str": "13.0 credits including [GGRB05H3 or GGRB13H3 or CITB02H3 or IDSB06H3]"}, "title": "GGRD14H3  Social Justice and the City ", "code": "GGRD14H3"}, "GGRC09H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examination and discussion of current trends and issues in social geography, with particular emphasis on recent developments in concepts and methods. This course is an unique opportunity to explore a particular topic in-depth, the specific content will vary from year to year.Area of focus: Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC09H3  Current Topics in Social Geography ", "code": "GGRC09H3"}, "GGRD11H3": {"breath_req": "Social & Behavioural Sciences", "description": "Designed for final-year Human Geography Majors, this reading-intensive seminar course develops analytical and methodological skills in socio-spatial analysis. We explore major theoretical/methodological traditions in geography including positivism, humanism, Marxism, and feminism, and major analytical categories such as place, scale, and networks. Particularly recommended for students intending to apply to graduate school.", "prerequisite": {"list": ["GGRB02H3"], "str": "13.0 credits including GGRB02H3"}, "title": "GGRD11H3  Advanced Geographical Theory and Methods ", "code": "GGRD11H3"}, "GGRA03H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to the characteristics of modern cities and environmental issues, and their interconnections. Linkages between local and global processes are emphasized. Major topics include urban forms and systems, population change, the complexity of environmental issues such as climate change and water scarcity, planning for sustainable cities.", "exclusions": {"list": ["GGR107H", "GGR107Y", "GGR117Y"], "str": "GGR107H, (GGR107Y), GGR117Y"}, "title": "GGRA03H3  Cities and Environments ", "code": "GGRA03H3"}, "GASB53H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Why does Southern Asias pre-colonial history matter? Using materials that illustrate the connected worlds of Central Asia, South Asia and the Indian Ocean rim, we will query conventional histories of Asia in the time of European expansion. Same as HISB53H3 0.5 pre-1800 credit Africa and Asia Area", "exclusions": {"list": ["HISB53H3"], "str": "HISB53H3"}, "title": "GASB53H3  Mughals and the World, 1500-1858 AD ", "code": "GASB53H3"}, "GGRC28H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC28H3  Indigenous Environmental Knowledges ", "exclusions": {"list": ["ABS402H"], "str": "ABS402H"}, "description": "Examines Indigenous knowledge, world-views, theory, philosophies and values, and their relationship to environmental practice. Students will be introduced to Indigenous knowledge as it pertains to the environment through exposure to Indigenous scholarship and innovative governance practices.", "code": "GGRC28H3"}, "GASC53H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "One full credit in art history or in Asian or medieval European history."}, "title": "GASC53H3  The Silk Routes ", "exclusions": {"list": ["VPHC53H3"], "str": "VPHC53H3"}, "description": "The Silk Routes were a lacing of highways connecting Central, South and East Asia and Europe. Utilizing the Royal Ontario Museum's collections, classes held at the Museum and U of T Scarborough will focus on the art produced along the Silk Routes in 7th to 9th century Afghanistan, India, China and the Taklamakhan regions. Same as VPHC53H3", "code": "GASC53H3"}, "GGRB28H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines the geographical distribution of disease and the spatial processes in which diseases are embedded. Themes include spatial theories of health and disease and uneven development and health. Special attention will be given to the geographical dimension of the HIV pandemic.Area of Focus: Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 4 credits"}, "title": "GGRB28H3  Geographies of Disease ", "code": "GGRB28H3"}, "GGRC11H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examination and discussion of current trends and issues in urban geography, with particular emphasis on recent developments in concepts and methods. This course is an unique opportunity to explore a particular topic in-depth, the specific content will vary from year to year.Area of focus: Urban Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC11H3  Current Topics in Urban Geography ", "code": "GGRC11H3"}, "GASB30H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines the close relationship between religions and cultures, and the role they play in shaping the worldviews, aesthetics, ethical norms, and other social ideals in Asian countries and societies.", "title": "GASB30H3  Asian Religions and Culture ", "code": "GASB30H3"}, "GGRC54H3": {"breath_req": "Social & Behavioural Sciences", "description": "Provides an opportunity to engage in a field trip and field research work on a common research topic. The focus will be on: preparation of case study questions; methods of data collection including interviews, archives, and observation; snowballing contacts; and critical case-study analysis in a final report.", "prerequisite": {"list": ["GGRB02H3"], "str": "GGRB02H3 and 1.0 additional credit at the B-level in GGR"}, "title": "GGRC54H3  Human Geography Field Trip ", "code": "GGRC54H3"}, "GASD01H3": {"description": "This course offers an in-depth study of important cultural issues in historical and contemporary Asian, diasporic and borderland societies, including migration, mobility, and circulation. It is conducted in seminar format with emphasis on discussion, critical reading and writing, digital skills, and primary research.", "prerequisite": {"list": ["GASA01H3", "GASA02H3", "SOCB60H3"], "str": "[[GASA01H3 and GASA02H3] and one C-level course from the options in the Specialist or Major program requirement #2] or [15.0 credits, including SOCB60H3]"}, "title": "GASD01H3  Senior Seminar: Topics in Global Asian Migrations ", "code": "GASD01H3"}, "GGRC21H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examination and discussion of current trends and issues in environmental geography, with particular emphasis on recent developments in concepts and methods. This course is an unique opportunity to explore a particular topic in-depth, the specific content will vary from year to year.Area of focus: Environmental Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC21H3  Current Topics in Environmental Geography ", "code": "GGRC21H3"}, "GASC20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course offers students a critical and analytical perspective on issues of gender history, equity, discrimination, resistance, and struggle facing societies in East and South Asia and their diasporas.", "prerequisite": {"list": [], "str": "8.0 credits, including 0.5 credit at the A-level, and 1.0 credit at the B-level in AFS, CLA, FST, GAS, HIS, or WST courses"}, "title": "GASC20H3  Gendering Global Asia ", "code": "GASC20H3"}, "GGRC44H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC44H3  Environmental Conservation and Sustainable Development ", "exclusions": {"list": ["GGR233Y", "GGRB20H3"], "str": "GGR233Y, (GGRB20H3)"}, "description": "Deals with two main topics: the origins of environmental problems in the global spread of industrial capitalism, and environmental conservation and policies. Themes include: changes in human-environment relations, trends in environmental problems, the rise of environmental awareness and activism, environmental policy, problems of sustainable development.Area of focus: Environmental Geography", "code": "GGRC44H3"}, "GASD58H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["GASA01H3", "HISB58H3"], "str": "8.0 credits including at least GASA01H3 or HISB58H3"}, "title": "GASD58H3  Culture, Politics, and Society in Late Imperial China ", "exclusions": {"list": ["HISD58H3"], "str": "HISD58H3"}, "description": "A study of major cultural trends, political practices, social customs, and economic developments in late imperial China (1400-1911) as well as their relevance to modern and contemporary China. Students will read the most recent literature and write a substantive research paper. 0.5 pre-1800 credit Africa and Asia area Same as HISD58H3", "code": "GASD58H3"}, "GGRB13H3": {"breath_req": "Social & Behavioural Sciences", "description": "The reciprocal relations between spatial structures and social identities. The course examines the role of social divisions such as class, 'race'/ethnicity, gender and sexuality in shaping the social geographies of cities and regions. Particular emphasis is placed on space as an arena for the construction of social relations and divisions.Area of Focus: Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 4 credits"}, "title": "GGRB13H3  Social Geography ", "code": "GGRB13H3"}, "GASD02H3": {"description": "This course offers a capstone experience of issues which confront Asian and diasporic societies. Themes include gender, environment, human rights, equity, religion, politics, law, migration, labour, nationalism, post-colonialism, and new social movements. It is conducted in seminar format with emphasis on discussion, critical reading, and writing of research papers.", "prerequisite": {"list": ["GASA01H3", "GASA02H3"], "str": "[GASA01H3 and GASA02H3 and one C-level course from the options in the Specialist or Major program requirement #2"}, "title": "GASD02H3  Senior Seminar: Topics in Global Asian Societies ", "code": "GASD02H3"}, "GGRD12H3": {"description": "Designed for final-year Human Geography Majors, this seminar is devoted to analysis and discussion of current theoretical and methodological issues in human geography.This course is an unique opportunity to explore a particular topic in-depth, the specific content will vary from year to year. Seminar format with active student participation.", "prerequisite": {"list": ["GGRB02H3"], "str": "13.0 credits including GGRB02H3"}, "title": "GGRD12H3  Seminar in Selected Topics in Human Geography ", "code": "GGRD12H3"}, "GGRC30H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["GGRB32H3"], "str": "GGRB32H3"}, "title": "GGRC30H3  Advanced GIS ", "exclusions": {"list": ["GGR373H"], "str": "GGR373H"}, "description": "This course covers advanced theoretical and practical issues of using GIS systems for research and spatial analysis. Students will learn how to develop and manage GIS research projects, create and analyze three-dimensional surfaces, build geospatial models, visualize geospatial data, and perform advanced spatial analysis. Lectures introduce concepts and labs implement them.", "code": "GGRC30H3"}, "GASD03H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "The course offers an in-depth, special study of important topics in the study of Global Asia. Special topics will vary from year to year depending on the expertise of the visiting professor. It is conducted in seminar format with emphasis on discussion, critical reading, and writing of research papers.", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GASD03H3  Senior Seminar: Topics in Global Asia Studies ", "code": "GASD03H3"}, "GGRB21H3": {"breath_req": "Social & Behavioural Sciences", "description": "This foundational course explores different conceptions of 'the environment' as they have changed through space and time. It also analyzes the emergence of different variants of environmentalism and their contemporary role in shaping environmental policy and practice.Area of Focus: Environmental Geography", "exclusions": {"list": ["GGR222H", "GGR223H"], "str": "GGR222H, GGR223H"}, "title": "GGRB21H3  Political Ecology: Nature, Society and Environmental Change ", "code": "GGRB21H3"}, "GASB77H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to modern Asian art through domestic, regional, and international exhibitions. Students will study the multilayered new developments of art and art institutions in China, Japan, Korea, India, Thailand, and Vietnam, as well as explore key issues such as colonial modernity, translingual practices, and multiple modernism. Same as VPHB77H3", "exclusions": {"list": ["VPHB77H3"], "str": "VPHB77H3"}, "title": "GASB77H3  Modern Asian Art ", "code": "GASB77H3"}, "GASC74H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["VPHB39H3", "VPHB73H3", "GASB58H3", "HISB58H3", "GASB33H3", "GASB35H3"], "str": "2 full credits at the B-level in Art History, Asian History, and/or Global Asia Studies, including at least one of VPHB39H3, VPHB73H3, GASB58H3/HISB58H3, GASB33H3, or (GASB35H3)"}, "title": "GASC74H3  A Tale of Three Cities: Introduction to Contemporary Art in China ", "exclusions": {"list": ["VPHC74H3"], "str": "VPHC74H3"}, "description": "An introduction to Chinese contemporary art focusing on three cities: Beijing, Shanghai, and Guangzhou. Increasing globalization and China's persistent self-renovation has brought radical changes to cities, a subject of fascination for contemporary artists. The art works will be analyzed in relation to critical issues such as globalization and urban change. Same as VPHC74H3", "code": "GASC74H3"}, "GASC57H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["GASA01H3", "GASB58H3"], "str": "GASA01H3 or GASB58H3"}, "title": "GASC57H3  China and the World ", "exclusions": {"list": ["HISC57H3"], "str": "HISC57H3"}, "description": "A study of the history of China's relationship with the rest of the world in the modern era. The readings focus on China's role in the global economy, politics, religious movements, transnational diasporas, scientific/technological exchanges, and cultural encounters and conflicts in the ages of empire and globalization. Africa and Asia Area Same as HISC57H3", "code": "GASC57H3"}, "GGRB32H3": {"breath_req": "Quantitative Reasoning", "description": "This course builds on GGRB30 Fundamentals of GIS, continuing the examination of theoretical and analytical components of GIS and spatial analysis, and their application through lab assignments. The course covers digitizing, topology, vector data models, remote sensing and raster data models and analysis, geoprocessing, map design and cartography, data acquisition, metadata, and data management, and web mapping.", "prerequisite": {"list": ["GGRB30H3"], "str": "GGRB30H3"}, "title": "GGRB32H3  Fundamentals of GIS II ", "code": "GGRB32H3"}, "GGRC49H3": {"breath_req": "Social & Behavioural Sciences", "description": "The politics of land and territorial rights are a central theme in international development practice in Latin America. This course attends to how development policy shapes access to, control of, and struggles over land and natural resources. The land and territorial struggles of women and indigenous, Afro-descendant and campesino communities inform course content.Areas of focus: Environmental or Social/Cultural Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC49H3  Land, Development, and Struggle in Latin America ", "code": "GGRC49H3"}, "GGRD31H3": {"breath_req": "Social & Behavioural Sciences", "description": "Independent research extension to one of the courses already completed in Human Geography. Enrolment requires written permission from a faculty supervisor and Associate Chair, Human Geography. Only open to students who have completed 13.0 credits and who are enrolled in the Human Geography Major, Human and Physical Geography Major programs, or Minor Program in GIS sponsored by the Department of Human Geography.", "prerequisite": {"list": [], "str": "Any 13.0 credits"}, "title": "GGRD31H3  Independent Research Project ", "code": "GGRD31H3"}, "GGRD30H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["GGRC30H3"], "str": "GGRC30H3"}, "title": "GGRD30H3  GIS Research Project ", "exclusions": {"list": ["GGR462H"], "str": "GGR462H"}, "description": "Students will design, manage and complete a research project using GIS. Students will work in teams of 4-6 to pose a research question, acquire a dataset, and organize and analyze the data to answer their question. The course will teach research design, project management, data analysis, team work, and presentation of final results.", "code": "GGRD30H3"}, "GGRC31H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Explores the practice of ethnography (i.e. participant observation) within and outside the discipline of geography, and situates this within current debates on methods and theory. Topics include: the history of ethnography, ethnography within geography, current debates within ethnography, the \"field,\" and ethnography and \"development.\"", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC31H3  Qualitative Geographical Methods: Place and Ethnography ", "code": "GGRC31H3"}, "GGRC10H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines global urbanization processes and the associated transformation of governance, social, economic, and environmental structures particularly in the global south. Themes include theories of development, migration, transnational flows, socio-spatial polarization, postcolonial geographies of urbanization.Area of focus: Urban Geography", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC10H3  Urbanization and Development ", "code": "GGRC10H3"}, "GGRC41H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examination and discussion of current trends and issues in human geography, with particular emphasis on recent developments in concepts and methods.This course is an unique opportunity to explore a particular topic in-depth, the specific content will vary from year to year.", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "GGRC41H3  Current Topics in Human Geography ", "code": "GGRC41H3"}, "GGRD25H3": {"breath_req": "Social & Behavioural Sciences", "description": "Designed for final-year Human Geography Majors, this seminar is devoted to analysis and discussion of current theoretical and methodological issues in urban geography. Specific content will vary from year to year. Seminar format with active student participation.Area of focus: Urban Geography", "prerequisite": {"list": ["GGRB05H3", "CITB02H3"], "str": "13.0 credits including [GGRB05H3 or CITB02H3]"}, "title": "GGRD25H3  Research Seminar in Urban Spaces ", "code": "GGRD25H3"}, "GGRA30H3": {"breath_req": "Quantitative Reasoning", "description": "Confirmatory causal modeling and GIS; map as model; GIS data input; cartographic and GIS data structures; data errors and editing; elementary spatial analysis; measurement; map comparison; classification; statistical surfaces; spatial arrangement; privacy issues.", "title": "GGRA30H3  Geographic Information Systems (GIS) and Empirical Reasoning ", "code": "GGRA30H3"}}