{"IDSD19H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course focuses on recent theories and approaches to researcher-practitioner engagement in development. Using case studies, interviews, and extensive literature review, students will explore whether such engagements offer opportunities for effective social change and improved theory.", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits, including IDSA01H3"}, "title": "IDSD19H3  The Role of Researcher-Practitioner Engagement in Development ", "code": "IDSD19H3"}, "IDSD02H3": {"breath_req": "Social & Behavioural Sciences", "description": "An advanced seminar in critical development theory and policy, with an emphasis on perspectives and theories from the global South. Students will write a series of theoretical reflections on contemporary policy issues, that contributes to a final critical development theory paper. Students will present the results of their thinking in a conference setting.", "prerequisite": {"list": ["IDSC04H3"], "str": "14.0 credits including IDSC04H3"}, "title": "IDSD02H3  Advanced Seminar in Critical Development Studies: Theory and Policy ", "code": "IDSD02H3"}, "IDSC08H3": {"breath_req": "Social & Behavioural Sciences", "description": "Critical perspectives on the effects of traditional and 'new' media on development policy and practice. The course examines the increasingly significant role the media plays in the development process, the ways in which media-generated images of development and developing countries affect development policy and the potential of 'new' media for those who are marginalized from the development process.", "prerequisite": {"list": ["IDSA01H3", "IDSB10H3"], "str": "IDSA01H3 and IDSB10H3"}, "title": "IDSC08H3  Media and Development ", "code": "IDSC08H3"}, "IDSB01H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["MGEA01H3", "ECMA01H3", "MGEA05H3", "ECMA05H3", "MGEA02H3", "ECMA04H3", "MGEA06H3", "ECMA06H3", "IDSA01H3"], "str": "[MGEA01H3/(ECMA01H3) and MGEA05H3/(ECMA05H3)] or [MGEA02H3/(ECMA04H3) and MGEA06H3/(ECMA06H3)] and IDSA01H3"}, "title": "IDSB01H3  Political Economy of International Development ", "exclusions": {"list": ["ECO230Y"], "str": "ECO230Y"}, "description": "Introduces students to major development problems, focusing on international economic and political economy factors. Examines trade, aid, international institutions such as the World Bank, the IMF and the WTO. Examines both conventional economic perspectives as well as critiques of these perspectives. This course can be counted for credit in ECM Programs.", "code": "IDSB01H3"}, "IDSB02H3": {"breath_req": "Natural Sciences", "description": "The environmental consequences of development activities with emphasis on tropical countries. Environmental change in urban, rainforest, semi-arid, wetland, and mountainous systems. The influences of development on the global environment; species extinction, loss of productive land, reduced access to resources, declining water quality and quantity, and climate change.", "prerequisite": {"list": ["IDSA01H3", "EESA01H3"], "str": "IDSA01H3 or EESA01H3"}, "title": "IDSB02H3  Development and Environment ", "code": "IDSB02H3"}, "IDSB04H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course offers an introduction to the institutional, social, economic, epidemiological, ideological, and political forces in the field of international/global health. While considerable reference will be made to \"high-income\" countries, the major emphasis will be on the health conditions of \"low-income\" countries -- as well as the interaction of these conditions with the international aid system. After setting the historical and political economy context, the course will explore key topics and themes in international/global health including: international health agencies and activities; data on health; epidemiology and the global distribution of health and disease; the societal determinants of health and social inequalities in health; health economics and the organization of health care systems in comparative context; globalization, trade, work, and health; health and the environment; the ingredients of healthy societies across the world; and Canada's/your/civil society's role in global health policy-making.", "prerequisite": {"list": ["IDSA01H3"], "str": "5.0 full credits including IDSA01H3"}, "title": "IDSB04H3  Introduction to International/Global Health ", "code": "IDSB04H3"}, "ISTD01H3": {"description": "For upper level students whose interests are not covered in one of the other courses normally offered. Courses will normally only be available to students who have completed 15 full credits and all of the Core courses. Students must obtain consent from the Supervisor of Studies and supervising instructor before registering for this course.", "prerequisite": {"list": ["POLB80H3", "POLB81H3", "ISTB01H3", "IDSB10H3"], "str": "POLB80H3 and POLB81H3 and [(ISTB01H3) or IDSB10H3]"}, "title": "ISTD01H3  Readings in International Studies ", "code": "ISTD01H3"}, "IDSC12H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["IDSA01H3", "IDSB01H3"], "str": "IDSA01H3 and IDSB01H3"}, "title": "IDSC12H3  Economics of Small Enterprise and Microcredit ", "exclusions": {"list": ["IDSB05H3"], "str": "(IDSB05H3)"}, "description": "Considers the role of micro- and small/medium enterprise in the development process, as compared to the larger firms. Identifies the role of smaller enterprises in employment creation and a more equitable distribution of income. Examines policies which can contribute to these outcomes, including micro-credit. This course can be counted for credit in ECM Programs.", "code": "IDSC12H3"}, "IDSC10H3": {"description": "Contents to be determined by instructor.", "prerequisite": {"list": ["IDSA01H3", "IDSB01H3", "IDSB02H3"], "str": "IDSA01H3 and IDSB01H3 and IDSB02H3"}, "title": "IDSC10H3  Topics in International Development Studies ", "code": "IDSC10H3"}, "IDSA02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["AFSA01H3", "IDSA01H3"], "str": "AFSA01H3 or IDSA01H3"}, "title": "IDSA02H3  Experiencing Development in Africa ", "exclusions": {"list": ["AFSA03H3"], "str": "AFSA03H3"}, "description": "This experiential learning course allows students to experience first hand the realities, challenges, and opportunities of working with development organizations in Africa. The goal is to allow students to actively engage in research, decision-making, problem solving, partnership building, and fundraising, processes that are the key elements of development work.Same as AFSA03H3", "code": "IDSA02H3"}, "IDSC11H3": {"breath_req": "Social & Behavioural Sciences", "description": "Key global and international health issues are explored in-depth in three learning phases. We begin with a reading and discussion seminar on international/global health policy and politics. (Exact topic changes each year based on student interest and developments in the field). Next, students develop group projects designed to raise awareness around particular global and international health problems, culminating in UTSC International Health Week in the Meeting Place. The third phase --which unfolds throughout the course-- involves individual research projects and class presentations.", "prerequisite": {"list": ["IDSA01H3", "IDSB04H3"], "str": "IDSA01H3 and IDSB04H3"}, "title": "IDSC11H3  Issues in Global and International Health ", "code": "IDSC11H3"}, "IDSC14H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines how institutions and power relations shape the production and distribution of food, particularly in the global South. The course evaluates competing theories of hunger and malnutrition. It also explores the historical evolution of contemporary food provisioning and evaluates the viability and development potential of alternative food practices.", "prerequisite": {"list": ["IDSB01H3"], "str": "IDSB01H3"}, "title": "IDSC14H3  The Political Economy of Food ", "code": "IDSC14H3"}, "IDSC06H3": {"description": "This Directed Readings course is designed for students who already have an ongoing working relationship with a Canadian Development institution (both non-government organizations and private agencies). The course will run parallel to the work experience. Students interested in this course must contact and obtain permission from the CCDS Associate Director prior to the beginning of term.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and [1.0 credit at the B-level in IDS courses]"}, "title": "IDSC06H3  Directed Reading on Canadian Institutions and International Development ", "code": "IDSC06H3"}, "IDSD15H3": {"description": "The goal of the course is for students to prepare and write a senior undergraduate research paper in International Development Studies. For upper level students whose interests are not covered in one of the other courses normally offered. Courses will normally only be available to students in their final year of study at UTSC. Students must obtain consent from the CCDS Associate Director before registering for this course._", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits including IDSA01H3 and permission of the instructor"}, "title": "IDSD15H3  Directed Research ", "code": "IDSD15H3"}, "IDSC04H3": {"breath_req": "Social & Behavioural Sciences", "description": "Studies the phases of the project management cycle with emphasis on situational analysis and identification of needs, project implementation, project monitoring and evaluation. Examines basic organizational development, the role of Canadian non-governmental organizations engaged in the delivery of development assistance as well as with CIDA's policies and practices.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and [1.0 credit at the B-level in IDS courses]"}, "title": "IDSC04H3  Project Management I ", "code": "IDSC04H3"}, "IDSC07H3": {"breath_req": "Social & Behavioural Sciences", "description": "A case study approach building on Project Management I. Examines: the art of effective communication and negotiation, visioning, participatory and rapid rural appraisal; survey design and implementation; advanced financial management and budgeting; basic bookkeeping and spreadsheet design; results based management; environmental impact assessments; cross-cultural effectiveness; and gender and development.", "prerequisite": {"list": ["IDSA01H3", "IDSC04H3"], "str": "IDSA01H3 and IDSC04H3"}, "title": "IDSC07H3  Project Management II ", "code": "IDSC07H3"}, "IDSA01H3": {"breath_req": "Social & Behavioural Sciences", "description": "History, theory and practice of international development, and current approaches and debates in international development studies. The course explores the evolution of policy and practice in international development and the academic discourses that surround it. Lectures by various faculty and guests will explore the multi-disciplinary nature of international development studies. This course is a prerequisite for all IDS B-level courses.", "title": "IDSA01H3  Introduction to International Development Studies ", "code": "IDSA01H3"}, "IDSC01H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines research design and methods appropriate to development fieldwork. Provides `hands on' advice (practical, personal and ethical) to those preparing to enter \"the field\"; or pursuing development work as a career. Students will prepare a research proposal as their main course assignment.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and 9.0 full credits in total including at least 6.0 credits satisfying Requirements 1 through 4 of the Specialist Co-op program"}, "title": "IDSC01H3  Research Design for Development Fieldwork ", "code": "IDSC01H3"}, "IDSD12H3": {"description": "The topics presented in this course will represent a range of issues in international development studies. Topics will vary by instructor and term.", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits, including IDSA01H3"}, "title": "IDSD12H3  Topics in International Development Studies ", "code": "IDSD12H3"}, "IDSD14H3": {"description": "The goal of the course is for students to examine in a more extensive fashion the academic literature on a particular topic in International Development Studies not covered by existing course offering. Courses will normally only be available to students in their final year of study at UTSC. Students must obtain consent from the CCDS Associate Director before registering for this course._", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits, including IDSA01H3"}, "title": "IDSD14H3  Directed Reading ", "code": "IDSD14H3"}, "IDSB06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "What constitutes equitable, ethical as well as socially and environmentally just processes and outcomes of development? This course explores these questions with particular emphasis on their philosophical and ideological foundations and on the challenges of negotiating global differences in cultural, political and environmental values in international development.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3"}, "title": "IDSB06H3  Equity, Ethics and Justice in International Development ", "code": "IDSB06H3"}, "IDSD10H3": {"description": "Contents to be determined by Instructor.", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits, including IDSA01H3"}, "title": "IDSD10H3  Topics in International Development Studies ", "code": "IDSD10H3"}, "IDSC02H3": {"breath_req": "Natural Sciences", "description": "The role science plays in informing environmental policy is sometimes unclear. Students in this interdisciplinary class will examine key elements associated with generating scientific environmental knowledge, and learn how this understanding can be used to inform and critique environmental policy. Discussions of contemporary domestic and international examples are used to highlight concepts and applications.", "prerequisite": {"list": ["EESA01H3"], "str": "8.0 credits including EESA01H3"}, "title": "IDSC02H3  Environmental Science and Evidence-Based Policy ", "code": "IDSC02H3"}, "IDSC17H3": {"breath_req": "Social & Behavioural Sciences", "description": "Explores the question of citizenship through theories of citizen participation and action in dialogue with a wide range of recent empirical case studies from the global south. Going beyond formal rights and status, the course looks at deeper forms of political inclusion and direct participation in decision-making on political and policy issues.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and [1.0 credit at the B-level in IDS courses]"}, "title": "IDSC17H3  Development, Citizen Action and Social Change in the Global South ", "code": "IDSC17H3"}, "IDSC18H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the growing role of the emerging powers - the BRICS countries grouping of Brazil, Russia, India, China and South Africa - in international development. The course examines recent development initiatives by these actors in Africa, Latin America and Asia. It also explores the question of whether BRICS-led development programs and practices challenge the top-down, expert led stances of past development interventions - from colonialism to the western aid era.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and [1.0 credit at the B-level in IDS courses]"}, "title": "IDSC18H3  New Paradigms in Development: The Role of Emerging Powers ", "code": "IDSC18H3"}, "IDSD06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This interdisciplinary course traces the advance of feminist and postcolonial thinking in development studies. The course serves as a capstone experience for IDS students and social science majors looking to fully engage with feminist and postcolonial theories of development. This course combines short lectures with student led-discussions and critical analyses of development thought and practice.", "prerequisite": {"list": ["IDSA01H3"], "str": "12.0 credits including IDSA01H3"}, "title": "IDSD06H3  Feminist and Postcolonial Perspectives in Development Studies ", "code": "IDSD06H3"}, "IDSB10H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3"}, "title": "IDSB10H3  Knowledge and Communication for Development ", "exclusions": {"list": ["ISTB01H3"], "str": "(ISTB01H3)"}, "description": "Examines in-depth the roles of information and communication technology (ICT) in knowledge production and their impact on development. Do new forms of social media make communication more effective, equitable, or productive in the globalized world? How has network media changed governance, advocacy, and information flow and knowledge exchange and what do these mean for development?", "code": "IDSB10H3"}, "IDSD07H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["AFSA01H3", "IDSA01H3", "AFSA03H3", "IDSA02H3"], "str": "8.0 credits including [AFSA01H3 or IDSA01H3] and [AFSA03H3/IDSA02H3] and [1.0 credit at the B-level in AFS or IDS courses]"}, "title": "IDSD07H3  Extractive Industries in Africa ", "exclusions": {"list": ["AFSD07H3"], "str": "AFSD07H3"}, "description": "This course examines resource extraction in African history. We examine global trade networks in precolonial Africa, and the transformations brought by colonial extractive economies. Case studies, from diamonds to uranium, demonstrate how the resource curse has affected states and economies, especially in the postcolonial period.Same as AFSD07H3", "code": "IDSD07H3"}, "IDSD01Y3": {"description": "Normal enrolment in this course will be made up of IDS students who have completed their work placement. Each student will give at least one seminar dealing with their research project and/or placement. The research paper will be the major written requirement for the course, to be submitted no later than mid-March. The course will also include seminars by practicing professionals on a variety of development topics.", "prerequisite": {"list": ["IDSA01H3"], "str": "IDSA01H3 and students must have completed the first four years of the IDS Specialist Co-op Program or its equivalent and have completed their placement. Also, permission of the instructor is required."}, "title": "IDSD01Y3  Post-placement Seminar and Thesis ", "code": "IDSD01Y3"}}