{"JOUB17H3": {"breath_req": "Arts, Literature & Language", "description": "The basics of radio journalism. Students use digital audio recorders and handheld microphones and operate the Observer Radio News control room to produce live-to-air (via Internet) newscasts and podcasts. Stories are edited using professional digital audio software. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUA06H3", "JOUB11H3", "JOUB14H3", "JOUB18H3"], "str": "12 credits, including JOUA06H3 and JOUB11H3 and JOUB14H3 and JOUB18H3"}, "title": "JOUB17H3  Radio News ", "code": "JOUB17H3"}, "JOUC62H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "MDSA01H3", "MDSB05H3", "JOUA01H3", "JOUA02H3"], "str": "ACMB01H3 and [[MDSA01H3 and MDSB05H3] or [JOUA01H3 and JOUA02H3]]"}, "title": "JOUC62H3  Media, Journalism and the World of Work ", "exclusions": {"list": ["MDSC62H3"], "str": "MDSC62H3"}, "description": "The course explores the relationships among media, journalism, and the labour movement in contemporary Canada. It examines how labour as an issue is framed through media representations and how journalism reports on labour--what is reported, how it is reported, what isn't reported, and why. Same as MDSC62H3", "code": "JOUC62H3"}, "JOUB02H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "JOUA01H3", "JOUA02H3"], "str": "4.0 credits including ACMB01H3 and JOUA01H3 and JOUA02H3"}, "title": "JOUB02H3  Critical Journalism ", "exclusions": {"list": ["MDSB27H3"], "str": "(MDSB27H3)"}, "description": "The course examines the representation of race, gender, class and power in the media, traditional journalistic practices and newsroom culture. It will prepare students who wish to work in a media-related industry with a critical perspective towards understanding the marginalization of particular groups in the media.", "code": "JOUB02H3"}, "JOUC30H3": {"breath_req": "Arts, Literature & Language", "description": "The forms of Journalism are being challenged as reporting styles diverge and change overtime, across genres and media. New forms of narrative experimentation are opened up by the Internet and multimedia platforms. How do participatory cultures challenge journalists to experiment with media and language to create new audience experiences?", "prerequisite": {"list": ["ACMB01H3", "MDSB05H3", "JOUB39H3"], "str": "ACMB01H3 and MDSB05H3 and JOUB39H3"}, "title": "JOUC30H3  Critical Approaches to Style, Form and Narrative ", "code": "JOUC30H3"}, "JOUD12H3": {"breath_req": "Arts, Literature & Language", "description": "Journalism is a field that influences - and is influenced by - politics, finance, and civil society. This course raises contentious questions about power and responsibility at the core of journalism's role in society. Challenges to the obligations of responsible journalism are examined through changing economic pressures and ties to political cultures.", "prerequisite": {"list": ["JOUC30H3", "JOUC31H3", "JOUC62H3", "JOUC63H3"], "str": "[1.0 credit from the following: JOUC30H3, JOUC31H3, JOUC62H3, JOUC63H3]"}, "title": "JOUD12H3  Journalism at the Intersection of Politics, Economics and Ethics ", "code": "JOUD12H3"}, "JOUA06H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3", "MDSA22H3", "JOUA02H3", "MDSB26H3", "JOUB01H3", "MDSB27H3", "JOUB02H3", "HUMB11H3"], "str": "10 credits including [(MDSA21H3) or JOUA01H3], [(MDSA22H3) or JOUA02H3], [(MDSB26H3) or JOUB01H3], [(MDSB27H3) or JOUB02H3], (HUMB11H3)."}, "title": "JOUA06H3  Journalism Law and Ethics ", "exclusions": {"list": ["MDSB04H3"], "str": "(MDSB04H3)"}, "description": "An examination of the key legal and ethical issues facing Canadian journalists, with an emphasis on the practical: what a journalist needs to know to avoid legal problems and develop strategies for handling ethical challenges. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "code": "JOUA06H3"}, "JOUB39H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3", "MDSA22H3", "JOUA02H3", "HUMA01H3"], "str": "[(MDSA21H3) or JOUA01H3] and [(MDSA22H3) or JOUA02H3] and (HUMA01H3)."}, "title": "JOUB39H3  Fundamentals of Journalistic Writing ", "exclusions": {"list": ["MDSB39H3"], "str": "(MDSB39H3)"}, "description": "An overview of the standard rules and techniques of journalistic writing. The course examines the basics of good writing style including words and structures most likely to cause problems for writers. Students will develop their writing skills through assignments designed to help them conceive, develop, and produce works of journalism.", "code": "JOUB39H3"}, "JOUB18H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the basic concepts of photography and a deeper examination of the principles of photojournalism. Students create photo stories using a range of equipment (portable, battery-operated flash equipment, digital cameras, etc.) and learn how to edit images for publication, either in print or in Web form. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3", "MDSA22H3", "JOUA02H3", "MDSB26H3", "JOUB01H3", "MDSB27H3", "JOUB02H3", "HUMB11H3"], "str": "10 credits including [(MDSA21H3) or JOUA01H3], [(MDSA22H3) or JOUA02H3], [(MDSB26H3) or JOUB01H3], [(MDSB27H3) or JOUB02H3], (HUMB11H3)."}, "title": "JOUB18H3  Visual Storytelling: Photography and Video ", "code": "JOUB18H3"}, "JOUD11H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB02H3"], "str": "ACMB02H3 and [an additional 4.5 credits in MDS or JOU courses, 1.0 credit of which must be at the C-level]"}, "title": "JOUD11H3  Senior Research Seminar in Media and Journalism ", "exclusions": {"list": ["MDSD11H3"], "str": "MDSD11H3"}, "description": "Focusing on independent research, this course requires students to demonstrate the necessary analysis, research and writing skills required for advanced study. This seminar course provides the essential research skills for graduate work and other research-intensive contexts. Students will design and undertake unique and independent research about the state of journalism. Same as MDSD11H3 ", "code": "JOUD11H3"}, "JOUC31H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "JOUB24H3"], "str": "ACMB01H3 and JOUB24H3"}, "title": "JOUC31H3  Journalism, Information Sharing and Technological Change ", "exclusions": {"list": ["MDSB25H3"], "str": "MDSB25H3"}, "description": "The nexus between journalism, civic engagement and changing technologies presents opportunities and challenges for the way information is produced, consumed and shared. Topics range from citizen and networked journalism, mobile online cultures of social movements and everyday life, to the complicated promises of the internet's democratizing potential and data-based problem solving.", "code": "JOUC31H3"}, "JOUB20H3": {"breath_req": "Arts, Literature & Language", "description": "Newsgathering today requires journalists to be able to file to a number of different media platforms. This course builds on JOUB11H3 and introduces students to new production protocols appropriate for digital news media. It focuses on orienting students to the multiplatform and web-focused environment by refining reporting/writing/production skills already acquired for the special needs of digital news operations. Using a multiplatform, newsroom-in-action format, the course includes instruction in skills related to gathering, editing and uploading custom interactive content and data presentations and will outline protocols for audience interaction.This course is taught at Centennial College and is open only to students in the Specialist (Joint) program in Journalism.", "prerequisite": {"list": ["JOUA06H3", "JOUB11H3", "JOUB14H3", "JOUB18H3"], "str": "12 credits, including JOUA06H3, JOUB11H3, JOUB14H3 and JOUB18H3; students must have a minimum 2.0 CGPA to take this course."}, "title": "JOUB20H3  Interactive Journalism ", "code": "JOUB20H3"}, "JOUB11H3": {"breath_req": "Arts, Literature & Language", "description": "Practice in reporting, from a news story to feature and profile writing and coverage of the police, courts, sports, politics and Toronto City Hall. Students learn how to blog, tweet, shoot video and edit simple audio and TV news stories. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3", "MDSA22H3", "JOUA02H3", "MDSB26H3", "JOUB01H3", "MDSB27H3", "JOUB02H3", "HUMB11H3"], "str": "10 credits including [(MDSA21H3) or JOUA01H3], [(MDSA22H3) or JOUA02H3], [(MDSB26H3) or JOUB01H3], [(MDSB27H3) or JOUB02H3], (HUMB11H3)."}, "title": "JOUB11H3  News Reporting ", "code": "JOUB11H3"}, "JOUB05H3": {"breath_req": "Arts, Literature & Language", "description": "Students analyze professional interviews, critique student interviews, conduct research and interview newsmakers. This is as much a \"people\" skills course as it is a course in learning how to ask the right questions. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUA06H3", "JOUB11H3", "JOUB14H3", "JOUB18H3"], "str": "12 credits, including JOUA06H3 and JOUB11H3 and JOUB14H3 and JOUB18H3"}, "title": "JOUB05H3  Advanced Interviewing Techniques ", "code": "JOUB05H3"}, "JOUC63H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["ACMB01H3", "MDSA01H3", "MDSB05H3", "JOUA01H3", "JOUA02H3"], "str": "ACMB01H3 and [[MDSA01H3 and MDSB05H3] or [JOUA01H3 and JOUA02H3]]"}, "title": "JOUC63H3  Media Ethics ", "exclusions": {"list": ["MDSC63H3"], "str": "MDSC63H3"}, "description": "Introduces students to ethical issues in media. Students learn theoretical aspects of ethics and apply them to media industries and practices in the context of advertising, public relations, journalism, mass media entertainment, and online culture._Same as MDSC63H3", "code": "JOUC63H3"}, "JOUB24H3": {"breath_req": "Arts, Literature & Language", "description": "Journalism is undergoing a revolutionary change. Old trusted formats are falling away and young people are consuming, producing, exchanging, and absorbing news in a different way. The course will help students critically analyze new media models and give them the road map they will need to negotiate and work in New Media.", "exclusions": {"list": ["MDSB24H3"], "str": "(MDSB24H3)"}, "title": "JOUB24H3  Journalism in the Age of Digital Media ", "code": "JOUB24H3"}, "JOUA02H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3"], "str": "(MDSA21H3) or JOUA01H3"}, "title": "JOUA02H3  Introduction to Journalism II ", "exclusions": {"list": ["MDSA22H3"], "str": "(MDSA22H3)"}, "description": "A continuation of JOUA01H3.", "code": "JOUA02H3"}, "JOUC16Y3": {"breath_req": "Arts, Literature & Language", "description": "Advanced experience on \"The Observer\", an online and printed news publication serving East York and Scarborough. The work includes research, field reporting, writing, photography, page design, website production and social media. The workload might include evenings and weekends. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUB03H3", "JOUB05H3", "JOUB10H3", "JOUB17H3", "JOUB09H3", "JOUB20H3"], "str": "14.5 credits, including JOUB03H3 and JOUB05H3 and JOUB10H3 and JOUB17H3 and [(JOUB09H3) or JOUB20H3]"}, "title": "JOUC16Y3  News Laboratory II ", "code": "JOUC16Y3"}, "JOUB14H3": {"breath_req": "Arts, Literature & Language", "description": "This course provides an introduction to the principles of design and aims to help students develop the skills they will need to package and present news and feature content across print and digital platforms. This course is taught at Centennial College and is open only to students in the Specialist (Joint) program in Journalism.", "prerequisite": {"list": ["MDSA21H3", "JOUA01H3", "MDSA22H3", "JOUA02H3", "MDSB26H3", "JOUB01H3", "MDSB27H3", "JOUB02H3"], "str": "10 credits including [(MDSA21H3) or JOUA01H3] and [(MDSA22H3) or JOUA02H3] and [(MDSB26H3) or JOUB01H3] and [(MDSB27H3) or JOUB02H3]; students must have a minimum 2.0 CGPA to take this course."}, "title": "JOUB14H3  Multiplatform Design ", "code": "JOUB14H3"}, "JOUC13H3": {"breath_req": "Arts, Literature & Language", "description": "This is an advanced, multimedia content-driven course where students, working in groups and under faculty supervision, select a narrow topic and conduct preliminary research to prepare and present a proposal. After the approval of their proposal, students will research, write, shoot and produce a series of stories, including at least one documentary-style video, and for a final project, a website and a magazine. Students will be graded on their individual work as well as their teamwork and professionalism. This course is taught at Centennial College and is open only to students in the Specialist (Joint) program in Journalism.", "prerequisite": {"list": ["JOUB03H3", "JOUB05H3", "JOUB10H3", "JOUB17H3", "JOUB09H3", "JOUB20H3"], "str": "14.5 credits, including JOUB03H3, JOUB05H3, JOUB10H3, JOUB17H3 and [(JOUB09H3) or JOUB20H3]; students must have a minimum 2.0 CGPA to take this course."}, "title": "JOUC13H3  Entrepreneurial Project ", "code": "JOUC13H3"}, "JOUB01H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": ["ACMB01H3", "JOUA01H3", "JOUA02H3"], "str": "ACMB01H3 and JOUA01H3 and JOUA02H3"}, "title": "JOUB01H3  Covering Immigration and Transnational Issues ", "exclusions": {"list": ["MDSB26H3"], "str": "(MDSB26H3)"}, "description": "An examination of Canadian coverage of immigration and transnational issues. With the shift in Canada's demographics, media outlets are struggling to adapt to new realities. We will explore how media frame the public policy debate on immigration, multiculturalism, diaspora communities, and transnational issues which link Canada to the developing world. ", "code": "JOUB01H3"}, "JOUA01H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to the social, historical, philosophical, and practical contexts of the media. The course will examine various types of media and the role of the journalist. Students will be introduced to story forms and journalistic skills. Media coverage of current issues will be discussed.", "exclusions": {"list": ["MDSA21H3"], "str": "(MDSA21H3)"}, "title": "JOUA01H3  Introduction to Journalism I ", "code": "JOUA01H3"}, "JOUD10H3": {"breath_req": "Arts, Literature & Language", "description": "A project-oriented capstone course requiring students to demonstrate the skills and knowledge necessary for contemporary journalism. Students will create a project that will serve as part of a portfolio or as a scholarly exploration of the state of the mass media. This course is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUC13H3", "JOUC16Y3", "JOUC17H3"], "str": "JOUC13H3 and JOUC16Y3 and JOUC17H3"}, "title": "JOUD10H3  Senior Seminar in Journalism ", "code": "JOUD10H3"}, "JOUC25H3": {"breath_req": "Arts, Literature & Language", "description": "In Field Placement, students use theoretical knowledge and applied skills in professional journalistic environments. Through individual work and as team members, students create editorial content on various platforms and undertake academic research and writing assignments that require them to reflect upon issues arising from their work placement experience. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": [], "str": "Students must be in good standing and have successfully completed groups 1, 2, and 3 of the Centennial College phase of the Specialist (Joint) program in Journalism. In addition, students are required to have completed a non-credit Career Management course prior to starting their field placement."}, "title": "JOUC25H3  Field Placement ", "code": "JOUC25H3"}, "JOUB10H3": {"breath_req": "Arts, Literature & Language", "description": "Practical experience on \"The Observer\", an online and printed community news publication serving East York and Scarborough. The work includes reporting, photography, page design, website and multimedia production and social media. The work might include evenings and weekends. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUA06H3", "JOUB11H3", "JOUB14H3", "JOUB18H3"], "str": "12 credits, including JOUA06H3 & JOUB11H3 & JOUB14H3 & JOUB18H3"}, "title": "JOUB10H3  News Laboratory I ", "code": "JOUB10H3"}, "JOUB03H3": {"breath_req": "Arts, Literature & Language", "description": "An introduction to developing and selling quality magazine stories for multiplatform publication. Students learn techniques for both successful freelancing and magazine staff work. Students learn the importance of finding market niches, winning assignments, and carrying them out professionally. Assignments include producing source materials, a query letter and a feature-length story. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUA06H3", "JOUB11H3", "JOUB14H3", "JOUB18H3"], "str": "12.0 credits, including JOUA06H3 and JOUB11H3 and JOUB14H3 and JOUB18H3"}, "title": "JOUB03H3  Personal Branding and Freelancing ", "code": "JOUB03H3"}, "JOUC17H3": {"breath_req": "Arts, Literature & Language", "description": "This course focuses on advanced multiplatform video journalism. Students learn how to shoot, edit and package editorial content. Students also staff live-to-air news programs where they anchor the news, sports, weather and entertainment. This course is taught at Centennial College and is open only to students in the Journalism Joint Program.", "prerequisite": {"list": ["JOUB03H3", "JOUB05H3", "JOUB10H3", "JOUB17H3", "JOUB09H3", "JOUB20H3"], "str": "14.5 credits, including JOUB03H3 and JOUB05H3 and JOUB10H3 and JOUB17H3 and [(JOUB09H3) or JOUB20H3]"}, "title": "JOUC17H3  Television News ", "code": "JOUC17H3"}}