{"ECTB60H3": {"title": "ECTB60H3  Food, Cultures and Translation ", "code": "ECTB60H3", "description": "From wheat to seafood, Canada's food exports to China are increasing and Chinese food is popular in Canada. This course explores food, cultures, and translation using materials in Chinese and English. It gives text analysis in translation and hands-on translation experience from English to Chinese and/or from Chinese into English.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGB60H3", "list": ["LGGB60H3"]}}, "ECTB61H3": {"title": "ECTB61H3  English to Chinese Translation: Theory and Practice ", "code": "ECTB61H3", "description": "An introduction to the major concepts and theories of translation and a survey of English/Chinese translation in history. It discusses linguistic, cognitive, socio-political, and cultural aspects of translation. Through analysis and application of translation theory, students practice the art of translation and develop awareness of issues that translators face.", "breath_req": "Arts, Literature & Language"}, "ECTC61H3": {"title": "ECTC61H3  Translation Studies in Literature ", "code": "ECTC61H3", "description": "This course focuses on the principles and techniques of literary translation from English to Chinese and vice versa. Students will study various translations and practice translating the works of Canadian writers such as those by Alice Munro and Margaret Atwood. Style and technique will be stressed throughout the course.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "ECTB61H3", "list": ["ECTB61H3"]}}, "ECTD68H3": {"title": "ECTD68H3  Translation for Business and Media ", "code": "ECTD68H3", "description": "Guided by translation theories and techniques, students learn the lexicon, structure, and style used in business and media discourse and gain hands-on experience in translating real-life documents regarding business and media for large Chinese communities within Canada.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "ECTB61H3 and [LGGC64H3 or LGGC65H3 or LGGC66H3 or LGGC67H3]. Students must have a minimum GPA of 70% in LGGC64H or LGGC65H (or an equivalent through an interview).", "list": ["ECTB61H3", "LGGC64H3", "LGGC65H3", "LGGC66H3", "LGGC67H3"]}}, "ECTD69H3": {"title": "ECTD69H3  Translation for Government and Public Administration ", "code": "ECTD69H3", "description": "This course covers the English/Chinese translation of documents used in government, public administration, and publicly-funded organizations. It introduces the terminologies and special strategies used to translate official documents. Examples of relevant documents will be translated as part of the course work.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "ECTB61H3 and [LGGC64H3 or LGGC65H3 or LGGC66H3 or LGGC67H3]. Students must have a minimum GPA of 70% in LGGC64H or LGGC65H (or an equivalent through an interview).", "list": ["ECTB61H3", "LGGC64H3", "LGGC65H3", "LGGC66H3", "LGGC67H3"]}}, "LGGA60H3": {"title": "LGGA60H3  Introductory Mandarin I ", "code": "LGGA60H3", "description": "A comprehensive introduction to Mandarin as a foreign language for students with no previous knowledge of any aspect of any Chinese dialect. This course emphasizes integrated practical Chinese instruction in listening, speaking, reading, writing (from characters to compositions) and translation (from Chinese into English and from English into Chinese).", "exclusions": [], "breath_req": "Arts, Literature & Language"}, "LGGA61H3": {"title": "LGGA61H3  Introductory Mandarin II ", "code": "LGGA61H3", "description": "A continuation of LGGA60H3. This course will build on the skills learned in LGGA60H3.", "exclusions": ["LGGA60H3", "LGGA01H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGA60H3 or (LGGA01H3)", "list": ["LGGA60H3", "LGGA01H3"]}}, "LGGA70H3": {"title": "LGGA70H3  Introductory Hindi I ", "code": "LGGA70H3", "description": "An elementary course for students with no knowledge of Hindi. Students learn the Devanagari script and the Hindi sound system in order to start reading and writing in Hindi. The course also develops listening and speaking skills through culturally-based materials. Course materials are enhanced by audio-visual and computer-based activities.", "exclusions": ["HIN212Y", "NEW212Y", "LGGB70H3", "LGGB71H3"], "breath_req": "Arts, Literature & Language"}, "LGGA71H3": {"title": "LGGA71H3  Introductory Hindi II ", "code": "LGGA71H3", "description": "A continuation of LGGA70H3.", "exclusions": ["HIN212Y", "NEW212Y", "LGGA70H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGA70H3", "list": ["LGGA70H3"]}}, "LGGA74H3": {"title": "LGGA74H3  Introductory Tamil I ", "code": "LGGA74H3", "description": "An elementary course for students with minimal or no knowledge of Tamil. Students learn the Tamil script and sound system. The course also develops listening and speaking skills through culturally-based materials. Course materials are enhanced by audio-visual and computer-based activities.", "exclusions": ["NEW213Y"], "breath_req": "Arts, Literature & Language"}, "LGGA75H3": {"title": "LGGA75H3  Introductory Tamil II ", "code": "LGGA75H3", "description": "A continuation of LGGA74H3.", "exclusions": ["NEW213Y", "LGGA74H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGA74H3", "list": ["LGGA74H3"]}}, "LGGA80H3": {"title": "LGGA80H3  Introductory Japanese I ", "code": "LGGA80H3", "description": "A beginning course for those with minimal or no knowledge of Japanese. The course builds proficiency in both language and culture. Language practice includes oral skills for simple daily conversation; students will be introduced to the Japanese writing systems and learn to read and write simple passages.", "exclusions": ["EAS120Y"], "breath_req": "Arts, Literature & Language"}, "LGGA81H3": {"title": "LGGA81H3  Introductory Japanese II ", "code": "LGGA81H3", "description": "Continuation of Introductory Japanese I.", "exclusions": ["EAS120Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGA80H3", "list": ["LGGA80H3"]}}, "LGGB60H3": {"title": "LGGB60H3  Intermediate Mandarin I ", "code": "LGGB60H3", "description": "This course will develop listening, speaking, reading, and writing skills in Mandarin. Writing tasks will help students to progress from characters to compositions and will include translation from Mandarin to English and vice versa. The course is not open to students who have more than the rudiments of Mandarin.", "exclusions": [], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGA61H3 or (LGGA02H3)", "list": ["LGGA61H3", "LGGA02H3"]}}, "LGGB61H3": {"title": "LGGB61H3  Intermediate Mandarin II ", "code": "LGGB61H3", "description": "A continuation of LGGB60H3.", "exclusions": ["LGGB60H3", "LGGB64H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGB60H3 or LGGB64H3", "list": ["LGGB60H3", "LGGB64H3"]}}, "LGGB62H3": {"title": "LGGB62H3  Intermediate Mandarin for Heritage Students I ", "code": "LGGB62H3", "description": "This course will further improve the literacy skills of heritage students by studying more linguistically sophisticated and topically extensive texts. Those who have not studied pinyin, the Mandarin pronunciation tool, but know about 600-800 complex or simplified Chinese characters should take this course instead of courses LGGB64H3 and LGGB65H3.", "exclusions": [], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "(LGGA63H3)", "list": ["LGGA63H3"]}}, "LGGB63H3": {"title": "LGGB63H3  Intermediate Mandarin for Heritage Students II ", "code": "LGGB63H3", "description": "A continuation of LGGB62H3.", "exclusions": ["LGGB62H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGB62H3", "list": ["LGGB62H3"]}}, "LGGB64H3": {"title": "LGGB64H3  Mandarin I for Students with Prior Background ", "code": "LGGB64H3", "description": "An introduction to Mandarin for students who speak some Chinese (any dialect) because of their family backgrounds but have minimal or no literacy skills in the language. Emphasis is placed on Mandarin phonetics and literacy through reading, writing and translation (English to Chinese & Chinese to English).", "exclusions": ["LGGA62H3"], "breath_req": "Arts, Literature & Language"}, "LGGB65H3": {"title": "LGGB65H3  Mandarin II for Students with Prior Background ", "code": "LGGB65H3", "description": "A continuation of LGGB64H3.", "exclusions": ["LGGA63H3", "LGGB64H3", "LGGA62H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGB64H3 or (LGGA62H3)", "list": ["LGGB64H3", "LGGA62H3"]}}, "LGGB70H3": {"title": "LGGB70H3  Hindi I for Students with Prior Background ", "code": "LGGB70H3", "description": "Develops language and literacy through the study of Hindi cinema, music and dance along with an introduction to theatrical and storytelling traditions. The course enhances acquisition of cultural competence in Hindi with composition and conversation, complemented by culture-based material, film and other media.", "exclusions": [], "breath_req": "Arts, Literature & Language"}, "LGGB71H3": {"title": "LGGB71H3  Hindi II for Students with Prior Background ", "code": "LGGB71H3", "description": "Continuation of LGGB70H3.", "exclusions": [], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGB70H3", "list": ["LGGB70H3"]}}, "LGGB74H3": {"title": "LGGB74H3  Intermediate Tamil ", "code": "LGGB74H3", "description": "Tamil language taught through culture for students with heritage language skills or prior formal study. The cultures of South India, Sri Lanka and diaspora populations will be studied to build literacy skills in the Tamil script as well as further development of speaking and listening skills.", "exclusions": [], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGA75H3", "list": ["LGGA75H3"]}}, "LGGC60H3": {"title": "LGGC60H3  Advanced Mandarin I ", "code": "LGGC60H3", "description": "This course develops all four language skills (speaking, listening, reading, and writing), with special attention to idiomatic expressions. Through a variety of texts and interactive materials, students will be introduced to aspects of Chinese life and culture.", "exclusions": ["LGGC62H3", "CHI100Y", "CHI200Y", "EAS100Y", "EAS200Y"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGB61H3 or (LGGB04H3)", "list": ["LGGB61H3", "LGGB04H3"]}}, "LGGC61H3": {"title": "LGGC61H3  Advanced Mandarin II ", "code": "LGGC61H3", "description": "A continuation of LGGC60H3.", "exclusions": ["LGGC62H3", "EAS100Y", "EAS200Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGC60H3", "list": ["LGGC60H3"]}}, "LGGC62H3": {"title": "LGGC62H3  Advanced Mandarin: Culture in the East and West ", "code": "LGGC62H3", "description": "Develops skills in spoken Mandarin and written varieties of Chinese. The course focuses on contrasts between Chinese and Western cultures. This course presents a variety of cultural and literary materials, through which students will further their language skills and learn approximately 400 new characters.", "exclusions": ["LGGB66H3", "LGGB67H3", "LGGC64H3", "LGGC65H3", "LGGC66H3", "LGGC67H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGB63H3", "list": ["LGGB63H3"]}}, "LGGC63H3": {"title": "LGGC63H3  Advanced Mandarin: Pop Culture and the State ", "code": "LGGC63H3", "description": "Develops skills in spoken Mandarin and written varieties of Chinese. The course focuses on the vision of the Chinese state presented in popular culture. This course presents a variety of text and non-text materials, through which students will further their language skills and learn approximately 400 new characters.", "exclusions": ["LGGB66H3", "LGGB67H3", "LGGC64H3", "LGGC65H3", "LGGC66H3", "LGGC67H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGB63H3", "list": ["LGGB63H3"]}}, "LGGC64H3": {"title": "LGGC64H3  Reading Chinese: China from the Inside Out ", "code": "LGGC64H3", "description": "Intended for students who are able to read everyday publications, e.g., newspapers in either complex-form characters or simple-form characters. Pinyin, complex-simplified character conversion and vice versa, and fluency are emphasized through reading and discussing advanced materials in a variety of topics from and outside of Greater China, presentations, and essay writing.", "exclusions": ["LGGB66H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "Online placement test and survey.", "list": []}}, "LGGC65H3": {"title": "LGGC65H3  Reading Chinese: Global Perspectives ", "code": "LGGC65H3", "description": "Designed for students who are able to read everyday publications, e.g., newspapers in either complex-form characters or simple-form characters. Pinyin, complex-simplified character conversion and vice versa, and fluency are emphasized through reading and discussing advanced materials in a variety of topics from global perspectives, presentations, and essay writing. This course may be taken before or after LGGC64H3.", "exclusions": ["LGGB67H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "Online placement test and survey.", "list": []}}, "LGGC66H3": {"title": "LGGC66H3  Classical Chinese ", "code": "LGGC66H3", "description": "This course will examine pre-Qin Chinese classics such as the Book of Documents, the Analects of Confucius, the Mencius, the Dao De Jing, the Art of War, and some other philosophical maxims, proverbial sayings, rhyming couplets, idioms and poems that still have much impact on Chinese language and culture today.", "exclusions": ["EAS358Y", "EAS206Y", "EAS306Y"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LGGC64H3 or LGGC65H3", "list": ["LGGC64H3", "LGGC65H3"]}}, "LGGC67H3": {"title": "LGGC67H3  Literary Chinese ", "code": "LGGC67H3", "description": "This course will examine representative literary Chinese texts in Imperial China up to the early 20th century. They include prose of many dynasties, poetry of Tang (618-907) and Song (960-1297), and other genres in literary Chinese that are still very much alive in Chinese language and society today.", "exclusions": ["EAS358Y", "EAS206Y", "EAS306Y"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LGGC64H3 or LGGC65H3", "list": ["LGGC64H3", "LGGC65H3"]}}, "LGGC70H3": {"title": "LGGC70H3  Advanced Hindi: From Hindustan to Modern India ", "code": "LGGC70H3", "description": "Advanced language learning through an introduction to the historical development of the Hindi language. Students develop language skills through the study of educational structure, and literary and cultural institutions in colonial and postcolonial India. The course studies a variety of texts and media and integrates composition and conversation.", "exclusions": [], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "[LGGB70H3 and LGGB71H3]", "list": ["LGGB70H3", "LGGB71H3"]}}, "LINA01H3": {"title": "LINA01H3  Introduction to Linguistics ", "code": "LINA01H3", "description": "An introduction to the various methods and theories of analyzing speech sounds, words, sentences and meanings, both in particular languages and language in general.", "exclusions": ["LIN100Y", "LIN101H", "LIN102H"], "breath_req": "Arts, Literature & Language"}, "LINA02H3": {"title": "LINA02H3  Applications of Linguistics ", "code": "LINA02H3", "description": "Application of the concepts and methods acquired in LINA01H3 to the study of, and research into, language history and language change; the acquisition of languages; language disorders; the psychology of language; language and in the brain; and the sociology of language.", "exclusions": ["LIN100Y", "LIN101H", "LIN102H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINA01H3", "list": ["LINA01H3"]}}, "LINB04H3": {"title": "LINB04H3  Phonology I ", "code": "LINB04H3", "description": "Practice in analysis of sound patterns in a broad variety of languages.", "exclusions": ["LIN229H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB09H3", "list": ["LINB09H3"]}}, "LINB06H3": {"title": "LINB06H3  Syntax I ", "code": "LINB06H3", "description": "Practice in analysis of sentence structure in a broad variety of languages.", "exclusions": ["LIN232H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINA01H3", "list": ["LINA01H3"]}}, "LINB09H3": {"title": "LINB09H3  Phonetics: The Study of Speech Sounds ", "code": "LINB09H3", "description": "An examination of physiological and acoustic bases of speech.", "exclusions": ["LIN228H"], "breath_req": "Natural Sciences", "prerequisite": {"str": "LINA01H3", "list": ["LINA01H3"]}}, "LINB10H3": {"title": "LINB10H3  Morphology ", "code": "LINB10H3", "description": "Core issues in morphological theory, including properties of the lexicon and combinatorial principles, governing word formation as they apply to French and English words.", "exclusions": ["LIN231H", "LIN333H", "LINB05H3", "LINC05H3", "FRE387H", "FREC45H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINA01H3", "list": ["LINA01H3"]}}, "LINB13H3": {"title": "LINB13H3  Language Diversity and Language Universals ", "code": "LINB13H3", "description": "An introduction to linguistic typology with special emphasis on cross-linguistic variation and uniformity in morphology and syntax.", "exclusions": ["LIN306H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB04H3", "list": ["LINB04H3"]}}, "LINB18H3": {"title": "LINB18H3  English Grammar ", "code": "LINB18H3", "description": "Description and analysis of the structure of English, including the sentence and word structure systems, with emphasis on those distinctive and characteristic features most of interest to teachers and students of the language.", "exclusions": ["LIN204H"], "breath_req": "Arts, Literature & Language"}, "LINB19H3": {"title": "LINB19H3  Computers in Linguistics ", "code": "LINB19H3", "description": "The course will provide an introduction to the use of computer theory and methods to advance the understanding of computational aspects of linguistics. It will provide basic training in computer programming techniques employed in linguistics such as corpus mining, modifying speech stimuli, experimental testing, and data analysis.", "exclusions": ["CSCA20H3", "PSYC03H3"], "breath_req": "Quantitative Reasoning", "prerequisite": {"str": "LINA02H3", "list": ["LINA02H3"]}}, "LINB20H3": {"title": "LINB20H3  Sociolinguistics ", "code": "LINB20H3", "description": "The study of the relationship between language and society. Topics include: how language reflects and constructs aspects of social identity such as age, gender, socioeconomic class and ethnicity; ways in which social context affects speakers' use of language; and social factors which cause the spread or death of languages.", "exclusions": ["LINB21H3", "LINB22H3", "LIN251H", "LIN256H", "FREC48H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "LINA02H3", "list": ["LINA02H3"]}}, "LINB29H3": {"title": "LINB29H3  Quantitative Methods in Linguistics ", "code": "LINB29H3", "description": "An introduction to experimental design and statistical analysis for linguists. Topics include both univariate and multivariate approaches to data analysis for acoustic phonetics, speech perception, psycholinguistics, language acquisition, language disorders, and sociolinguistics.", "exclusions": ["LIN305H", "PLIC65H3", "PSYB07H3", "STAB23H3"], "breath_req": "Quantitative Reasoning", "prerequisite": {"str": "LINA02H3", "list": ["LINA02H3"]}}, "LINB60H3": {"title": "LINB60H3  Structure of Chinese ", "code": "LINB60H3", "description": "An introduction to the phonetics, morphology, syntax, semantics, discourse and various writing styles in the Chinese language. Students will use the tools of linguistic analysis learned in prior courses to examine the structural and related key properties of Chinese.", "exclusions": ["LINC60H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB06H3", "list": ["LINB06H3"]}}, "LINB62H3": {"title": "LINB62H3  Structure of American Sign Language ", "code": "LINB62H3", "description": "An introduction to the structure of American Sign Language (ASL): Comparison to spoken languages and other signed languages, together with practice in using ASL for basic communication.", "exclusions": ["LINA10H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINA01H3 and LINA02H3", "list": ["LINA01H3", "LINA02H3"]}}, "LINC02H3": {"title": "LINC02H3  Phonology II ", "code": "LINC02H3", "description": "Basic issues in phonological theory. This course assumes familiarity with phonetic principles, as discussed in LINB09H3, and with phonological problem-solving methods, as discussed in LINB04H3.", "exclusions": ["LIN322H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB04H3 and LINB09H3", "list": ["LINB04H3", "LINB09H3"]}}, "LINC11H3": {"title": "LINC11H3  Syntax II ", "code": "LINC11H3", "description": "Core issues in syntactic theory, with emphasis on universal principles and syntactic variation between French and English.Same as FREC46H3", "exclusions": ["LIN232H", "LIN331H", "FRE378H", "FREC46H3"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB06H3 or FREB45H3", "list": ["LINB06H3", "FREB45H3"]}}, "LINC12H3": {"title": "LINC12H3  Semantics: The Study of Meaning ", "code": "LINC12H3", "description": "An introduction to the role of meaning in the structure, function, and use of language. Approaches to the notion of meaning as applied to English and French data will be examined.  Same as FREC12H3.", "exclusions": ["FREC12H3", "FRE386H", "LIN241H", "LIN247H", "LIN341H", "FREC49H3", "FRED49H3"], "breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"str": "LINA01H3 or [FREB44H3 and FREB45H3]", "list": ["LINA01H3", "FREB44H3", "FREB45H3"]}}, "LINC28H3": {"title": "LINC28H3  Language and Gender ", "code": "LINC28H3", "description": "An introduction to the research on differences between women and men in how they use language and how they behave in conversational interaction, together with an examination of the role of language in reflecting and perpetuating cultural attitudes towards gender. Same as WSTC28H3 ", "exclusions": ["JAL355H", "WSTC28H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "LINA01H3 and one full credit at the B-level in ANT, LIN, SOC or WST", "list": ["LINA01H3"]}}, "LINC47H3": {"title": "LINC47H3  Pidgin and Creole Languages ", "code": "LINC47H3", "description": "A study of pidgin and Creole languages worldwide. The course will introduce students to the often complex grammars of these languages and examine French, English, Spanish, and Dutch-based Creoles, as well as regional varieties. It will include some socio-historical discussion. Same as FREC47H3.", "exclusions": ["FREC47H3", "LIN366H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "[LINA01H3 and LINA02H3] or [FREB44H3 and FREB45H3]", "list": ["LINA01H3", "LINA02H3", "FREB44H3", "FREB45H3"]}}, "LINC61H3": {"title": "LINC61H3  Structure of a Language ", "code": "LINC61H3", "description": "An introduction to the phonetics, phonology, word-formation rules, syntax, and script of a featured language other than English or French. Students will use the tools of linguistic analysis learned in prior courses to examine the structural properties of this language. No prior knowledge of the language is necessary.", "exclusions": ["LIN409H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB04H3 and LINB06H3", "list": ["LINB04H3", "LINB06H3"]}}, "LIND01H3": {"title": "LIND01H3  Independent Study in Linguistics ", "code": "LIND01H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Linguistics for further information.", "prerequisite": {"str": "At least 1.0 credit at the C-level in LIN  courses and permission of the supervising instructor.", "list": []}}, "LIND02H3": {"title": "LIND02H3  Independent Study in Linguistics ", "code": "LIND02H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Linguistics for further information.", "prerequisite": {"str": "At least 1.0 credit at the C-level in LIN courses and permission of the supervising instructor.", "list": []}}, "LIND03H3": {"title": "LIND03H3  Independent Study in Linguistics ", "code": "LIND03H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Program Supervisor for Linguistics.", "prerequisite": {"str": "At least 1.0 credit at the C-level in LIN courses and permission of the supervising instructor.", "list": []}}, "LIND07Y3": {"title": "LIND07Y3  Independent Study in Linguistics ", "code": "LIND07Y3", "description": "A reading and research independent study course on a topic of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Linguistics for further information.", "exclusions": ["LIN495Y"], "prerequisite": {"str": "At least 1.0 credit at the C-level in LIN courses and permission of the supervising instructor", "list": []}}, "LIND09H3": {"title": "LIND09H3  Phonetic Analysis ", "code": "LIND09H3", "description": "Practical application of phonetic theory with special emphasis on instrumental and experimental techniques.", "exclusions": ["LIN423H", "LINC09H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "LINB09H3 and LINB29H3", "list": ["LINB09H3", "LINB29H3"]}}, "LIND29H3": {"title": "LIND29H3  Linguistic Research Methodologies ", "code": "LIND29H3", "description": "This course focuses on research methodologies (interviews, corpus collection, surveys, ethnography, etc.). Students conduct individual research studies in real-life contexts.", "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "LINB04H3 and LINB06H3 and LINB10H3", "list": ["LINB04H3", "LINB06H3", "LINB10H3"]}}, "LIND46H3": {"title": "LIND46H3  Field Methods in Linguistics ", "code": "LIND46H3", "description": "Practice in language analysis based on elicited data from second language learners and foreign speakers. Emphasis is put on procedures and techniques of data collection, as well as theoretical implications arising from data analysis.", "exclusions": ["FRED46H3", "JAL401H"], "breath_req": "Arts, Literature & Language", "prerequisite": {"str": "[FREB44H3 and FREC46H3] or [LINC02H3 and LINC11H3]", "list": ["FREB44H3", "FREC46H3", "LINC02H3", "LINC11H3"]}}, "PLIC24H3": {"title": "PLIC24H3  First Language Acquisition ", "code": "PLIC24H3", "description": "Descriptions of children's pronunciation, vocabulary and grammar at various stages of learning their first language. Theories of the linguistic knowledge and cognitive processes that underlie and develop along with language learning. ", "exclusions": ["JLP315H"], "breath_req": "Natural Sciences", "prerequisite": {"str": "LINB04H3 or LINB06H3 or LINB09H3", "list": ["LINB04H3", "LINB06H3", "LINB09H3"]}}, "PLIC25H3": {"title": "PLIC25H3  Second Language Acquisition ", "code": "PLIC25H3", "description": "The stages adults and children go through when learning a second language. The course examines linguistic, cognitive, neurological, social, and personality variables that influence second language acquisition.", "exclusions": ["LINB25H3", "PLIB25H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "LINA01H3 and [[LINB06H3 or LINB09H3] or [FREB44H3 and FREB45H3]]", "list": ["LINA01H3", "LINB06H3", "LINB09H3", "FREB44H3", "FREB45H3"]}}, "PLIC54H3": {"title": "PLIC54H3  Speech Physiology and Speech Disorders in Children and Adults ", "code": "PLIC54H3", "description": "An introduction to the physics of sound and the physiology of speech perception and production for the purpose of assessing and treating speech disorders in children and adults. Topics will include acoustic, perceptual, kinematic, and aerodynamic methods of assessing speech disorders as well as current computer applications that facilitate assessment.", "breath_req": "Natural Sciences", "prerequisite": {"str": "LINB09H3", "list": ["LINB09H3"]}}, "PLIC55H3": {"title": "PLIC55H3  Psycholinguistics ", "code": "PLIC55H3", "description": "Experimental evidence for theories of how humans produce and understand language, and of how language is represented in the mind. Topics include speech perception, word retrieval, use of grammar in comprehension and production, discourse comprehension, and the role of memory systems in language processing.", "exclusions": ["JLP374H"], "breath_req": "Natural Sciences", "prerequisite": {"str": "LINB06H3 or LINB09H3", "list": ["LINB06H3", "LINB09H3"]}}, "PLIC75H3": {"title": "PLIC75H3  Language and the Brain ", "code": "PLIC75H3", "description": "An introduction to neurolinguistics, emphasizing aphasias and healthy individuals. We will introduce recent results understanding how the brain supports language comprehension and production. Students will be equipped with necessary tools to critically evaluate the primary literature. No prior knowledge of brain imaging is necessary.", "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "PLIC55H3", "list": ["PLIC55H3"]}}, "PLID01H3": {"title": "PLID01H3  Independent Study in Psycholinguistics ", "code": "PLID01H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Psycholinguistics for further information.", "prerequisite": {"str": "At least 1.0 credit at the C-level in PLI courses and permission of the supervising instructor.", "list": []}}, "PLID02H3": {"title": "PLID02H3  Independent Study in Psycholinguistics ", "code": "PLID02H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Psycholinguistics for further information.", "prerequisite": {"str": "At least 1.0 credit at the C-level in PLI courses and permission of the supervising instructor.", "list": []}}, "PLID03H3": {"title": "PLID03H3  Independent Study in Psycholinguistics ", "code": "PLID03H3", "description": "Independent study and research in an area of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Psycholinguistics for further information.", "prerequisite": {"str": "At least 1.0 credit at the C-level in PLI courses and permission of the supervising instructor.", "list": []}}, "PLID07Y3": {"title": "PLID07Y3  Independent Study in Psycholinguistics ", "code": "PLID07Y3", "description": "A reading and research independent study course on a topic of interest to the student. Students must obtain consent from a supervising instructor before registering. Interested students should contact the Undergraduate Assistant for Psycholinguistics for further information.", "exclusions": ["LIN495Y"], "prerequisite": {"str": "At least 1.0 credit at the C-level in PLI courses and permission of the supervising instructor", "list": []}}, "PLID34H3": {"title": "PLID34H3  The Psycholinguistics of Reading ", "code": "PLID34H3", "description": "An examination of linguistic and psycholinguistic issues pertinent to reading, as well as the role of a language's writing system and orthography in the learning process.", "exclusions": ["LINC34H3", "PLIC34H3"], "breath_req": "Natural Sciences", "prerequisite": {"str": "[LINA01H3 or [FREB44H3 and FREB45H3]] and [PLIC24H3 or (PLIB25H3)]", "list": ["LINA01H3", "FREB44H3", "FREB45H3", "PLIC24H3", "PLIB25H3"]}}, "PLID44H3": {"title": "PLID44H3  Acquisition of the Mental Lexicon ", "code": "PLID44H3", "description": "An examination of L1 (first language) and L2 (second language) lexical (vocabulary) acquisition. Topics include: the interaction between linguistic and cognitive development; the role of linguistic/non-linguistic input; the developing L2 lexicon and its links with the L1 lexicon; the interface between lexical and syntactic acquisition within psycholinguistic and linguistic frameworks.", "breath_req": "Natural Sciences", "prerequisite": {"str": "PLIC24H3", "list": ["PLIC24H3"]}}, "PLID50H3": {"title": "PLID50H3  Speech Perception ", "code": "PLID50H3", "description": "An examination of the acoustics and perception of human speech. We will explore how humans cope with the variation found in the auditory signal, how infants acquire their native language sound categories, the mechanisms underlying speech perception and how the brain encodes and represents speech sounds. An emphasis will be placed on hands-on experience with experimental data analysis.", "exclusions": ["PLIC15H3"], "breath_req": "Social & Behavioural Sciences", "prerequisite": {"str": "LINB29H3 and PLIC55H3", "list": ["LINB29H3", "PLIC55H3"]}}, "PLID56H3": {"title": "PLID56H3  Special Topics in Language Disorders in Children ", "code": "PLID56H3", "description": "An in-depth investigation of a particular type of language or communication disorder, for example, impairment due to hearing loss, Down syndrome, or autism. Topics will include: linguistic and non-linguistic differences between children with the disorder and typically-developing children; diagnostic tools and treatments for the disorder; and its genetics and neurobiology.", "breath_req": "Natural Sciences", "prerequisite": {"str": "PLIC24H3 or (PLID55H3)", "list": ["PLIC24H3", "PLID55H3"]}}, "PLID74H3": {"title": "PLID74H3  Language and Aging ", "code": "PLID74H3", "description": "A seminar-style course on language and communication in healthy and language-impaired older adults. The course covers normal age-related neurological, cognitive, and perceptual changes impacting language, as well as language impairments resulting from dementia, strokes, etc. Also discussed are the positive aspects of aging, bilingualism, ecologically valid experimentation, and clinical interventions. ", "breath_req": "Natural Sciences", "prerequisite": {"str": "PLIC24H3 and PLIC55H3", "list": ["PLIC24H3", "PLIC55H3"]}}}