{"POLC54H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3"], "str": "POLB50Y3 or equivalent"}, "title": "POLC54H3  Intergovernmental Relations in Canada ", "exclusions": {"list": ["POL316Y"], "str": "POL316Y"}, "description": "This course examines relations between provincial and federal governments in Canada, and how they have been shaped by the nature of Canada's society and economy, judicial review, constitutional amendment, and regionalisation and globalization. The legitimacy and performance of the federal system are appraised. Lecture-seminar format.Areas of Focus: Canadian Government and Politics; Public Policy", "code": "POLC54H3"}, "PPGD64H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3", "POLB92H3", "POLB93H3"], "str": "[[POLB50Y3 or equivalent] or [POLB92H3 and (POLB93H3)]] and [1.5 credits at the C-level in POL courses]"}, "title": "PPGD64H3  Comparative Public Policy ", "exclusions": {"list": ["POLD64H3"], "str": "(POLD64H3)"}, "description": "This seminar course explores some of the major theoretical approaches to the comparative analysis of public policies across countries. The course explores factors that influence a country's policy making process and why countries' policies diverge or converge. Empirically, the course examines several contemporary issue areas, such as economic, social or environmental policies.\nAreas of Focus: Comparative Politics; Public Policy", "code": "PPGD64H3"}, "POLD41H3": {"description": "Topics and Area of Focus will vary depending on the instructor.", "prerequisite": {"list": [], "str": "1.5 credits at the C-level in POL courses"}, "exclusions": {"list": ["POLC41H3"], "str": "(POLC41H3)"}, "title": "POLD41H3  Advanced Topics in Politics ", "code": "POLD41H3"}, "PSYC37H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB32H3"], "str": "PSYB32H3"}, "title": "PSYC37H3  Psychological Assessment ", "exclusions": {"list": ["PSY330H"], "str": "PSY330H"}, "description": "This course deals with conceptual issues and practical problems of identification, assessment, and treatment of mental disorders and their psychological symptomatology. Students have the opportunity to familiarize themselves with the psychological tests and the normative data used in mental health assessments. Lectures and demonstrations on test administration and interpretation will be provided.", "code": "PSYC37H3"}, "PSYD22H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYB20H3"], "str": "PSYB10H3 and PSYB20H3 plus one C-level half-credit in PSY"}, "title": "PSYD22H3  Socialization Processes ", "exclusions": {"list": ["PSY311H", "PSY410H"], "str": "PSY311H, PSY410H"}, "description": "The processes by which an individual becomes a member of a particular social system (or systems). The course examines both the content of socialization (e.g., development of specific social behaviours) and the context in which it occurs (e.g., family, peer group, etc.). Material will be drawn from both social and developmental psychology.", "code": "PSYD22H3"}, "PHLD97H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD97H3  Independent Study ", "code": "PHLD97H3"}, "POLC53H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the ideas and success of the environmental movement in Canada. The course focuses on how environmental policy in Canada is shaped by the ideas of environmentalists, economic and political interests, public opinion, and Canada's political-institutional framework. Combined lecture-seminar format.Areas of Focus: Canadian Government and Politics; Public Policy", "prerequisite": {"list": ["POLB50Y3", "ESTB01H3"], "str": "[POLB50Y3 or equivalent] or ESTB01H3 or [1.5 credits at the B-level in CIT courses]"}, "title": "POLC53H3  Canadian Environmental Policy ", "code": "POLC53H3"}, "POLC56H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3"], "str": "POLB50Y3 or equivalent"}, "title": "POLC56H3  Indigenous Politics ", "exclusions": {"list": ["POL308H", "ABS353H", "ABS354H"], "str": "POL308H, ABS353H, ABS354H"}, "description": "This course explores key historical and contemporary issues in indigenous politics. Focusing on the contemporary political mobilization of Indigenous peoples, it will examine their pursuit of self-government, land claims and resource development, treaty negotiations and indigenous rights. A primary focus will be the role of Canadas courts, its political institutions, and federal and provincial political leaders in affecting the capacity of indigenous communities to realize their goals.\nArea of Focus: Canadian Government and Politics", "code": "POLC56H3"}, "PSYB01H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course surveys the basic research techniques and designs used in the diverse field of psychological research, both in experimental and non-experimental areas. The topics range from the general principles of scientific research to concrete design issues, from sampling techniques to the typical problems faced when interpreting data.", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB01H3  Psychological Research Laboratory ", "code": "PSYB01H3"}, "PHLC43H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PHLB50H3"], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, including PHLB50H3 and 0.5 credit from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference] "}, "title": "PHLC43H3  History of Analytic Philosophy ", "exclusions": {"list": ["PHL325H"], "str": "PHL325H"}, "description": "This course explores the foundation of Analytic Philosophy in the late 19th and early 20th century, concentrating on Frege, Russell, and Moore. Special attention paid to the discovery of mathematical logic, its motivations from and consequences for metaphysics and the philosophy of mind.", "code": "PHLC43H3"}, "PSYC13H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYB57H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYB10H3 or PSYB57H3] and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC13H3  Social Cognition: Understanding Ourselves and Others ", "exclusions": {"list": ["PSY326H", "PSY473H", "PSY417H"], "str": "PSY326H, PSY473H, PSY417H"}, "description": "A comprehensive survey of how cognitive processes (e.g., perception, memory, judgment) influence social behaviour. Topics include the construction of knowledge about self and others, attitude formation and change, influences of automatic and controlled processing, biases in judgment and choice, interactions between thought and emotion, and neural specializations for social cognition.", "code": "PSYC13H3"}, "PHLD05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PHLC05H3", "PHLC06H3"], "str": "3.5 credits in PHL courses, including [[PHLC05H3 or PHLC06H3] and 0.5 credit at the C-level]"}, "title": "PHLD05H3  Advanced Seminar in Ethics ", "exclusions": {"list": ["PHL407H", "PHL475H"], "str": "PHL407H, PHL475H"}, "description": "This course offers an in-depth investigation into selected topics in moral philosophy.", "code": "PHLD05H3"}, "PHYC11H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYB10H3", "PHYB21H3", "PHYB52H3"], "str": "PHYB10H3, PHYB21H3, PHYB52H3"}, "title": "PHYC11H3  Intermediate Physics Laboratory II ", "exclusions": {"list": ["PHYB11H3"], "str": "(PHYB11H3)"}, "description": "The main objective of this course is to help students develop skills in experimental physics by introducing them to a range of important measuring techniques and associated physical phenomena. Students will carry on several experiments in Physics and Astrophysics including electricity and magnetism, optics, solid state physics, atomic and nuclear physics.", "code": "PHYC11H3"}, "POLC39H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores some of the key aspects and issues of public law in modern, democratic systems of government from a comparative perspective. It does this by reviewing and applying theory and empirical analysis to a number of cases to explore five key issues: the institutional separation of power, the structure of the judiciary, the mechanisms (or lack thereof) to distribute power and resources between groups/territories, the mechanisms (or lack thereof) to protect individual and group rights, and how/if the constitutional order can be changed/amended. Cases considered will include: Canada, UK, Spain, Germany, Australia, America, India and South Africa.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB30H3"], "str": "POLB30H3"}, "title": "POLC39H3  Comparative Legal Systems ", "code": "POLC39H3"}, "PSYC33H3": {"breath_req": "Natural Sciences", "description": "An examination of the therapeutic methods used to improve the capacity of a brain damaged individual to process and use incoming information, enhancing functioning in everyday life. Students will be introduced to methods that aim to restore cognitive function by compensatory techniques. Neuropsychological rehabilitation problems caused by deficits in attention, visual processing, language, memory, reasoning/problem solving, and executive functioning will be stressed. Lectures and demonstrations. Students in the Specialist (Co-operative) Program in Mental Health Studies will have priority for entry to the course.", "prerequisite": {"list": ["PSYC31H3", "PSYC32H3", "PSYB57H3"], "str": "[PSYC31H3 or PSYC32H3] and PSYB57H3"}, "title": "PSYC33H3  Neuropsychological Rehabilitation ", "code": "PSYC33H3"}, "PHLC08H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This is an advanced, reading and discussion intensive course in the history of Arabic and Jewish thought, beginning with highly influential medieval thinkers such as Avicenna (Ibn Sn), al-Ghazl, Al Frb, Averroes (Ibn Rushd), and Maimonides, and ending with 20th century philosophers (among them Arendt, Freud and Levinas).", "prerequisite": {"list": [], "str": "Any 4.5 credits and [and additional 1.5 credits in PHL courses, of which 0.5 credit must be from the History of Philosophy area of focus  see Table 1.0 for reference] "}, "title": "PHLC08H3  Topics in Arabic and Jewish Philosophy ", "code": "PHLC08H3"}, "PMDC43H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Applies concepts and principles from pharmacology, patho-physiology and pre-hospital care to make decisions and implementation of controlled or delegated medical acts for increasingly difficult case scenarios in a class and lab setting. Ethics and legal implications/responsibilities of actions will be integrated throughout the content. Patient care and monitoring of intravenous fluid administration. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB30H3", "PMDB32Y3", "PMDB36H3", "BIOB11H3"], "str": "PMDB30H3 and PMDB32Y3 and PMDB36H3 and BIOB11H3"}, "title": "PMDC43H3  Medical Directed Therapeutics and Paramedic Responsibilities ", "code": "PMDC43H3"}, "PSYC23H3": {"breath_req": "Natural Sciences", "description": "A review of the interplay of psychosocial and biological processes in the development of stress and emotion regulation. Theory and research on infant attachment, mutual regulation, gender differences in emotionality, neurobiology of the parent-infant relationship, and the impact of socialization and parenting on the development of infant stress and emotion.", "prerequisite": {"list": ["PSYB20H3"], "str": "PSYB20H3"}, "title": "PSYC23H3  Developmental Psychobiology ", "code": "PSYC23H3"}, "PSYB07H3": {"breath_req": "Quantitative Reasoning", "description": "This course focuses on the fundamentals of the theory and the application of statistical procedures used in research in the field of psychology. Topics will range from descriptive statistics to simple tests of significance, such as Chi-Square, t-tests, and one-way Analysis-of-Variance. A working knowledge of algebra is assumed. Students in the Specialist programs in Psychology, Psycholinguistics or Neuroscience will be given priority for this course.", "exclusions": {"list": ["ANTC35H3", "MGEB11H3", "ECMB11H3", "MGEB12H3", "ECMB12H3", "PSY201H", "SOCB06H3", "STAB22H3", "STAB52H3", "STA220H", "STA221H", "STA250H", "STA257H"], "str": "ANTC35H3, MGEB11H3/(ECMB11H3), MGEB12H3/(ECMB12H3), PSY201H, (SOCB06H3), STAB22H3, STAB52H3, STA220H, STA221H, STA250H, STA257H"}, "title": "PSYB07H3  Data Analysis in Psychology ", "code": "PSYB07H3"}, "POLD55H3": {"breath_req": "Social & Behavioural Sciences", "description": "This seminar provides an in-depth examination of the politics of inequality in Canada, and the role of the Canadian political-institutional framework in contributing to political, social and economic (in)equality. The focus will be on diagnosing how Canadas political institutions variously impede and promote equitable treatment of different groups of Canadians (such as First Nations, women, racial and minority groups) and the feasibility of possible institutional and policy reforms to promote goals of social and economic equity. Area of Focus: Canadian Government and Politics", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] and [1.5 credits at the C-level in POL courses]"}, "title": "POLD55H3  The Politics of Equality and Inequality in Canada ", "code": "POLD55H3"}, "PSYB21H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Enrolment in CTEP"}, "title": "PSYB21H3  Introduction to Developmental Psychology: Focus on Education ", "exclusions": {"list": ["CTE100H", "PSYB20H3", "PSY210H"], "str": "CTE100H, PSYB20H3, PSY210H"}, "description": "Child and adolescent development in education. This course presents students with a broad and integrative overview of child development as it pertains to education. Topics are organized chronologically beginning with prenatal development and continuing through selected issues in adolescence and life-span development. In addition to the lecture component, students will complete a field placement in which they observe children's behaviour and think critically about development. (Note: course includes 12-20 hours of field placements)", "code": "PSYB21H3"}, "POLB92H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the origins of modern political institutions in Europe through an examination of revolutions, democracy, and authoritarianism in Europe since 1789. Specific case studies include the French Revolution, democratization in Britain and Spain, the Russian Revolution and the rise of the Nazis in Germany.Area of Focus: Comparative Politics", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLB92H3  Comparative Politics: Revolution, Democracy and Authoritarianism ", "code": "POLB92H3"}, "PHLB05H3": {"breath_req": "Social & Behavioural Sciences", "description": "An examination of contemporary or historical issues that force us to consider and articulate our values and commitments. The course will select issues from a range of possible topics, which may include globalization, medical ethics, war and terrorism, the role of government in a free society, equality and discrimination.", "title": "PHLB05H3  Social Issues ", "code": "PHLB05H3"}, "PSYD14H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYC12H3", "PSYC13H3", "PSYC14H3"], "str": "PSYB10H3 and [PSYC12H3 or PSYC13H3 or PSYC14H3]"}, "title": "PSYD14H3  Psychology of Morality ", "exclusions": {"list": ["PSYD15H3"], "str": "PSYD15H3 (if taken in Fall 2015)"}, "description": "This course provides an in-depth introduction to the field of moral psychology. In recent years there has been a resurgence of interest in the science of human morality; the goalof this course is to offer an introduction to the research in this field. The course will incorporate perspectives from a variety of disciplines including philosophy, animal behaviour, neuroscience, economics, and almost every area of scientific psychology (social psychology, developmental psychology, evolutionary psychology, and cognitive psychology). By the end of the course students will be well versed in the primary issues and debates involved in the scientific study of morality.", "code": "PSYD14H3"}, "POLD91H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines contentious politics from a comparative perspective, beginning with the foundational theories of Charles Tilly, Sidney Tarrow, and Doug McAdam. It explores questions such as why people protest, how they organize, and the outcomes of contention. The second half of the course challenges students to examine popular contention across a range of states in Asia, the Middle East, Europe, and Latin America. It asks students to interrogate the applicability of the dynamics of contention framework to illiberal states in a comparative context. Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "[POLB90H3 and POLB91H3] and [an additional 2.0 credits at the C-level in any courses]"}, "title": "POLD91H3  Comparative Perspectives on Contentious Politics ", "code": "POLD91H3"}, "PHLB09H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course is an examination of moral and legal problems in medical practice, in biomedical research, and in the development of health policy. Topics may include: concepts of health and disease, patients' rights, informed consent, allocation of scarce resources, euthanasia, risks and benefits in research and others.", "exclusions": {"list": ["PHL281H", "PHL281Y"], "str": "PHL281H, (PHL281Y)"}, "title": "PHLB09H3  Biomedical Ethics ", "code": "PHLB09H3"}, "PMDB25H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Focuses on the utilization of effective communication tools when dealing with persons facing health crisis. Students will learn about coping mechanisms utilized by patients and families, and the effects of death and dying on the individual and significant others. Students will have the opportunity to visit or examine community services and do class presentations. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "PMDB25H3  Therapeutic Communications and Crisis Intervention ", "code": "PMDB25H3"}, "PSYC31H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYB32H3", "PSYB65H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and PSYB32H3 and PSYB65H3"}, "title": "PSYC31H3  Clinical Neuropsychology ", "exclusions": {"list": ["PSYC32H3", "PSY393H"], "str": "PSYC32H3, (PSY393H)"}, "description": "Clinical neuropsychology is an applied science concerned with the behavioural expression of brain dysfunction. In this course we will first examine the brain and localization of neuropsychological function. We will then explore the science and practice of clinical neuro-psychology where tests measuring different neuropsychological domains (e.g., memory, attention and so on) are employed in patient populations to infer brain dysfunction. Students in the Specialist (Co-operative) Program in Mental Health Studies should enrol in PSYC32H3, not in this course.", "code": "PSYC31H3"}, "POLD45H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course studies the theory of constitutionalism through a detailed study of its major idioms such as the rule of law, the separation of powers, sovereignty, rights, and limited government.Area of Focus: Political Theory", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3", "POLB30H3"], "str": "[[(POLB70H3) and (POLB71H3)] or POLB72H3 or POLB30H3] and [1.5 credits at the C-level in POL courses]"}, "title": "POLD45H3  Constitutionalism ", "code": "POLD45H3"}, "POLC83H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the foreign policy of the United States by analyzing its context and application to a specific region, regions or contemporary problems in the world.Areas of Focus: International Relations; Public Policy; Comparative Politics", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLC83H3  Applications of American Foreign Policy ", "code": "POLC83H3"}, "PHYD72H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "14.0 credits, cumulative GPA of at least 2.5, and permission from the coordinator."}, "title": "PHYD72H3  Supervised Reading in Physics and Astrophysics ", "exclusions": {"list": ["PHY371H", "PHY372H", "PHY471H", "PHY472H"], "str": "PHY371H, PHY372H, PHY471H, PHY472H"}, "description": "An individual study program chosen by the student with the advice of, and under the direction of a faculty member. A student may take advantage of this course either to specialize further in a field of interest or to explore interdisciplinary fields not available in the regular syllabus.", "code": "PHYD72H3"}, "POLC88H3": {"breath_req": "Social & Behavioural Sciences", "description": "Traditional International Relations Theory has concentrated on relations between states, either failing to discuss, or missing the complexities of important issues such as terrorism, the role of women, proliferation, globalization of the world economy, and many others. This course serves as an introduction to these issues - and how international relations theory is adapting in order to cover them.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "[POLB80H3 and POLB81H3] or equivalent"}, "title": "POLC88H3  The New International Agenda ", "code": "POLC88H3"}, "PSYD16H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYC11H3", "PSYC12H3", "PSYB10H3"], "str": "PSYC11H3 or PSYC12H3 or [PSYB10H3 plus one C-level half-credit in PSY]"}, "title": "PSYD16H3  Critical Analysis in Social Psychology ", "exclusions": {"list": ["PSY420H"], "str": "PSY420H"}, "description": "The development of social psychology is examined both as a discipline (its phenomena, theory, and methods) and as a profession. The Natural and Human Science approaches to phenomena are contrasted. Students are taught to observe the lived-world, choose a social phenomenon of interest to them, and then interview people who describe episodes from their lives in which these phenomena occurred. The students interpret these episodes and develop theories to account for their phenomena before searching for scholarly research on the topic.", "code": "PSYD16H3"}, "POLC58H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the foundational concepts of nation and nationalism in Canadian and comparative politics, and the related issues associated with diversity. The first section looks at the theories related to nationalism and national identity, while the second applies these to better understand such pressing issues as minorities, multiculturalism, conflict and globalization.Areas of Focus: Canadian Government and Politics; Comparative Politics", "prerequisite": {"list": ["POLB92H3", "POLB50Y3"], "str": "POLB92H3 or POLB50Y3"}, "title": "POLC58H3  The Politics of National Identity and Diversity ", "code": "POLC58H3"}, "POLC87H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the possibilities and limits for international cooperation in different areas and an examination of how institutions and the distribution of power shape bargained outcomes.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "POLB80H3 & POLB81H3"}, "title": "POLC87H3  International Cooperation and Institutions ", "code": "POLC87H3"}, "PSYC04H3": {"breath_req": "Natural Sciences", "description": "The course introduces brain imaging techniques, focusing on techniques such as high-density electroencephalography (EEG) and transcranial magnetic stimulation (TMS), together with magnet-resonance-imaging-based neuronavigation. Furthermore, the course will introduce eye movement recordings as a behavioural measure often co-registered in imaging studies. Students will learn core principles of experimental designs, data analysis and interpretation in a hands-on manner.", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC04H3  Brain Imaging Laboratory ", "code": "PSYC04H3"}, "PSYC59H3": {"breath_req": "Natural Sciences", "description": "This course provides an overview of the cognitive and neural processes and representations that underlie language abilities. Core topics include first language acquisition, second language acquisition and bilingualism, speech comprehension, and reading. Insights into these different abilities will be provided from research using behavioural, neuroimaging, computational, and neuropsychological techniques.", "prerequisite": {"list": ["PSYB65H3", "PSYB51H3", "PSYB57H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "PSYB65H3 and [PSYB51H3 or PSYB57H3] and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC59H3  Cognitive Neuroscience of Language ", "code": "PSYC59H3"}, "POLB80H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLB80H3  Introduction to International Relations I ", "exclusions": {"list": ["POL208Y"], "str": "POL208Y"}, "description": "This course examines different approaches to international relations, the characteristics of the international system, and the factors that motivate foreign policies.Area of Focus: International Relations", "code": "POLB80H3"}, "POLC79H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB72H3", "POLB70H3", "POLB71H3", "PHLB13H3", "WSTA03H3"], "str": "POLB72H3 or [(POLB70H3) and (POLB71H3)] or PHLB13H3 or WSTA03H3"}, "title": "POLC79H3  Feminist Political Thought ", "exclusions": {"list": ["POL432H"], "str": "POL432H"}, "description": "This course examines the challenges and contributions of feminist political thought to the core concepts of political theory, such as rights, citizenship, democracy, and social movements. It analyzes the history of feminist political thought, and the varieties of contemporary feminist thought, including: liberal, socialist, radical, intersectional, and postcolonial. Area of Focus: Political Theory", "code": "POLC79H3"}, "POLC68H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3", "POLB30H3"], "str": "[POLB50Y3 or equivalent] or POLB30H3"}, "title": "POLC68H3  The Constitution of Canada and the Charter of Rights and Freedoms ", "exclusions": {"list": ["POL337Y"], "str": "POL337Y"}, "description": "This course will investigate the development of Canadian constitutional law under the Constitution Act of 1982 and the Charter of Rights and Freedoms. Specific topics include criminal rights, freedom of expression, freedom of religion, equality rights, and aboriginal rights.Areas of Focus: Canadian Government and Politics; Public Policy", "code": "POLC68H3"}, "PSYC51H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB51H3", "PSYB57H3", "PSYB65H3"], "str": "PSYB51H3 or PSYB57H3 or PSYB65H3"}, "title": "PSYC51H3  The Cognitive Neuroscience of Vision ", "exclusions": {"list": ["PSY380H"], "str": "PSY380H"}, "description": "This course will provide an in-depth examination of research in the field of visual cognitive neuroscience. Topics will include the visual perception of object features (shape, colour, texture), the perception of high-level categories (objects, faces, bodies, scenes), visual attention, and comparisons between the human and monkey visual systems.", "code": "PSYC51H3"}, "PHYA22H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA10H3", "PHYA11H3", "PHYA01H3", "MATA29H3", "MATA30H3", "MATA31H3"], "str": "[PHYA10H3 or PHYA11H3 or (PHYA01H3)] and [MATA29H3 or MATA30H3 or MATA31H3]"}, "title": "PHYA22H3  Physics II for the Life Sciences ", "exclusions": {"list": ["PHYA21H3", "PHY110Y", "PHY132H", "PHY135Y", "PHY138Y", "PHY152H"], "str": "PHYA21H3, (PHY110Y), PHY132H, PHY135Y, (PHY138Y), PHY152H"}, "description": "The course covers the main concepts of Electricity and Magnetism, Optics, and Atomic and Nuclear Physics. It provides basic knowledge of these topics with particular emphasis on its applications in the life sciences. It also covers some of the applications of modern physics such as atomic physics and nuclear radiation.", "code": "PHYA22H3"}, "POLC21H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["STAB23H3", "POL242Y"], "str": "[STAB23H3 or equivalent] or POL242Y"}, "title": "POLC21H3  Voting and Elections ", "exclusions": {"list": ["POL314H", "POL314Y"], "str": "POL314H, POL314Y"}, "description": "Why do some citizens vote when others do not? What motivates voters? This course reviews theories of voting behaviour, the social and psychological bases of such behaviour, and how candidate and party campaigns influence the vote. By applying quantitative methods introduced in STAB23H3 or other courses on statistical methods, students will complete assignments examining voter behaviour in recent Canadian and/or foreign elections using survey data and election returns.Areas of Focus: Canadian Government and Politics; Comparative Politics", "code": "POLC21H3"}, "POLC16H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "POLB90H3 or POLB91H3"}, "title": "POLC16H3  Chinese Politics ", "exclusions": {"list": ["JPA331Y", "JMC031Y"], "str": "JPA331Y, JMC031Y"}, "description": "This course covers a range of topics in contemporary Chinese politics and society post 1989. It exposes students to state of the art literature and probes beyond the news headlines. No prior knowledge of China required. \nArea of Focus: Comparative Politics", "code": "POLC16H3"}, "PSYC52H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB51H3", "PSYB57H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYB51H3 or PSYB57H3] and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC52H3  The Cognitive Neuroscience of Attention ", "exclusions": {"list": ["PSY475H"], "str": "PSY475H"}, "description": "This course is about understanding how the human brain collects information from the environment so as to perceive it and to interact with it. The first section of the course will look into the neural and cognitive mechanisms that perceptual systems use to extract important information from the environment. Section two will focus on how attention prioritizes information for action. Additional topics concern daily life applications of attentional research.", "code": "PSYC52H3"}, "POLD70H3": {"description": "This seminar explores the ways in which political theory can deepen our understanding of contemporary political issues. Topics may include the following: cities and citizenship; multiculturalism and religious pluralism; the legacies of colonialism; global justice; democratic theory; the nature of power.Area of Focus: Political Theory", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3"], "str": "[(POLB70H3) or (POLB71H3) or POLB72H3] and [1.5 credits at the C-level in POL courses]"}, "title": "POLD70H3  Topics in Political Theory ", "code": "POLD70H3"}, "POLC80H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course introduces students to the International Relations of Africa. This course applies the big questions in IR theory to a highly understudied region. The first half of the course focuses on security and politics, while the latter half pays heed to poverty, economic development, and multilateral institutions.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "POLB80H3 and POLB81H3"}, "title": "POLC80H3  International Relations of Africa ", "code": "POLC80H3"}, "PHLB55H3": {"breath_req": "Quantitative Reasoning", "description": "Philosophy often begins with a puzzle or paradox. Zeno once convincingly argued that motion was impossible, but people continue to move. The \"liar's paradox\" seems to show that everything is both true and false, but that cannot be right. In this course, we will puzzle through these and related issues.", "title": "PHLB55H3  Puzzles and Paradoxes ", "code": "PHLB55H3"}, "POLD92H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course will provide an introduction to theories of why some dictatorships survive while others do not. We will explore theories rooted in regime type, resources, state capacity, parties, popular protest, and leadership. We will then examine the utility of these approaches through in-depth examinations of regime crises in Ethiopia, Iran, China, the USSR, and South Africa.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB92H3", "POLB90H3", "POLB91H3"], "str": "POLB92H3 and [ POLB90H3 or POLB91H3] and [an additional 2.0 credits at the C-level in any courses]"}, "title": "POLD92H3  Survival and Demise of Dictatorships ", "code": "POLD92H3"}, "PHYB54H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA21H3", "MATB41H3", "MATB44H3"], "str": "PHYA21H3, MATB41H3, MATB44H3"}, "title": "PHYB54H3  Mechanics: From Oscillations to Chaos ", "exclusions": {"list": ["PHY254H", "PHYB20H3"], "str": "PHY254H, (PHYB20H3)"}, "description": "The linear, nonlinear and chaotic behaviour of classical mechanical systems such as oscillators, rotating bodies, and central field systems. The course will develop analytical and numerical tools to solve such systems and determine their basic properties. The course will include mathematical analysis, numerical exercises (Python), and demonstrations of mechanical systems.", "code": "PHYB54H3"}, "PSYD34H3": {"breath_req": "Natural Sciences", "description": "Part I of this course reviews the classical theories as well as past research strategies and findings in the field of human intelligence. Part II examines current work in the area. Part III critically considers the concept of heritability, how it is estimated, and its application to the investigation of individual and group differences on IQ tests. ", "prerequisite": {"list": ["PSYB01H3", "PSYB07H3", "SOCB06H3", "STAB22H3"], "str": "PSYB01H3 and [PSYB07H3 or (SOCB06H3) or STAB22H3]"}, "title": "PSYD34H3  Human Intelligence ", "code": "PSYD34H3"}, "PSYD54H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB51H3", "PSYB57H3", "NROC64H3"], "str": "[PSYB51H3 or PSYB57H3] and [0.5 credit from the PSYC50-series of courses or NROC64H3]"}, "title": "PSYD54H3  Current Topics in Visual Recognition ", "exclusions": {"list": ["PSYD50H3", "PSYD51H3"], "str": "[PSYD50H3 if taken in Winter 2014, 2015 or 2016], PSYD51H3"}, "description": "The course provides an intensive examination of selected topics in the research of visual recognition. Multiple components of recognition, as related to perception, memory and higher-level cognition, will be considered from an integrative psychological, neuroscientific and computational perspective. Specific topics include face recognition, visual word recognition and general object recognition.", "code": "PSYD54H3"}, "POLD52H3": {"breath_req": "Social & Behavioural Sciences", "description": "Immigration has played a central role in Canada's development. This course explores how policies aimed at regulating migration have both reflected and helped construct conceptions of Canadian national identity. We will pay particular attention to the politics of immigration policy-making, focusing on the role of the state and social actors.Areas of Focus: Canadian Government and Politics; Public Policy", "prerequisite": {"list": ["POLB50Y3", "SOCB60H3"], "str": "[[POLB50Y3 or equivalent] and [1.5 credits at the C-level in POL or PPG courses]] or [15.0 credits including SOCB60H3]"}, "title": "POLD52H3  Immigration and Canadian Political Development ", "code": "POLD52H3"}, "POLC91H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "[POLB90H3 and POLB91H3] or equivalent"}, "title": "POLC91H3  Latin America: Dictatorship and Democracy ", "exclusions": {"list": ["POL305Y"], "str": "POL305Y"}, "description": "This course explores the origins of Latin America's cycles of brutal dictatorship and democratic rule. It examines critically the assumption that Latin American countries have made the transition to democratic government.Area of Focus: Comparative Politics", "code": "POLC91H3"}, "PHYA21H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA10H3", "MATA30H3", "MATA31H3"], "str": "PHYA10H3, [MATA30H3 or MATA31H3]"}, "title": "PHYA21H3  Physics II for the Physical Sciences ", "exclusions": {"list": ["PHYA22H3", "PHY110Y", "PHY132H", "PHY135Y", "PHY138Y", "PHY152H"], "str": "PHYA22H3, (PHY110Y), PHY132H, PHY135Y, (PHY138Y), PHY152H"}, "description": "This second physics course is intended for students in physical and mathematical sciences programs. Topics include electromagnetism and special relativity.", "code": "PHYA21H3"}, "PHLB33H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course is a thematic introduction to the history of metaphysics, focusing on topics such as the nature of God, our own nature as human beings, and our relation to the rest of the world. We will read a variety of texts, from ancient to contemporary authors, that will introduce us to concepts such as substance, cause, essence and existence, mind and body, eternity and time, and the principle of sufficient reason. We will also look at the ethical implications of various metaphysical commitments. ", "title": "PHLB33H3  God, Self, World ", "code": "PHLB33H3"}, "PSYC93H3": {"description": "An intensive research project intended to provide laboratory/field experience in data collection and analysis. The project must be completed over 2 consecutive terms. These courses provide an opportunity to engage in research in an area after completing basic coverage in regularly scheduled courses. The student must demonstrate a background adequate for the project proposed and should present a clear rationale to prospective supervisors. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report. Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book. Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, that is appointed at UTSC, will be required. ", "prerequisite": {"list": [], "str": "3.0 full credits in Psychology and permission of the proposed supervisor.  Note:  Normally students need a cumulative GPA of at least 2.7 for permission to be granted.)"}, "exclusions": {"list": ["COGC92H3", "NROC93H3", "PSY303H", "PSY304H"], "str": "COGC92H3, NROC93H3, PSY303H, PSY304H"}, "title": "PSYC93H3  Supervised Study in Psychology ", "code": "PSYC93H3"}, "POLB90H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLB90H3  Comparative Development in International Perspective ", "exclusions": {"list": ["POL201Y"], "str": "POL201Y"}, "description": "This course examines the historical and current impact of the international order on the development prospects and politics of less developed countries. Topics include colonial conquest, multi-national investment, the debt crisis and globalization. The course focuses on the effects of these international factors on domestic power structures, the urban and rural poor, and the environment.Area of Focus: Comparative Politics", "code": "POLB90H3"}, "PHLC37H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PHLB33H3", "PHLB35H3"], "str": "Any 4.5 credits and [[PHLB33H3 or PHLB35H3] and additional 1.0 credit in PHL courses]"}, "title": "PHLC37H3  Kant ", "exclusions": {"list": ["PHL314H"], "str": "PHL314H"}, "description": "This course focuses on the thought of Immanuel Kant, making connections to some of Kant's key predecessors such as Hume or Leibniz. The course will focus either on Kant's metaphysics and epistemology, or his ethics, or his aesthetics.", "code": "PHLC37H3"}, "PSYD33H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB32H3"], "str": "PSYB32H3 plus one C-level half-credit in PSY"}, "title": "PSYD33H3  Current Topics in Abnormal Psychology ", "exclusions": {"list": ["PSY440H"], "str": "PSY440H"}, "description": "An intensive examination of selected issues and research problems in abnormal psychology. The specific content will vary from year to year.", "code": "PSYD33H3"}, "PHLC95H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Advanced topics in the Philosophy of mind, such as an exploration of philosophical problems and theories of consciousness. Topics to be examined may include: the nature of consciousness and 'qualitative experience', the existence and nature of animal consciousness, the relation between consciousness and intentionality, as well as various philosophical theories of consciousness.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC95H3  Topics in the Philosophy of Mind ", "code": "PHLC95H3"}, "PSYB20H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB20H3  Introduction to Developmental Psychology ", "exclusions": {"list": ["PSYB21H3", "PSY210H"], "str": "PSYB21H3, PSY210H"}, "description": "Developmental processes during infancy and childhood.This course presents students with a broad and integrative overview of child development. Major theories and research findings will be discussed in order to understand how the child changes physically, socially, emotionally, and cognitively with age. Topics are organized chronologically beginning with prenatal development and continuing through selected issues in adolescence and life-span development.", "code": "PSYB20H3"}, "PSYC50H3": {"breath_req": "Natural Sciences", "description": "This course examines advanced cognitive functions through a cognitive psychology lens. Topics covered include: thinking, reasoning, decision-making, problem-solving, creativity, and consciousness. ", "prerequisite": {"list": ["PSYB57H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "PSYB57H3 and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC50H3  Higher-Level Cognition ", "code": "PSYC50H3"}, "PSYD20H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYC21H3", "PLIC24H3", "PSYB20H3"], "str": "PSYC21H3 or PLIC24H3 or [PSYB20H3 plus one C-level half-credit in PSY]"}, "title": "PSYD20H3  Current Topics in Developmental Psychology ", "exclusions": {"list": ["PSY410H"], "str": "PSY410H"}, "description": "An intensive examination of selected issues and research problems in developmental psychology.The specific content will vary from year to year with the interests of both instructor and students. Lectures, discussions, and oral presentations by students.", "code": "PSYD20H3"}, "PHLD94H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD94H3  Independent Study ", "code": "PHLD94H3"}, "PSYD50H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB57H3"], "str": "PSYB57H3 plus one C-level half-credit in PSY"}, "title": "PSYD50H3  Current Topics in Memory and Cognition ", "exclusions": {"list": ["PSY470H", "PSY471H"], "str": "PSY470H, PSY471H"}, "description": "An intensive examination of selected topics. The specific content will vary from year to year.", "code": "PSYD50H3"}, "PMDB30H3": {"breath_req": "Natural Sciences", "description": "Discusses how human body function is affected by a variety of patho-physiological circumstances. The theoretical framework includes the main concepts of crisis, the adaptation of the body by way of compensatory mechanisms, the failure of these compensatory mechanisms and the resulting physiological manifestations. Students will learn to identify such manifestations. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB22H3", "PMDB25H3", "PMDB41H3", "PMDB33H3"], "str": "PMDB22H3 and PMDB25H3 and PMDB41H3 and PMDB33H3"}, "title": "PMDB30H3  Alterations of Human Body Function I ", "code": "PMDB30H3"}, "PSYB04H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB04H3  Foundations in Psychological Research ", "exclusions": {"list": ["PSYB01H3"], "str": "PSYB01H3"}, "description": "A practical introduction to research methods in psychology. Students will learn experimental designs commonly used in psychological research, how to assess whether a design has been applied correctly or incorrectly, and whether the conclusions drawn from the data are warranted. This course is designed for students who need to be able to evaluate and critique research, rather than conduct novel research.", "code": "PSYB04H3"}, "PHLB17H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course will introduce some important concepts of and thinkers in political philosophy from the history of political philosophy to the present. These may include Plato, Aristotle, Augustine, Aquinas, Thomas Hobbes, John Locke, Jean-Jacques Rousseau, G.W.F. Hegel, John Stuart Mill, or Karl Marx. Topics discussed may include political and social justice, liberty and the criteria of good government.", "exclusions": {"list": ["PHL265H", "POLB71H3", "PHLB17H3", "POLB72H3"], "str": "PHL265H, (POLB71H3); in addition, PHLB17H3 may not be taken after or concurrently with POLB72H3"}, "title": "PHLB17H3  Introduction to Political Philosophy ", "code": "PHLB17H3"}, "PSYC06H3": {"breath_req": "Natural Sciences", "description": "This course will provide students with an introduction to physiological processes that are related to psychological processes. Students will gain a theoretical background in psychophysiology as well as read key empirical papers related to the psychological correlates of each physiological system. This course will be a primary methods course for psychology specialists, such that students will acquire advanced skills involved in the acquisition of psychophysiological data and become well-versed in appropriate psychophysiological theory and inference.", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYC02H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and PSYC02H3"}, "title": "PSYC06H3  Psychophysiology Laboratory ", "code": "PSYC06H3"}, "PHLC06H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Value Theory area of focus  see Table 1.0 for reference]"}, "title": "PHLC06H3  Topics in Ethical Theory ", "exclusions": {"list": ["PHLC01H3", "PHL375H"], "str": "(PHLC01H3), PHL375H"}, "description": "Philosophical ethics simultaneously aims to explain what ethics is, why it matters, and what it tells us to do. This is what is meant by the phrase 'ethical theory.' In this class we will explore specific topics in ethical theory in some depth. Specific topics may vary with the instructor.", "code": "PHLC06H3"}, "POLD94H3": {"breath_req": "Social & Behavioural Sciences", "description": "Topics vary according to instructor.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "POLB90H3 and [POLB91H3 or 0.5 credit at the B-level in IDS courses] and [2.0 credits at the C-level in any courses]"}, "title": "POLD94H3  Selected Topics on Developing Areas ", "code": "POLD94H3"}, "POLD87H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course is an introduction to rational choice theories with applications to the international realm. A main goal is to introduce analytical constructs frequently used in the political science and political economy literature to understand strategic interaction among states.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "POLB80H3 and POLB81H3 and [1.5 credits at the C-level in POL courses]"}, "title": "POLD87H3  Rational Choice and International Cooperation ", "code": "POLD87H3"}, "POLC40H3": {"breath_req": "Social & Behavioural Sciences", "description": "Topics and Area of Focus will vary depending on the instructor.", "prerequisite": {"list": [], "str": "One B-level full credit in Political Science"}, "title": "POLC40H3  Current Topics in Politics ", "code": "POLC40H3"}, "PHLD96H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD96H3  Independent Study ", "code": "PHLD96H3"}, "POLC74H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3"], "str": "[(POLB70H3) and (POLB71H3)] or POLB72H3"}, "title": "POLC74H3  Contemporary Political Thought ", "exclusions": {"list": ["POL320Y"], "str": "POL320Y"}, "description": "This course is a study of the major political philosophers of the twentieth century. The theorists covered will vary from year to year.Area of Focus: Political Theory", "code": "POLC74H3"}, "PMDB36H3": {"breath_req": "Natural Sciences", "description": "Introduces principles of Pharmacology, essential knowledge for paramedics who are expected to administer medications in Pre-hospital care. Classifications of drugs will be discussed in an organized manner according to their characteristics, purpose, physiologic action, adverse effects, precautions, interactions and Pre-hospital applications. Students will use a step-by-step process to calculate drug dosages. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB22H3", "PMDB25H3", "PMDB41H3", "PMDB33H3"], "str": "PMDB22H3 and PMDB25H3 and PMDB41H3 and PMDB33H3"}, "title": "PMDB36H3  Pharmacology for Allied Health ", "code": "PMDB36H3"}, "PHYA11H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "Grade 12 Advanced Functions (MHF4U) and Grade 12 Calculus and Vectors (MCV4U)"}, "title": "PHYA11H3  Physics I for the Life Sciences ", "exclusions": {"list": ["PHYA10H3", "PHY131H", "PHY135Y", "PHY151H", "PHY110Y", "PHY138Y"], "str": "PHYA10H3, PHY131H, PHY135Y, PHY151H, (PHY110Y), (PHY138Y)"}, "description": "This first course in Physics at the university level is intended for students enrolled in the Life sciences. It covers fundamental concepts of classical physics and its applications to macroscopic systems in one and three dimensions. It deals with two main themes; which are Particle and Fluid Mechanics and Waves and Oscillations. The approach will be phenomenological with applications related to life and biological sciences.", "code": "PHYA11H3"}, "PHLC05H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an addtional 1.5 credits in PHL courses, of which 0.5 credit must be from the Value Theory area of focus  see Table 1.0 for reference]"}, "title": "PHLC05H3  Ethical Theory ", "exclusions": {"list": ["PHLC01H3", "PHL375H"], "str": "(PHLC01H3), PHL375H"}, "description": "Philosophers offer systematic theories of ethics: theories that simultaneously explain what ethics is, why it matters, and what it tells us to do. This course is a careful reading of classic philosophical texts by the major systematic thinkers in the Western tradition of ethics. Particular authors read may vary from instructor to instructor.", "code": "PHLC05H3"}, "PSYC19H3": {"breath_req": "Social & Behavioural Sciences", "description": "A detailed examination of how organisms exercise control, bringing thoughts, emotions and behaviours into line with preferred standards. Topics include executive function, the neural bases for self control, individual differences in control, goal setting and goal pursuit, motivation, the interplay of emotion and control, controversies surrounding fatigue and control, and decision-making.", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB10H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB10H3 "}, "title": "PSYC19H3  Psychology of Self Control ", "code": "PSYC19H3"}, "PSYC39H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB32H3"], "str": "PSYB32H3"}, "title": "PSYC39H3  Psychology and the Law ", "exclusions": {"list": ["PSYC53H3", "PSY328H", "PSY344H"], "str": "(PSYC53H3), PSY328H, PSY344H"}, "description": "This course focuses on the application of psychology to the law, particularly criminal law including cognitive, neuropsychological and personality applications to fitness to stand trial, criminal responsibility, risk for violent and sexual recidivism and civil forensic psychology.", "code": "PSYC39H3"}, "PHLC13H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Feminist philosophy includes both criticism of predominant approaches to philosophy that may be exclusionary for women and others, and the development of new approaches to various areas of philosophy. One or more topics in feminist philosophy will be discussed in some depth. Particular topics will vary with the instructor.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Value Theory sub-discipline area of focus  see Table 1.0 for reference]"}, "title": "PHLC13H3  Topics in Philosophy and Feminism ", "code": "PHLC13H3"}, "PSYB32H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 & PSYA02H3"}, "title": "PSYB32H3  Abnormal Psychology ", "exclusions": {"list": ["PSY240H", "PSY340H"], "str": "PSY240H, PSY340H"}, "description": "The study of abnormal psychology is a search for why people behave, think, and feel in unexpected, sometimes bizarre, and typically self-defeating ways. Much less is known than we would like. However, this course will focus on the ways in which psychopathologists have been trying to learn the causes of abnormal behaviour and what they know about preventing and alleviating it.", "code": "PSYB32H3"}, "PHLB04H3": {"breath_req": "Arts, Literature & Language", "description": "This course examines some of the classic problems concerning literary texts, such as the nature of interpretation, questions about the power of literary works and their relationship to ethical thought, and problems posed by fictional works - how can we learn from works that are fictional and how can we experience genuine emotions from works that we know are fictional?", "title": "PHLB04H3  Philosophy and Literature ", "code": "PHLB04H3"}, "POLC93H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "One full credit in Political Science at the B-level"}, "title": "POLC93H3  Public Policies in the United States ", "exclusions": {"list": ["POL203Y"], "str": "POL203Y"}, "description": "This course focuses on selected policy issues in the United States.Areas of Focus: Comparative Politics; Public Policy", "code": "POLC93H3"}, "PSYB45H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB45H3  Behaviour Modification: Origins and Applications ", "exclusions": {"list": ["PSY260H"], "str": "PSY260H"}, "description": "A survey of attempts to regulate abnormal human behaviour.Basic principles of behavioural change including reinforcement, extinction, punishment and stimulus control; operant and respondent conditioning procedures; research strategies. Other topics include behavioural contracting, cognitive-behaviour therapy, rational-emotive therapy, and systematic desensitization; treatment of phobias; treatment of alcohol and drug abuse.", "code": "PSYB45H3"}, "PHLD92H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD92H3  Independent Study ", "code": "PHLD92H3"}, "POLC32H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the structure, role and key issues associated with the Canadian judicial system. The first section provides the key context and history associated with Canada's court system. The second section discusses the role the courts have played in the evolution of the Canadian constitution and politics - with a particular focus on the Supreme Court of Canada. The final section analyzes some of the key debates and issues related to the courts in Canada, including their democratic nature, function in establishing public policy and protection of civil liberties.\nArea of Focus: Canadian Government and Politics", "prerequisite": {"list": ["POLB50Y3"], "str": "POLB50Y3"}, "title": "POLC32H3  The Canadian Judicial System ", "code": "POLC32H3"}, "PSCD02H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "Completion of at least 3.5 credits of a Physical Sciences program"}, "title": "PSCD02H3  Current Questions in Mathematics and Science ", "exclusions": {"list": ["PHY342H"], "str": "PHY342H"}, "description": "Topics of current prominence arising in chemistry, computer science, earth sciences, mathematics and physics will be discussed, usually by faculty or outside guests who are close to the areas of prominence. Topics will vary from year to year as the subject areas evolve.", "code": "PSCD02H3"}, "PMDC40H3": {"breath_req": "Natural Sciences", "description": "Strengthens students' decision-making skills and sound clinical practices. Students continue to develop an understanding of various complex alterations in human body function from a variety of patho-physiological topics. Physiologic alterations will be discussed in terms of their potential life threat, their effect on the body's compensatory and decompensatory mechanisms, their manifestations and complications and treatment. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB30H3", "PMDB32Y3", "PMDB36H3", "BIOB11H3"], "str": "PMDB30H3 and PMDB32Y3 and PMDB36H3 and BIOB11H3"}, "title": "PMDC40H3  Alterations of Human Body Function II ", "code": "PMDC40H3"}, "PHYC50H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYB54H3", "PHYB21H3", "MATA23H3", "MATB42H3", "MATB44H3"], "str": "PHYB54H3, PHYB21H3, MATA23H3, MATB42H3, MATB44H3"}, "title": "PHYC50H3  Electromagnetic Theory ", "exclusions": {"list": ["PHY350H"], "str": "PHY350H"}, "description": "Solving Poisson and Laplace equations via method of images and separation of variables, Multipole expansion for electrostatics, atomic dipoles and polarizability, polarization in dielectrics, Ampere and Biot-Savart laws, Multipole expansion in magnetostatics, magneticdipoles, magnetization in matter, Maxwells equations in matter.", "code": "PHYC50H3"}, "PHYD27H3": {"breath_req": "Natural Sciences", "description": "A course introducing the main physical concepts needed to describe, model and understand the climate systems of Earth and other planets. Topics covered will include: the primitive equations of meteorology, radiative transfer in atmospheres, processes involved in atmosphere-surface exchanges, atmospheric chemistry (condensable species, atmospheric opacities), numerical methods for climate modeling.", "prerequisite": {"list": ["PHYB52H3", "PSCB57H3", "MATC46H3"], "str": "PHYB52H3 and PSCB57H3 and MATC46H3"}, "title": "PHYD27H3  Physics of Climate Modeling ", "code": "PHYD27H3"}, "PHLB50H3": {"breath_req": "Quantitative Reasoning", "description": "An introduction to formal, symbolic techniques of reasoning. Sentential logic and quantification theory (or predicate logic), including identity will be covered. The emphasis is on appreciation of and practice in techniques, for example, the formal analysis of English statements and arguments, and for construction of clear and rigorous proofs.", "exclusions": {"list": ["PHL245H"], "str": "PHL245H"}, "title": "PHLB50H3  Symbolic Logic I ", "code": "PHLB50H3"}, "PSYB30H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB30H3  Personality ", "exclusions": {"list": ["PSY230H"], "str": "PSY230H"}, "description": "This course is intended to introduce students to the scientific study of the whole person in biological, social, and cultural contexts. The ideas of classical personality theorists will be discussed in reference to findings from contemporary personality research.", "code": "PSYB30H3"}, "PMDB33H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "PMDB33H3  Anatomy ", "exclusions": {"list": ["ANA300Y", "ANA301H", "BIOB33H3"], "str": "ANA300Y, ANA301H, BIOB33H3"}, "description": "The basic anatomy of all the human body systems will be examined. The focus is on the normal functioning of the anatomy of all body systems and compensatory mechanisms, where applicable, to maintain homeostasis. Specific differences with respect to the pediatric/geriatric client will be highlighted. This course is taught at the Centennial HP Science and Technology Centre.", "code": "PMDB33H3"}, "PHLC32H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the History of Philosophy area of focus  see Table 1.0 for reference] "}, "title": "PHLC32H3  Ancient Philosophy ", "exclusions": {"list": ["PHL300H", "PHL303H", "PHL304H"], "str": "(PHL300H), PHL303H, PHL304H"}, "description": "This course focuses on the thought of Plato and Aristotle, with some attention to the pre-Socratics and Hellenistic thinkers, including ancient atomists and the Stoics.", "code": "PHLC32H3"}, "POLB81H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB80H3", "POLB80H3", "POLB81H3"], "str": "POLB80H3  NoteIt is strongly recommended that students take POLB80H3 and POLB81H3 in consecutive sessions."}, "title": "POLB81H3  Introduction to International Relations II ", "exclusions": {"list": ["POL208Y"], "str": "POL208Y"}, "description": "This course examines how the global system is organized and how issues of international concern like conflict, human rights, the environment, trade, and finance are governed.Area of Focus: International Relations", "code": "POLB81H3"}, "POLC92H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "One full credit in Political Science at the B-level"}, "title": "POLC92H3  The American Political Process ", "exclusions": {"list": ["POL203Y"], "str": "POL203Y"}, "description": "This course analyses the American federal system and the institutions and processes of government in the United States.Area of Focus: Comparative Politics", "code": "POLC92H3"}, "PSYC21H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB20H3"], "str": "PSYB20H3 and one additional B-level half-credit in PSY"}, "title": "PSYC21H3  Advanced Developmental Psychology ", "exclusions": {"list": ["PSY313H", "PSY311H"], "str": "PSY313H, PSY311H"}, "description": "An examination of selected issues pertaining to adult development and aging. Examples of topics which may be considered: adaptation to parenthood, work-related functioning, continuity versus change in adulthood. ", "code": "PSYC21H3"}, "PHYB56H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA21H3", "MATA36H3"], "str": "PHYA21H3, MATA36H3"}, "title": "PHYB56H3  Introduction to Quantum Physics ", "exclusions": {"list": ["PHY256H", "PHYB25H3"], "str": "PHY256H, (PHYB25H3)"}, "description": "The course introduces the basic concepts of Quantum Physics and Quantum Mechanics starting with the experimental basis and the properties of the wave function. Schrödinger's equation will be introduced with some applications in one dimension. Topics include Stern-Gerlach effect; harmonic oscillator; uncertainty principle; interference packets; scattering and tunnelling in one-dimension.", "code": "PHYB56H3"}, "POLB50Y3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 4.0 credits."}, "title": "POLB50Y3  Canadian Government and Politics ", "exclusions": {"list": ["POLB50H3", "POLB52H3", "POL214Y", "POL224Y"], "str": "(POLB50H3), (POLB52H3), POL214Y, POL224Y"}, "description": "This course examines the institutional foundations and principles of Canadian government, and the social, cultural, and historical factors that shape its politics. Topics covered are the Canadian constitution, the executive, parliament, the public service, the federal system, the Charter of Rights and Freedoms, the courts, political parties, the electoral system, interest groups, social movements, Quebec nationalism, and aboriginal self-determination.Area of Focus: Canadian Government and Politics", "code": "POLB50Y3"}, "PSYB65H3": {"breath_req": "Natural Sciences", "description": "The neurological basis of human behaviour: an introduction to human neuro-psychology. Hemispheric specialization, diseases of the central nervous system, behavioural consequences of damage to each of the cortical lobes, speech disorders, psychopharmacology and the biological basis of psychiatric disorders will be covered.", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB65H3  Human Brain and Behaviour ", "code": "PSYB65H3"}, "POLC71H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB72H3", "PHLB17H3"], "str": "POLB72H3 or PHLB17H3"}, "title": "POLC71H3  Political Thought: Rights, Revolution and Resistance ", "exclusions": {"list": ["POL200Y", "POLB71H3"], "str": "POL200Y, (POLB71H3)"}, "description": "This course introduces students to central concepts in political theory, such as sovereignty, liberty, and equality. Readings will include modern and contemporary texts, such as Hobbes' Leviathan and Locke's Second Treatise of Government.Area of Focus: Political Theory", "code": "POLC71H3"}, "PHYA10H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "Physics 12U - SPH4U (Grade 12 Physics) and Calculus and Vectors (MCV4U) and Advanced Functions (MHF4U)"}, "title": "PHYA10H3  Physics I for the Physical Sciences ", "exclusions": {"list": ["PHYA11H3", "PHY131H", "PHY135Y", "PHY151H", "PHY110Y", "PHY138Y"], "str": "PHYA11H3, PHY131H, PHY135Y, PHY151H, (PHY110Y), (PHY138Y)"}, "description": "The course is intended for students in physical, environmental and mathematical sciences. The course introduces the basic concepts used to describe the physical world with mechanics as the working example. This includes mechanical systems (kinematics and dynamics), energy, momentum, conservation laws, waves, and oscillatory motion.", "code": "PHYA10H3"}, "POLC38H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB30H3", "POLB80H3"], "str": "POLB30H3 or POLB80H3"}, "title": "POLC38H3  International Law ", "exclusions": {"list": ["POL340Y"], "str": "POL340Y"}, "description": "This course introduces students to the foundations of international law, its sources, its rationale, and challenges to its effectiveness and implementation. Areas of international law discussed include the conduct of war, trade, and diplomacy, as well as the protection of human rights and the environment.Area of Focus: International Relations", "code": "POLC38H3"}, "PHLC09H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course is a reading and discussion intensive course in 20th century German and French European Philosophy. Among the movements we shall study will be phenomenology, existentialism, and structuralism. We will look at the writings of Martin Heidegger, Jean-Paul Sartre, Maurice Merleau-Ponty, Michel Foucault, and Gilles Deleuze, among others.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses]"}, "title": "PHLC09H3  Topics in Continental Philosopy ", "code": "PHLC09H3"}, "PHLB06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of philosophical issues in ethics, social theory, and theories of human nature as they bear on business. What moral obligations do businesses have? Can social or environmental costs and benefits be calculated in a way relevant to business decisions? Do political ideas have a role within business?", "exclusions": {"list": ["MGSC14H3", "MGTC59H3", "PHL295H"], "str": "MGSC14H3/(MGTC59H3), PHL295H"}, "title": "PHLB06H3  Business Ethics ", "code": "PHLB06H3"}, "PHLB11H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A discussion of right and rights, justice, legality, and related concepts. Particular topics may include: justifications for the legal enforcement of morality, particular ethical issues arising out of the intersection of law and morality, such as punishment, freedom of expression and censorship, autonomy and paternalism, constitutional protection of human rights.", "exclusions": {"list": ["PHL271H"], "str": "PHL271H"}, "title": "PHLB11H3  Philosophy of Law ", "code": "PHLB11H3"}, "PSYC57H3": {"breath_req": "Natural Sciences", "description": "This course will introduce students to current understanding, and ongoing debates, about how the brain makes both simple and complex decisions. Findings from single-cell neurophysiology, functional neuroimaging, and computational modeling will be used to illuminate fundamental aspects of choice, including reward prediction, value representation, action selection, and self-control.", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB65H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB65H3"}, "title": "PSYC57H3  Cognitive Neuroscience of Decision Making ", "code": "PSYC57H3"}, "POLC78H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the principles of research design and methods of analysis employed by researchers in political science. Students will learn to distinguish between adequate and inadequate use of evidence and between warranted and unwarranted conclusions.", "prerequisite": {"list": [], "str": "8.0 credits including 1.0 credit in POL courses"}, "title": "POLC78H3  Political Analysis I ", "code": "POLC78H3"}, "POLD95H3": {"description": "A research project under the supervision of a member of faculty that will result in the completion of a substantial report or paper acceptable as an undergraduate senior thesis. Students wishing to undertake a supervised research project in the Winter Session must register in POLD95H3 during the Fall Session. It is the student's responsibility to find a faculty member who is willing to supervise the project, and the student must obtain consent from the supervising instructor before registering for this course. During the Fall Session the student must prepare a short research proposal, and both the supervising faculty member and the Supervisor of Studies must approve the research proposal prior to the first day of classes for the Winter Session.", "prerequisite": {"list": [], "str": "Permission of the instructor"}, "title": "POLD95H3  Supervised Research ", "code": "POLD95H3"}, "POLD67H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course critically examines the relationship between politics, rationality, and public policy-making. The first half of the course surveys dominant rational actor models, critiques of these approaches, and alternative perspectives. The second half of the course explores pathological policy outcomes, arrived at through otherwise rational procedures.Areas of Focus: Comparative Politics; Political Theory; Public Policy", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3", "POLB90H3", "POLB91H3", "PPGC66H3"], "str": "[(POLB70H3) and (POLB71H3) or POLB72H3] or [POLB90H3 and POLB91H3] or PPGC66H3 and [1.0 additional credit at the C-level in POL or PPG courses]"}, "title": "POLD67H3  The Limits of Rationality ", "code": "POLD67H3"}, "PHLB91H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An exploration of theories which provide answers to the question 'What is a human being?', answers that might be summarized with catchphrases such as: 'Man is a rational animal,' 'Man is a political animal,' 'Man is inherently individual,' 'Man is inherently social,' etc. Authors studied are: Aristotle, Hobbes, Rousseau, Darwin, Marx, Freud and Sartre.", "exclusions": {"list": ["PHL244H", "PHLC91H3"], "str": "PHL244H, (PHLC91H3)"}, "title": "PHLB91H3  Theories of Human Nature ", "code": "PHLB91H3"}, "PHLC36H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the History of Philosophy area of focus  see Table 1.0 for reference] "}, "title": "PHLC36H3  Topics in Early Modern Philosophy: Empiricism ", "exclusions": {"list": ["PHL311H"], "str": "PHL311H"}, "description": "In this course we study major figures of early modern empiricism, Locke, Berkeley, Hume, with a particular emphasis on topics such as substance, knowledge and sense perception, the mind-body problem, and the existence and nature of God.", "code": "PHLC36H3"}, "PSYC62H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB64H3", "PSYB65H3", "NROB60H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and [at least 0.5 credit chosen from the following: PSYB64H3, PSYB65H3 or NROB60H3] and [an additional 0.5 credit at the B-level or C-level in PSY or NRO courses]"}, "title": "PSYC62H3  Drugs and the Brain ", "exclusions": {"list": ["PSY396H", "PCL475Y"], "str": "PSY396H, PCL475Y"}, "description": "An examination of behavioural and neurobiological mechanisms underlying the phenomenon of drug dependence. Topics will include principles of behavioural pharmacology and pharmacokinetics, neurobiological mechanisms of drug action, and psychotropic drug classification. In addition, concepts of physical and psychological dependence, tolerance, sensitization, and reinforcement and aversion will also be covered.", "code": "PSYC62H3"}, "PSYC11H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYB10H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and PSYB10H3"}, "title": "PSYC11H3  Social Psychology Laboratory ", "exclusions": {"list": ["PSY329H"], "str": "PSY329H"}, "description": "Introduces conceptual and practical issues concerning research in social psychology, and provides experience with several different types of research. This course is designed to consider in depth various research approaches used in social psychology (such as attitude questionnaires, observational methods for studying ongoing social interaction). Discussion and laboratory work.", "code": "PSYC11H3"}, "POLC65H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course focuses on analyzing and influencing individual and collective choices of political actors to understand effective strategies for bringing about policy changes. We will draw on the psychology of persuasion and decision-making, as well as literature on political decision-making and institutions, emphasizing contemporary issues. During election years in North America, special attention will be paid to campaign strategy. There may be a service-learning requirement.Area of Focus: Public Policy", "prerequisite": {"list": [], "str": "At least 4.0 credits in POL courses"}, "title": "POLC65H3  Political Strategy ", "code": "POLC65H3"}, "PHLC80H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of philosophical issues about language. Philosophical questions to be covered include: what is the relation between mind and language, what is involved in linguistic communication, is language an innate biological feature of human beings, how do words manage to refer to things, and what is meaning.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC80H3  Philosophy of Language ", "code": "PHLC80H3"}, "PHLB81H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of questions concerning the nature of mind. Philosophical questions considered may include: what is consciousness, what is the relation between the mind and the brain, how did the mind evolve and do animals have minds, what is thinking, what are feelings and emotions, and can machines have minds.", "exclusions": {"list": ["PHL240H"], "str": "PHL240H"}, "title": "PHLB81H3  Theories of Mind ", "code": "PHLB81H3"}, "POLA02H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to crucial political issues of the day (e.g. globalization, migration, political violence, corruption, democracy, global justice, climate change, human rights, revolution, terrorism) and key concepts in Political Science. Students will develop techniques of critical reading and analytic essay writing. Topics will vary by semester and professor.", "exclusions": {"list": ["POL101Y", "POL115H", "POL112H", "POL113H", "POL114H"], "str": "POL101Y, POL115H, POL112H, POL113H, POL114H"}, "title": "POLA02H3  Critical Issues in Politics II ", "code": "POLA02H3"}, "PHYC56H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYB56H3", "PHYB21H3", "MATA23H3", "MATB42H3", "MATB44H3"], "str": "PHYB56H3, PHYB21H3, MATA23H3, MATB42H3, MATB44H3"}, "title": "PHYC56H3  Quantum Mechanics I ", "exclusions": {"list": ["PHY356H"], "str": "PHY356H"}, "description": "The course builds on the basic concepts of quantum theory students learned in PHYB56H3. Topics include the general structure of wave mechanics; eigenfunctions and eigenvalues; operators; orbital angular momentum; spherical harmonics; central potential; separation of variables; hydrogen atom; Dirac notation; operator methods; harmonic oscillator and spin.", "code": "PHYC56H3"}, "POLD50H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the interrelationship between organized interests, social movements and the state in the formulation and implementation of public policy in Canada and selected other countries.Areas of Focus: Canadian Government and Politics; Public Policy", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] and [1.5 credits at the C-level in POL or PPG courses]"}, "title": "POLD50H3  Political Interests, Political Identity, and Public Policy ", "code": "POLD50H3"}, "PHYB52H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA21H3", "PHY132H", "PHY138Y", "PHY152H", "MATB41H3"], "str": "[PHYA21H3 or PHY132H or (PHY138Y) or PHY152H] and MATB41H3"}, "title": "PHYB52H3  Thermal Physics ", "exclusions": {"list": ["PHY252H"], "str": "PHY252H"}, "description": "The quantum statistical basis of macroscopic systems; definition of entropy in terms of the number of accessible states of a many particle system leading to simple expressions for absolute temperature, the canonical distribution, and the laws of thermodynamics. Specific effects of quantum statistics at high densities and low temperatures.", "code": "PHYB52H3"}, "PMDC56H3": {"breath_req": "Natural Sciences", "description": "Challenges students with increasingly complex decisions involving life-threatening situations, ethical-legal dilemmas, and the application of sound foundational principles and knowledge of pharmacology, patho-physiology, communication, assessment and therapeutic interventions. Students will analyze and discuss real field experiences and case scenarios to further develop their assessment, care and decision-making. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDC40H3", "PMDC42Y3", "PMDC43H3"], "str": "PMDC40H3 and PMDC42Y3 and PMDC43H3"}, "title": "PMDC56H3  Primary Care Paramedic Integration and Decision Making ", "code": "PMDC56H3"}, "PHLD79H3": {"description": "This seminar addresses core issues in metaphysics. Topics to be discussed may include the nature of persons and personal identity, whether physicalism is true, what is the relation of mind to reality in general, the nature of animal minds and the question of whether machines can possess minds.", "prerequisite": {"list": [], "str": "3.5 credits in PHL courses, including 1.0 credit at the C-level"}, "title": "PHLD79H3  Advanced Seminar in Metaphysics ", "code": "PHLD79H3"}, "PSYC32H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYB32H3", "PSYB65H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and PSYB32H3 and PSYB65H3"}, "title": "PSYC32H3  Clinical Neuropsychology Laboratory ", "exclusions": {"list": ["PSYC31H3"], "str": "PSYC31H3"}, "description": "The applied science concerned with the behavioural expression of brain dysfunction for students in the Specialist (Co-op) program in Mental Health Studies. Lecture and demonstration material will be as described for PSYC31H3, Clinical Neuropsychology, but students will also complete a laboratory component. The laboratory will afford the student the opportunity for hands-on experience with a number of neuropsychological measures and will emphasize the learning of specific test administration and interpretation.", "code": "PSYC32H3"}, "PHLD51H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["PHLC51H3"], "str": "PHLC51H3"}, "title": "PHLD51H3  Metalogic ", "exclusions": {"list": ["PHL348H", "PHLC54H3"], "str": "PHL348H, (PHLC54H3)"}, "description": "Symbolic Logic deals with formal languages: you work inside formal proof systems, and also consider the \"semantics\", dealing with truth, of formal languages. Instead of working inside formal systems, Metalogic treats systems themselves as objects of study, from the outside.", "code": "PHLD51H3"}, "PSYB51H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB51H3  Perception and Cognition ", "exclusions": {"list": ["NROC64H3", "PSY280H"], "str": "NROC64H3, PSY280H"}, "description": "Theory and research on perception and cognition, including visual, auditory and tactile perception, representation, and communication. Topics include cognition and perception in the handicapped and normal perceiver; perceptual illusion, noise, perspective, shadow patterns and motion, possible and impossible scenes, human and computer scene-analysis, ambiguity in perception, outline representation. The research is on adults and children, and different species. Demonstrations and exercises form part of the course work.", "code": "PSYB51H3"}, "PHLD35H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course offers in-depth examination of the philosophical approach offered by one of the three principal Rationalist philosophers, Descartes, Spinoza or Leibniz.", "prerequisite": {"list": ["PHLC35H3"], "str": "3.5 credits in PHL courses, including [PHLC35H3 and 0.5 credit at the C-level]"}, "title": "PHLD35H3  Advanced Seminar in Rationalism ", "code": "PHLD35H3"}, "POLC09H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the causes and correlates of international crises, conflicts, and wars. Using International Relations theory, it examines why conflict occurs in some cases but not others. The course examines both historical and contemporary cases of inter-state conflict and covers conventional, nuclear, and non-traditional warfare.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "POLB80H3 and POLB81H3"}, "title": "POLC09H3  International Security: Conflict, Crisis and War ", "code": "POLC09H3"}, "POLD89H3": {"breath_req": "Social & Behavioural Sciences", "description": "Examines the challenges faced by humanity in dealing with global environmental problems and the politics of addressing them. Focuses on both the underlying factors that shape the politics of global environmental problems - such as scientific uncertainty, North-South conflict, and globalization - and explores attempts at the governance of specific environmental issues.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3", "ESTB01H3"], "str": "[[POLB80H3 and POLB81H3] or ESTB01H3]] and [2.0 credits at the C-level in any courses]"}, "title": "POLD89H3  Global Environmental Politics ", "code": "POLD89H3"}, "PHLD93H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD93H3  Independent Study ", "code": "PHLD93H3"}, "PSYC55H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB57H3", "PSYB65H3"], "str": "PSYB57H3 and PSYB65H3"}, "title": "PSYC55H3  Cognitive Neuroscience ", "exclusions": {"list": ["PSY493H"], "str": "(PSY393), PSY493H"}, "description": "The goal of this course is to present and analyze current methods, findings and theories relating brain function to cognitive processes such as perception, action, attention, memory, learning, and problem-solving. Recently developed research methods of functional neuro-imaging (including PET, MEG, and functional MRI) will be described along with the important research findings that they have generated.", "code": "PSYC55H3"}, "PSYC58H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYB51H3", "PSYB57H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and [PSYB51H3 or PSYB57H3]"}, "title": "PSYC58H3  Cognitive Psychology Laboratory ", "exclusions": {"list": ["PSY379H"], "str": "PSY379H"}, "description": "This course introduces conceptual and practical issues concerning research in cognitive psychology. Students will be introduced to current research methods through a series of practical exercises conducted on computers. By the end of the course, students will be able to program experiments, manipulate data files, and conduct basic data analyses.", "code": "PSYC58H3"}, "PHLD87H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PHLC95H3", "PHLC86H3"], "str": "3.5 credits in PHL courses, including [[PHLC95H3 or PHLC86H3] and 0.5 credit at the C-level]"}, "title": "PHLD87H3  Advanced Seminar in Philosophy of Mind ", "exclusions": {"list": ["PHL405H"], "str": "PHL405H"}, "description": "This course offers in-depth examination of selected contemporary theories and issues in philosophy of mind, such as theories of perception or of consciousness, and contemporary research examining whether minds must be embodied or embedded in a larger environment.", "code": "PHLD87H3"}, "PHLB20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of the nature of knowledge, and our ability to achieve it. Topics may include the question of whether any of our beliefs can be certain, the problem of scepticism, the scope and limits of human knowledge, the nature of perception, rationality, and theories of truth.", "exclusions": {"list": ["PHL230H"], "str": "(PHL230H)"}, "title": "PHLB20H3  Belief, Knowledge, and Truth ", "code": "PHLB20H3"}, "POLD42H3": {"breath_req": "Social & Behavioural Sciences", "description": "Topics and area of focus will vary depending on the instructor, and may include global perspectives on social and economic rights, judicial and constitutional politics in diverse states and human rights law in Canada.", "prerequisite": {"list": ["POLC32H3", "POLC36H3", "POLC39H3", "POLC68H3"], "str": "1.5 credits from the following [POLC32H3, POLC36H3, POLC39H3, POLC68H3]"}, "title": "POLD42H3  Advanced Topics in Public Law ", "code": "POLD42H3"}, "PHYB21H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA21H3", "MATB41H3"], "str": "PHYA21H3 and MATB41H3"}, "title": "PHYB21H3  Electricity and Magnetism ", "exclusions": {"list": ["PHY241H", "PHY251H"], "str": "PHY241H, PHY251H"}, "description": "A first course at the intermediate level in electricity and magnetism. The course provides an in-depth study of electrostatics and magnetostatics. Topics examined include Coulomb's Law, Gauss's Law, electrostatic energy, conductors, Ampere's Law, magnetostatic energy, Lorentz Force, Faraday's Law and Maxwell's equations.", "code": "PHYB21H3"}, "POLC22H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": [], "str": "Any 8.0 credits"}, "title": "POLC22H3  Ethnic Conflict and Democratization in Europe After the Cold War ", "exclusions": {"list": ["POLB93H3"], "str": "(POLB93H3)"}, "description": "This course explores post-Cold War politics in Europe through an examination of democratization and ethnic conflict since 1989 - focusing in particular on the role of the European Union in shaping events in Eastern Europe and the former Soviet Union. The first part of the course will cover theories of democratization, ethnic conflict as well as the rise of the European Union while the second part of the course focuses on specific cases, including democratization and conflict in the Balkans and Ukraine.Area of Focus: Comparative Politics", "code": "POLC22H3"}, "POLC99H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "[POLB90H3 and POLB91H3] or equivalent"}, "title": "POLC99H3  Latin America: The Politics of the Dispossessed ", "exclusions": {"list": ["POL305Y"], "str": "POL305Y"}, "description": "This course explores the way the poor and oppressed have organized and fought for their rights. Special attention is given to the way in which globalization has affected popular organizing, including its impact on insurgent movements such as the Zapatistas.Area of Focus: Comparative Politics", "code": "POLC99H3"}, "POLA01H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to crucial political issues of the day (e.g. globalization, migration, political violence, corruption, democracy, global justice, climate change, human rights, revolution, terrorism) and key concepts in Political Science. Students will be introduced to and practice techniques of critical reading and analytic essay writing. Topics will vary by semester and professor.", "exclusions": {"list": ["POL101Y", "POL115H", "POL112H", "POL113H", "POL114H"], "str": "POL101Y, POL115H, POL112H, POL113H, POL114H"}, "title": "POLA01H3  Critical Issues in Politics I ", "code": "POLA01H3"}, "POLC90H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course provides students with a more advanced examination of issues in development studies, including some of the mainstream theoretical approaches to development studies and a critical examination of development practice in historical perspective. Seminar format.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3", "POLB91H3"], "str": "POLB90H3 and POLB91H3"}, "title": "POLC90H3  Development Studies: Political and Historical Perspectives ", "code": "POLC90H3"}, "PHLB30H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A study of the views and approaches pioneered by such writers as Kierkegaard, Husserl, Jaspers, Heidegger and Sartre. Existentialism has had influence beyond philosophy, impacting theology, literature and psychotherapy. Characteristic topics include the nature of the self and its relations to the world and society, self-deception, and freedom of choice.", "exclusions": {"list": ["PHL220H"], "str": "PHL220H"}, "title": "PHLB30H3  Existentialism ", "code": "PHLB30H3"}, "POLC36H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines how different types of legal frameworks affect processes and outcomes of policy-making. It contrasts policy-making in Westminster parliamentary systems and separation of powers systems; unitary versus multi-level or federal systems; and systems with and without constitutional bills of rights.Area of Focus: Public Policy", "prerequisite": {"list": ["POLB50Y3"], "str": "POLB50Y3"}, "title": "POLC36H3  Law and Public Policy ", "code": "POLC36H3"}, "PSYD31H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB32H3"], "str": "PSYB32H3 and [an additional 0.5 credit at the C-level PSY]"}, "title": "PSYD31H3  Cultural-Clinical Psychology ", "exclusions": {"list": ["PSYD33H3"], "str": "PSYD33H3 (if taken in Fall 2013/2014/2015 or Summer 2014/2015)"}, "description": "This course provides an in-depth introduction to the field of cultural-clinical psychology. We examine theoretical and empirical advances in understanding the complex interplay between culture and mental health, focusing on implications for the study and treatment of psychopathology. Topics include cultural variations in the experience and expression of mental illness.", "code": "PSYD31H3"}, "PHLC22H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC22H3  Topics in Theory of Knowledge ", "exclusions": {"list": ["PHL332H"], "str": "PHL332H"}, "description": "This course addresses particular issues in the theory of knowledge in detail. Topics will vary from year to year but may typically include such topics as The Nature of Knowledge, Scepticism, Epistemic Justification, Rationality and Rational Belief Formation.", "code": "PHLC22H3"}, "PHLB03H3": {"breath_req": "Arts, Literature & Language", "description": "An examination of challenges posed by the radical changes and developments in modern and contemporary art forms. For example, given the continuously exploding nature of art works, what do they have in common - what is it to be an artwork?", "exclusions": {"list": ["PHL285H"], "str": "PHL285H"}, "title": "PHLB03H3  Philosophy of Art ", "code": "PHLB03H3"}, "POLC73H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3"], "str": "[(POLB70H3) and (POLB71H3)] or POLB72H3"}, "title": "POLC73H3  Modern Political Theory ", "exclusions": {"list": ["POL320Y"], "str": "POL320Y"}, "description": "This course is a study of the major political philosophers of the nineteenth century, including Hegel, Marx, J.S. Mill and Nietzsche.Area of Focus: Political Theory", "code": "POLC73H3"}, "POLC42H3": {"breath_req": "Social & Behavioural Sciences", "description": "Topics will vary depending on the regional interests and expertise of the Instructor.Area of Focus: Comparative Politics", "prerequisite": {"list": [], "str": "One B-level full credit in Political Science"}, "title": "POLC42H3  Topics in Comparative Politics ", "code": "POLC42H3"}, "PMDB41H3": {"breath_req": "Social & Behavioural Sciences", "description": "Discusses the changing role of the paramedic and introduces the student to the non-technical professional expectations of the profession. Introduces fundamental principles of medical research and professional principles. Topics covered include the role of professional organizations, the role of relevant legislation, the labour/management environment, the field of injury prevention, and basic concepts of medical research. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "PMDB41H3  Professional and Legal Issues, Research, Responsibilities and Leadership ", "code": "PMDB41H3"}, "POLC11H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["STAB23H3"], "str": "STAB23H3 or equivalent"}, "title": "POLC11H3  Applied Statistics for Politics and Public Policy ", "exclusions": {"list": ["POLB11H3"], "str": "(POLB11H3)"}, "description": "In this course, students learn to apply data analysis techniques to examples drawn from political science and public policy.Students will learn to complete original analyses using quantitative techniquescommonly employed by political scientists to study public opinion and government policies. Rather than stressing mathematical concepts, the emphasis of the course will be on the application and interpretation of the data as students learn to communicate their results through papers and/or presentations.", "code": "POLC11H3"}, "PSYC85H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Two B-level half-credits in Psychology or permission of the instructor"}, "title": "PSYC85H3  History of Psychology ", "exclusions": {"list": ["PSY450H", "PSY300H"], "str": "PSY450H, (PSY300H)"}, "description": "A survey of developments in Western philosophy and science which influenced the emergence of modern psychology in the second half of the Nineteenth Century. Three basic problems are considered: mind-body, epistemology (science of knowledge), and behaviour/motivation/ethics. We begin with the ancient Greek philosophers, and then consider the contributions of European scholars from the Fifteenth through Nineteenth Centuries. Twentieth Century schools are discussed including: psychoanalysis, functionalism, structuralism, gestalt, behaviourism, and phenomenology. This course is restricted to 3rd and 4th year students in Specialist Programs in Psychology, Mental Health Studies and Psycholinguistics.", "code": "PSYC85H3"}, "PHLC20H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC20H3  Theory of Knowledge ", "exclusions": {"list": ["PHL332H"], "str": "PHL332H"}, "description": "A follow up to PHLB20H3. This course will consider one or two epistemological topics in depth, with an emphasis on class discussion.", "code": "PHLC20H3"}, "POLD01H3": {"description": "This course provides an opportunity to design and carry out individual or small-group research on a political topic. After class readings on the topic under study, research methods and design, and research ethics, students enter \"the field\" in Toronto. The seminar provides a series of opportunities to present and discuss their unfolding research.", "prerequisite": {"list": [], "str": "1.5 credits at the C-level in POL courses"}, "title": "POLD01H3  Research Seminar in Political Science ", "code": "POLD01H3"}, "PHYD01H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": [], "str": "14.0 credits, cumulative GPA of at least 2.5, and permission from the coordinator."}, "title": "PHYD01H3  Research Project in Physics and Astrophysics ", "exclusions": {"list": ["PHY478H", "PHY479Y1"], "str": "PHY478H, PHY479Y1"}, "description": "Introduces students to current research in physics or astrophysics under the supervision of a professorial faculty member. Students undertake an independent project that can be of a theoretical, computational or experimental nature. Evaluation is by the supervising faculty member in consultation with the course supervisor. Students must obtain consent of the course supervisor to enroll in this course.", "code": "PHYD01H3"}, "PSCB57H3": {"breath_req": "Quantitative Reasoning", "description": "Scientific computing is a rapidly growing field because computers can solve previously intractable problems and simulate natural processes governed by equations that do not have analytic solutions. During the first part of this course, students will learn numerical algorithms for various standard tasks such as root finding, integration, data fitting, interpolation and visualization. In the second part, students will learn how to model real-world systems from various branches of science. At the end of the course, students will be expected to write small programs by themselves. Assignments will regularly include programming exercises.", "prerequisite": {"list": ["MATA36H3", "MATA37H3"], "str": "[MATA36H3 or MATA37H3] and one A-level science course"}, "title": "PSCB57H3  Introduction to Scientific Computing ", "code": "PSCB57H3"}, "PSYD98Y3": {"description": "This course offers the opportunity to engage in a year long research project under the supervision of an interested member of the faculty in Psychology. The project will culminate in a written report in the form of a thesis and a poster presentation. During the course of the year, at appropriate times, students will meet to present their own research proposals, to appraise the proposals of others, and to discuss the results of their investigation. Students must first find a supervisor, which is usually confirmed before the start of the academic term in which the project will be initiated. Students will meet as a group with the coordinator as well as individually with their supervisor. This course is restricted to Specialists in Psychology and Mental Health Studies with a cumulative GPA of 3.3 or higher. Students planning to pursue graduate studies are especially encouraged to enrol in the course. Students must obtain a permission form from the Psychology departmental website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and submitted to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course. Students seeking supervision off campus will need to arrange co-supervision with a faculty member in Psychology at this campus.", "prerequisite": {"list": ["PSYB01H3", "PSYB07H3", "PSYC08H3"], "str": "PSYB01H3 and PSYB07H3 and PSYC08H3, Psychology or Mental Health Studies Specialist, cumulative GPA of 3.3 or higher.  Note:  Registration in D-level courses on ROSI is tentative. This is to ensure spaces in these courses for students who need them to graduate at the end of the current session. ROSI will show your status in the course and its final confirmation."}, "exclusions": {"list": ["NROD98Y3", "COGD10H3", "PSY400Y"], "str": "NROD98Y3, COGD10H3, PSY400Y"}, "title": "PSYD98Y3  Thesis in Psychology ", "code": "PSYD98Y3"}, "PSCD01H3": {"breath_req": "Social & Behavioural Sciences", "description": "Current issues involving physical science in modern society. Topics include: complex nature of the scientific method; inter-connection between theory, concepts and experimental data; characteristics of premature, pathological and pseudo-science; organization and funding of scientific research in Canada; role of communication and publishing; public misunderstanding of scientific method. These will be discussed using issues arising in chemistry, computer science, earth sciences, mathematics and physics.Note: Where PSCD01H3 is a Program requirement, it may be replaced by PHY341H with the approval of the Program supervisor. Prerequisite: Completion of at least one-half of the credits required in any one of the programs offered by the Department of Physical & Environmental Sciences.", "exclusions": {"list": ["PHY341H"], "str": "PHY341H"}, "title": "PSCD01H3  The Physical Sciences in Contemporary Society ", "code": "PSCD01H3"}, "PHYD28H3": {"breath_req": "Natural Sciences", "description": "A course introducing the basic concepts of magnetohydrodynamics (broadly defined as the hydrodynamics of magnetized fluids). Topics covered will include: the essentials of hydrodynamics, the magnetohydrodynamics (MHD) approximation, ideal and non-ideal MHD regimes, MHD waves and shocks, astrophysical and geophysical applications of MHD.", "prerequisite": {"list": ["PSCB57H3", "PHYC50H3", "MATC46H3"], "str": "PSCB57H3 and PHYC50H3 and MATC46H3"}, "title": "PHYD28H3  Introduction to Magnetohydrodynamics for Astrophysics and Geophysics ", "code": "PHYD28H3"}, "PHLC60H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC60H3  Metaphysics ", "exclusions": {"list": ["PHL331H", "PHL332H"], "str": "PHL331H, PHL332H (UTM only)"}, "description": "A follow up to PHLB60H3. This course will consider one or two metaphysical topics in depth, with an emphasis on class discussion.", "code": "PHLC60H3"}, "PSYD30H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB30H3", "PSYC35H3"], "str": "PSYB30H3 and PSYC35H3"}, "title": "PSYD30H3  Current Topics in Personality Psychology ", "exclusions": {"list": ["PSY430H"], "str": "PSY430H"}, "description": "An intensive examination of selected issues and research problems in personality psychology. The specific content will vary from year to year.", "code": "PSYD30H3"}, "PHLC72H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course will consider one or two topics in the Philosophy of Science in depth, with an emphasis on class discussion.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC72H3  Philosophy of Science ", "code": "PHLC72H3"}, "PSYC36H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB32H3"], "str": "PSYB32H3"}, "title": "PSYC36H3  Psychotherapy ", "exclusions": {"list": ["PSY343H"], "str": "PSY343H"}, "description": "This course will provide students with an introduction to prominent behavioural change theories (i.e. psychodynamic, cognitive/behavioural, humanist/existential) as well as empirical evidence on their efficacy. The role of the therapist, the patient and the processes involved in psychotherapy in producing positive outcomes will be explored.", "code": "PSYC36H3"}, "PHLA11H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Ethics is concerned with concrete questions about how we ought to treat one another as well as more general questions about how to justify our ethical beliefs. This course is an introduction that both presents basic theories of ethics and considers their application to contemporary moral problems.", "exclusions": {"list": ["PHL275H"], "str": "PHL275H"}, "title": "PHLA11H3  Introduction to Ethics ", "code": "PHLA11H3"}, "PSYC18H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3"], "str": "PSYB10H3"}, "title": "PSYC18H3  The Psychology of Emotion ", "exclusions": {"list": ["PSY331H", "PSY394H", "PSY494H"], "str": "PSY331H, (PSY394H), PSY494H"}, "description": "Emotion is examined in everyday life and in relation to the arts. The focus of this course is on a contrast between action and experience oriented approaches to emotion. An effort is made to synthesize the many theories of emotion coming from psychoanalysis, functionalism, behaviourism, social constructionism, and phenomenology.", "code": "PSYC18H3"}, "PHLB31H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A survey of some main themes and figures of ancient philosophical thought, concentrating on Plato and Aristotle. Topics include the ultimate nature of reality, knowledge, and the relationship between happiness and virtue.", "exclusions": {"list": ["PHL200Y", "PHL202H"], "str": "PHL200Y, PHL202H"}, "title": "PHLB31H3  Introduction to Ancient Philosophy ", "code": "PHLB31H3"}, "PHYD38H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYC54H3"], "str": "PHYC54H3"}, "title": "PHYD38H3  Nonlinear Systems and Chaos ", "exclusions": {"list": ["PHY460H"], "str": "PHY460H"}, "description": "The theory of nonlinear dynamical systems with applications to many areas of physics and astronomy. Topics include stability, bifurcations, chaos, universality, maps, strange attractors and fractals. Geometric, analytical and computational methods will be developed.", "code": "PHYD38H3"}, "POLC72H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "The course investigates the concept of political liberty in various traditions of political thought, especially liberalism, republicanism, and Marxism. The course will investigate key studies by such theorists as Berlin, Taylor, Skinner, Pettit, and Cohen, as well as historical texts by Cicero, Machiavelli, Hobbes, Hegel, Constant, Marx, and Mill.Area of Focus: Political Theory", "prerequisite": {"list": ["POLB72H3", "POLB70H3", "POLB71H3"], "str": "POLB72H3 or (POLB70H3) or (POLB71H3)"}, "title": "POLC72H3  Liberty ", "code": "POLC72H3"}, "PHLC03H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of some current issues concerning the various forms of art such as: the role of the museum, the loss of beauty and the death of art.", "prerequisite": {"list": ["PHLB03H3"], "str": "Any 4.5 credits and [PHLB03H3 and an additional 1.0 credit in PHL courses]"}, "title": "PHLC03H3  Topics in the Philosophy of Art ", "code": "PHLC03H3"}, "PSYC90H3": {"description": "An intensive research project intended to provide laboratory/field experience in data collection and analysis. The project must be completed over 2 consecutive terms.These courses provide an opportunity to engage in research in an area after completing basic coverage in regularly scheduled courses. The student must demonstrate a background adequate for the project proposed and should present a clear rationale to prospective supervisors. Regular consultation with the supervisor is necessary, and extensive data collection and analysis will be required. Such a project will culminate in a written research report.Students must first find a supervisor before the start of the academic term in which the project will be initiated. They must then obtain a permission form from the Department of Psychology's website (www.utsc.utoronto.ca/psych/undergraduates) that is to be completed and signed by the intended supervisor, and returned to the Psychology Office. At that time, the student will be provided with an outline of the schedule and general requirements for the course, including the structure of the required log-book.Students seeking supervision off campus are further advised to check the appropriateness of the proposed advisor with the Program Supervisor. If the proposed supervisor is not appointed to the Psychology faculty at UTSC then a secondary advisor, that is appointed at UTSC, will be required.", "prerequisite": {"list": [], "str": "3.0 full credits in Psychology and permission of the proposed supervisor.  Note:  Normally students need a cumulative GPA of at least 2.7 for permission to be granted.)"}, "exclusions": {"list": ["COGC91H3", "NROC90H3", "PSY303H", "PSY304H"], "str": "COGC91H3, NROC90H3, PSY303H, PSY304H"}, "title": "PSYC90H3  Supervised Study in Psychology ", "code": "PSYC90H3"}, "PSYD13H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYC13H3", "PSYC18H3", "PSYC19H3"], "str": "PSYB10H3 and [PSYC13H3 or PSYC18H3 or PSYC19H3]"}, "title": "PSYD13H3  The Psychology of Emotion Regulation ", "exclusions": {"list": ["PSYD15H3"], "str": "PSYD15H3 (if taken in Winter 2017)"}, "description": "This seminar offers an in depth introduction to the recent scientific literature on how humans manage and control their emotions (emotion regulation). We will explore why, and how, people regulate emotions, how emotion regulation differs across individuals and cultures, and the influence that emotion regulation has upon mental, physical, and social well-being.", "code": "PSYD13H3"}, "PMDC54Y3": {"breath_req": "Natural Sciences", "description": "Combines theory, lab and field application. New concepts of paediatric trauma and Basic Trauma Life Support will be added to the skill and knowledge base. Students will be guided to develop a final portfolio demonstrating experiences, reflection and leadership. Students must pass each component (theory, lab and field) of the course to be successful. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDC40H3", "PMDC42Y3", "PMDC43H3"], "str": "PMDC40H3 and PMDC42Y3 and PMDC43H3"}, "title": "PMDC54Y3  Pre-hospital Care 4: Theory, Lab and Field ", "code": "PMDC54Y3"}, "PPGC67H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] or 1.5 credits at the B-level in CIT courses]"}, "title": "PPGC67H3  Public Policy in Canada ", "exclusions": {"list": ["POLC67H3"], "str": "(POLC67H3)"}, "description": "This course is a survey of contemporary patterns of public policy in Canada. Selected policy studies including managing the economy from post-war stabilization policies to the rise of global capitalism, developments in the Canadian welfare state and approaches to external relations and national security in the new international order.Areas of Focus: Canadian Government and Politics; Public Policy", "code": "PPGC67H3"}, "PSYC10H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the psychology of judgment and decision making, incorporating perspectives from social psychology, cognitive psychology, and behavioral economics. Understanding these topics will allow students to identify errors and systematic biases in their own decisions, and improve their ability to predict and influence the behavior of others.", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB01H3", "PSYB04H3", "PSYB10H3", "PSYB57H3", "PSYC57H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and [PSYB01H3 or PSYB04H3] and [PSYB10H3 or PSYB57H3 or PSYC57H3]"}, "title": "PSYC10H3  Judgment and Decision Making ", "code": "PSYC10H3"}, "POLC96H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines the origins of, and political dynamics within, states in the contemporary Middle East. The first part of the course analyses states and state formation in historical perspective - examining the legacies of the late Ottoman and, in particular, the colonial period, the rise of monarchical states, the emergence of various forms of \"ethnic\" and/or \"quasi\" democracies, the onset of \"revolutions from above\", and the consolidation of populist authoritarian states. The second part of the course examines the resilience of the predominantly authoritarian state system in the wake of socio-economic and political reform processes.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3", "POLB91H3", "POLB92H3"], "str": "POLB90H3 and [POLB91H3 or POLB92H3]"}, "title": "POLC96H3  State Formation and Authoritarianism in the Middle East ", "code": "POLC96H3"}, "PSYB64H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB64H3  An Introduction to Physiological Psychology ", "exclusions": {"list": ["NROC61H3", "PSY290H"], "str": "NROC61H3, PSY290H"}, "description": "A survey of the biological mechanisms underlying fundamental psychological processes. Topics include the biological basis of motivated behaviour (e.g., emotional, ingestive, sexual, and reproductive behaviours; sleep and arousal), sensory processes and attention, learning and memory, and language.", "code": "PSYB64H3"}, "PSYD51H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB51H3", "NROC64H3"], "str": "PSYB51H3 and [[0.5 credit from the PSYC50-series of courses] or NROC64H3]"}, "title": "PSYD51H3  Current Topics in Perception ", "exclusions": {"list": ["PSYD54H3"], "str": "PSYD54H3"}, "description": "This course provides an intensive examination of selected topics in recent research on perception. Topics may include research in vision, action, touch, hearing and multisensory integration. Selected readings will cover psychological and neuropsychological findings, neurophysiological results, synaesthesia and an introduction to the Bayesian mechanisms of multisensory integration.", "code": "PSYD51H3"}, "PSYD12H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYC12H3", "PSYC14H3"], "str": "PSYB10H3 and [PSYC12H3 or PSYC14H3]"}, "title": "PSYD12H3  Social Psychology of the Self ", "exclusions": {"list": ["PSY326H", "PSY420H"], "str": "PSY326H, PSY420H"}, "description": "This seminar explores the topic of the self from an experimental social-psychological perspective, including an in depth analysis of the fundamental processes of the \"hyphenated self\": self-knowledge, self-esteem, self-regulation, for just a few examples. This course is designed to not only introduce students to much of the important theory and research in the social psychology of the self, but also to develop critical thinking skills.", "code": "PSYD12H3"}, "PHLB12H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Philosophical issues about sex and sexual identity in the light of biological, psychological and ethical theories of sex and gender; the concept of gender; male and female sex roles; perverse sex; sexual liberation; love and sexuality.", "exclusions": {"list": ["PHL243H"], "str": "PHL243H"}, "title": "PHLB12H3  Philosophy of Sexuality ", "code": "PHLB12H3"}, "PSYD24H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYC21H3", "PLIC24H3", "PSYB20H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and [PSYC21H3 or PLIC24H3 or PSYB20H3] and [an addtional 0.5 credit at the C-level in PSY courses]"}, "title": "PSYD24H3  Perceptual and Motor Development ", "exclusions": {"list": ["PSY410H"], "str": "PSY410H"}, "description": "An in-depth examination of aspects related to perceptual and motor development in infancy and childhood. The topics to be covered will be drawn from basic components of visual and auditory perception, multisensory integration, and motor control, including reaching, posture, and walking. Each week, students will read a set of experimental reports, and will discuss these readings in class. The format of this course is seminar-discussion. ", "code": "PSYD24H3"}, "POLC59H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3"], "str": "POLB50Y3 or equivalent "}, "title": "POLC59H3  The Vice-Regal Office in Canada: Champlain to Prorogation 2012 ", "exclusions": {"list": ["POLC40H3"], "str": "POLC40H3 (if taken in 2014-Winter or 2015-Winter sessions)"}, "description": "Who are we as a people today? What role have consecutive vice regals played in more than 400 years of shaping our nation and its institutions? This course examines how the vice regal position in general, and how selected representatives in particular, have shaped Canadas political system Areas of Focus: Canadian Government and Politics", "code": "POLC59H3"}, "PSYD37H3": {"breath_req": "Natural Sciences", "description": "This course is an opportunity to explore how social practices and ideas contribute to the ways in which society, families and individuals are affected by mental health and mental illness.", "prerequisite": {"list": [], "str": "10.0 credits completed and enrolment in the Combined BSc in Mental Health Studies/Masters of Social Work or Specialist/Specialist-Co-op programs in Mental Health Studies"}, "title": "PSYD37H3  Social Context of Mental Health and Illness ", "code": "PSYD37H3"}, "PHLC93H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course will examine some contemporary debates in recent political philosophy. Topics discussed may include the nature of justice, liberty and the criteria of good government, and problems of social coordination.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Value Theory area of focus  see Table 1.0 for reference]"}, "title": "PHLC93H3  Topics in Political Philosophy ", "code": "PHLC93H3"}, "PHLC51H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["PHLB50H3", "CSCB36H3", "MATB24H3", "MATB43H3"], "str": "PHLB50H3 or CSCB36H3 or MATB24H3 or MATB43H3"}, "title": "PHLC51H3  Symbolic Logic II ", "exclusions": {"list": ["MATC09H3", "PHL345H"], "str": "MATC09H3, PHL345H"}, "description": "After consolidating the material from Symbolic Logic I, we will introduce necessary background for metalogic, the study of the properties of logical systems. We will introduce set theory, historically developed in parallel to logic. We conclude with some basic metatheory of the propositional logic learned in Symbolic Logic I.", "code": "PHLC51H3"}, "PHLD20H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This courses addresses core issues in the theory of knowledge at an advanced level. Topics to be discussed may include The Nature of Knowledge, Scepticism, Epistemic Justification, Rationality and Rational Belief Formation.", "prerequisite": {"list": ["PHLC20H3", "PHLC22H3"], "str": "3.5 credits in PHL courses, including [[PHLC20H3 or PHLC22H3] and 0.5 credit at the C-level]"}, "title": "PHLD20H3  Advanced Seminar in Theory of Knowledge ", "code": "PHLD20H3"}, "PHLD99H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD99H3  Independent Study ", "code": "PHLD99H3"}, "PSYC14H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB10H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB10H3 and [an additional 0.5 credit at the B-level in PSY courses]"}, "title": "PSYC14H3  Cross-Cultural Social Psychology ", "exclusions": {"list": ["PSY321H"], "str": "PSY321H"}, "description": "A survey of the role of culture in social thought and behaviour. The focus is on research and theory that illustrate ways in which culture influences behaviour and cognition about the self and others, emotion and motivation. Differences in individualism and collectivism, independence and interdependence as well as other important orientations that differ between cultures will be discussed. Social identity and its impact on acculturation in the context of immigration will also be explored.", "code": "PSYC14H3"}, "POLB30H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLB30H3  Law, Justice and Rights ", "exclusions": {"list": ["PHLB11H3", "PHLB11H3", "POLB30H3", "PHLB11H3", "POLB30H3"], "str": "PHLB11H3 (students who have taken PHLB11H3 prior to POLB30H3 may count PHLB11H3 in place of POLB30H3 in the Minor in Public Law)"}, "description": "This is a lecture course that helps students understand the theoretical justifications for the rule of law. We will study different arguments about the source and limitations of law: natural law, legal positivism, normative jurisprudence and critical theories. The course will also examine some key court cases in order to explore the connection between theory and practice. This is the foundation course for the Minor program in Public Law.Area of Focus: Political Theory", "code": "POLB30H3"}, "PSYC54H3": {"breath_req": "Natural Sciences", "description": "Recent research on the psychology of representation, in pictures, words, metaphors, analogies and symbols. Topics will include developmental and cross-cultural research on children's drawing, the perception of pictures by the sighted, and blind people identifying raised pictures. It will also include studies on children and adults using literal and non-literal representation, including metaphors, similes, and analogies. It will include cross-cultural research on forms used as symbols, and studies on children and machines using symbols. Teaching method will be lectures and demonstrations.", "prerequisite": {"list": ["PSYB07H3", "SOCB06H3", "STAB22H3"], "str": "[PSYB07H3 or (SOCB06H3) or STAB22H3] and a PSYB20-series or a PSYB50-series half-credit"}, "title": "PSYC54H3  Cognition and Representation ", "code": "PSYC54H3"}, "PSCD50H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYC56H3", "CHMC20H3", "CHMC25H3"], "str": "Any one of the following courses [PHYC56H3 or CHMC20H3 or CHMC25H3]"}, "title": "PSCD50H3  Advanced Topics in Quantum Mechanics ", "exclusions": {"list": ["PHY456H", "CHM423H", "CHM421H", "JCP421H"], "str": "PHY456H, CHM423H, CHM421H, JCP421H"}, "description": "This course provides exposure to a variety of theoretical concepts and practical methods for treating various problems in quantum mechanics. Topics include perturbation theory, variational approach, adiabatic approximation, mean field approximation, Hamiltonian symmetry implementation, light-matter interaction, second quantization.", "code": "PSCD50H3"}, "PSYD32H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB30H3", "PSYB32H3"], "str": "PSYB30H3 and PSYB32H3 plus 0.5 credit at the C-level in PSY"}, "title": "PSYD32H3  Personality Disorders ", "exclusions": {"list": ["PSY430H"], "str": "PSY430H"}, "description": "This course reviews the latest research on the causes, longitudinal development, assessment, and treatment of personality disorders. Students will learn the history of personality disorders and approaches to conceptualizing personality pathology. Topics covered include \"schizophrenia-spectrum\" personality disorders, biological approaches to psychopathy, and dialectical behaviour therapy for borderline personality disorder.", "code": "PSYD32H3"}, "PSYC26H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3", "PSYB20H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and PSYB20H3"}, "title": "PSYC26H3  Developmental Psychology Laboratory ", "exclusions": {"list": ["PSY319H"], "str": "PSY319H"}, "description": "This course introduces conceptual and practical issues concerning research in developmental psychology. Developmental psychology focuses on the process of change within and across different phases of the life-span. Reflecting the broad range of topics in this area, there are diverse research methods, including techniques for studying infant behaviour as well as procedures for studying development in children, adolescents, and adults. This course will cover a representative sample of some of these approaches.", "code": "PSYC26H3"}, "PHLD91H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD91H3  Independent Study ", "code": "PHLD91H3"}, "PHLD98H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD98H3  Independent Study ", "code": "PHLD98H3"}, "POLD59H3": {"breath_req": "Social & Behavioural Sciences", "description": "An in-depth analysis of the place and rights of disabled persons in contemporary society. Course topics include historic, contemporary, and religious perspectives on persons with disabilities; the political organization of persons with disabilities; media presentation of persons with disabilities; and the role of legislatures and courts in the provision of rights of labour force equality and social service accessibility for persons with disabilities.Area of Focus: Canadian Government and Politics", "prerequisite": {"list": [], "str": "8.0 credits, of which at least 1.5 credits must be at the C- or D-level"}, "title": "POLD59H3  Politics of Disability ", "code": "POLD59H3"}, "PSYC05H3": {"breath_req": "Natural Sciences", "description": "In this course students will be introduced to the study of human movement across a range of topics (e.g., eye-movements, balance, and walking), and will have the opportunity to collect and analyze human movement data. Additional topics include basic aspects of experimental designs, data analysis and interpretation of such data.", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB22H3 or STAB23H3]"}, "title": "PSYC05H3  Human Movement Laboratory ", "code": "PSYC05H3"}, "PHLD78H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This advanced seminar will delve more deeply into an issue in political philosophy. Topics will vary from year to year, but some examples include: distributive justice, human rights, and the political morality of freedom. Students will be required to present material to the class at least once during the semester.", "prerequisite": {"list": [], "str": "3.5 credits in PHL courses, including 1.0 credit at the C-level"}, "title": "PHLD78H3  Advanced Seminar in Political Philosophy ", "code": "PHLD78H3"}, "PSYB03H3": {"breath_req": "Quantitative Reasoning", "description": "The course will provide introductory knowledge and hands-on training in computer-based implementations of experimental design, data processing and result interpretation in psychology. The course covers implementations of experimental testing paradigms, computational explorations of empirical data structure and result visualization with the aid of specific programming tools (e.g., Matlab).", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB03H3  Introduction to Computers in Psychological Research ", "code": "PSYB03H3"}, "PHLC86H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Advance Issues in the Philosophy of Mind. For example, an examination of arguments for and against the idea that machines can be conscious, can think, or can feel. Topics may include: Turing's test of machine intelligence, the argument based on Gödel's theorem that there is an unbridgeable gulf between human minds and machine capabilities, Searle's Chinese Room thought experiment.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus see Table 1.0 for reference]"}, "title": "PHLC86H3  Issues in the Philosophy of Mind ", "code": "PHLC86H3"}, "POLD51H3": {"breath_req": "Social & Behavioural Sciences", "description": "This seminar course explores selected issues of Canadian politics from a comparative perspective. The topics in this course vary depending on the instructor.Areas of Focus: Canadian Government and Politics; Comparative Politics", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] and [1.5 credits at the C-level in POL courses]"}, "title": "POLD51H3  Topics in Canadian and Comparative Politics ", "code": "POLD51H3"}, "POLC98H3": {"breath_req": "Social & Behavioural Sciences", "description": "The course explains why financial markets exist, and their evolution, by looking at the agents, actors and institutions which generate demand for them. We also consider the consequences of increasingly integrated markets, the causes of systemic financial crises, as well as the implications and feasibility of regulation.Area of Focus: International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "POLB80H3 and POLB81H3"}, "title": "POLC98H3  International Political Economy of Finance ", "code": "POLC98H3"}, "POLD09H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB80H3", "POLB81H3"], "str": "[POLB80H3 and POLB81H3] and [1.5 credits at the C-level in POL or IDS courses]"}, "title": "POLD09H3  International Relations of Ethnic Conflict ", "exclusions": {"list": ["POL466H"], "str": "POL466H"}, "description": "This course explores the internationalization of ethnic conflict and the international drivers of civil war. It covers diaspora politics, contagion and demonstration effects, regional security complexes, separatism and irredentism, and the use of sanctions and international interventions. The class involves discussions, problem-solving exercises, and teamwork. Area of Focus: International Relations", "code": "POLD09H3"}, "PHLC35H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the History of Philosophy area of focus  see Table 1.0 for reference] "}, "title": "PHLC35H3  Topics in Early Modern Philosophy: Rationalism ", "exclusions": {"list": ["PHL310H"], "str": "PHL310H"}, "description": "In this course we study the major figures of early modern rationalism, Descartes, Spinoza, and Leibniz, with a particular emphasis on topics such as substance, knowledge and sense perception, the mind-body problem, and the existence and nature of God.", "code": "PHLC35H3"}, "PHLC89H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Advanced topic(s) in Analytic Philosophy. Sample contemporary topics: realism/antirealism; truth; interrelations among metaphysics, epistemology, philosophy of mind and of science.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Mind, Metaphysics and Epistemology area of focus  see Table 1.0 for reference]"}, "title": "PHLC89H3  Topics in Analytic Philosophy ", "code": "PHLC89H3"}, "PSYB57H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB57H3  Introduction to Cognitive Psychology ", "exclusions": {"list": ["PSY270H"], "str": "PSY270H"}, "description": "A discussion of theories and experiments examining human cognition. This includes the history of the study of human information processing and current thinking about mental computation. Topics covered include perception, attention, thinking, memory, visual imagery, language and problem solving.", "code": "PSYB57H3"}, "PHLD95H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD95H3  Independent Study ", "code": "PHLD95H3"}, "PHLB13H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "What is feminism? What is a woman? Or a man? Are gender relations natural or inevitable? Why do gender relations exist in virtually every society? How do gender relations intersect with other social relations, such as economic class, culture, race, sexual orientation, etc.?", "exclusions": {"list": ["PHL267H"], "str": "PHL267H"}, "title": "PHLB13H3  Philosophy and Feminism ", "code": "PHLB13H3"}, "PSYA02H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course provides a general overview of topics including language, intelligence, development, motivation and emotion, personality, social psychology, stress, mental disorders and treatments of mental disorders. The most influential findings from each of these areas will be highlighted.", "exclusions": {"list": ["PSY100H", "PSY100Y", "PSY102H"], "str": "PSY100H, PSY100Y, (PSY102H)"}, "title": "PSYA02H3  Introductory Psychology: Part II ", "code": "PSYA02H3"}, "PHYC54H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYB54H3", "MATB44H3"], "str": "PHYB54H3, MATB44H3"}, "title": "PHYC54H3  Classical Mechanics ", "exclusions": {"list": ["PHY354H"], "str": "PHY354H"}, "description": "A course that will concentrate in the study of symmetry and conservation laws, stability and instability, generalized co-ordinates, Hamiltons principle, Hamiltons equations, phase space, Liouvilles theorem, canonical transformations, Poisson brackets, Noethers theorem.", "code": "PHYC54H3"}, "PHLD43H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["PHLC43H3"], "str": "3.5 credits in PHL courses, including [PHLC43H3 and 0.5 credit at the C-level]"}, "title": "PHLD43H3  Advanced Seminar in History of Analytic Philosophy ", "exclusions": {"list": ["PHL325H", "PHLC44H3"], "str": "PHL325H, (PHLC44H3)"}, "description": "This course examines Analytic Philosophy in the mid-20th century, concentrating on Wittgenstein, Ramsey, Carnap, and Quine. Special attention paid to the metaphysical foundations of logic, and the nature of linguistic meaning, including the relations between \"truth-conditional\" and \"verificationist\" theories.", "code": "PHLD43H3"}, "PHLD90H3": {"description": "These courses are intended for qualified students who wish to engage in advanced level work on a well-defined topic of their choice. These courses are only available with the prior arrangement of an instructor.", "title": "PHLD90H3  Independent Study ", "code": "PHLD90H3"}, "PSYC03H3": {"breath_req": "Quantitative Reasoning", "description": "The course will provide advanced knowledge and hands-on training in computer-based implementations of experimental design, data processing and result interpretation in psychology. The course covers implementations of experimental testing paradigms, computational explorations of empirical data structure, and result visualization with the aid of specific programming tools (e.g., Matlab).", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB03H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB03H3"}, "title": "PSYC03H3  Computers in Psychological Research: Advanced Topics ", "code": "PSYC03H3"}, "POLC57H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3", "POLC54H3"], "str": "[POLB50Y3 or equivalent] and POLC54H3"}, "title": "POLC57H3  Intergovernmental Relations and Public Policy ", "exclusions": {"list": ["POL316Y"], "str": "POL316Y"}, "description": "This course examines intergovernmental relations in various areas of public policy and their effects on policy outcomes. It evaluates how federalism affects the capacity of Canadians to secure desirable social, economic, environmental and trade policies. Lecture-seminar format.Areas of Focus: Canadian Government and Politics; Public Policy", "code": "POLC57H3"}, "PSYD35H3": {"breath_req": "Natural Sciences", "description": "This course reviews the psychopharmacological strategies used for addressing a variety of mental health conditions including anxiety, depression, psychosis, impulsivity, and dementia. It will also address the effects of psychotropic drugs on patients or clients referred to mental health professionals for intellectual, neuropsychological and personality testing. Limitations of pharmacotherapy and its combinations with psychotherapy will be discussed.", "prerequisite": {"list": ["PSYB65H3", "PSYC62H3"], "str": "PSYB65H3 and PSYC62H3"}, "title": "PSYD35H3  Clinical Psychopharmacology ", "code": "PSYD35H3"}, "POLD98H3": {"description": "Advanced reading in special topics. This course is meant only for those students who, having completed the available basic courses in a particular field of Political Science, wish to pursue further intensive study on a relevant topic of special interest. Students are advised that they must obtain consent from the supervising instructor before registering for this course.", "prerequisite": {"list": [], "str": "Permission of the instructor."}, "exclusions": {"list": ["POL495Y"], "str": "POL495Y"}, "title": "POLD98H3  Supervised Reading ", "code": "POLD98H3"}, "POLD02Y3": {"description": "This course provides an opportunity to carry out individual research on a Political Science topic. After class readings on the topic under study, research methods and design, and research ethics, students will propose and carry out their own research project. The seminar provides opportunities to present and discuss their unfolding research, as well as to present the findings of their research.", "prerequisite": {"list": [], "str": "A minimum 3.3 CGPA in Political Science courses and permission of the instructor; Restricted to students in the 4th year of the Specialist in Political Science program"}, "title": "POLD02Y3  Senior Research Seminar in Political Science ", "code": "POLD02Y3"}, "PMDB22H3": {"breath_req": "Social & Behavioural Sciences", "description": "Allows students to develop the critical thinking skills and problem solving approaches needed to provide quality pre-hospital emergency care. Emphasizes the components of primary and second assessment, and the implementation of patient care based on interpretation of assessment findings. Discusses principles of physical and psycho-social development, and how these apply to the role of the paramedic. Students must pass each component (theory and lab) of the course to be successful. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["BIOA01H3", "BIOA02H3"], "str": "BIOA01H3 and BIOA02H3"}, "title": "PMDB22H3  Pre-hospital Care 1: Theory and Lab ", "code": "PMDB22H3"}, "PHLB07H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "What is the difference between right and wrong? What is 'the good life'? What is well-being? What is autonomy? These notions are central in ethical theory, law, bioethics, and in the popular imagination. In this course we will explore these concepts in greater depth, and then consider how our views about them shape our views about ethics.", "title": "PHLB07H3  Ethics ", "code": "PHLB07H3"}, "POLC69H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course provides an introduction to the various schools of thought in Political Economy, including classical, rational choice, institutionalist and constructivist theories. We draw from both International and Comparative Political Economy when exploring empirical topics such as the political economy of the environment and trade. Areas of Focus: Comparative Politics; International Relations", "prerequisite": {"list": ["POLB80H3", "POLB81H3", "POLB90H3", "POLB91H3", "POLB92H3"], "str": "[1.0 credit from: POLB80H3, POLB81H3, POLB90H3, POLB91H3, POLB92H3]"}, "title": "POLC69H3  Political Economy: International and Comparative Perspectives ", "code": "POLC69H3"}, "POLD53H3": {"breath_req": "Social & Behavioural Sciences", "description": "Why do Canadians disagree in their opinions about abortion, same-sex marriage, crime and punishment, welfare, taxes, immigration, the environment, religion, and many other subjects? This course examines the major social scientific theories of political disagreement and applies these theories to an analysis of political disagreement in Canada. Area of Focus: Canadian Government and Politics", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] and [1.5 credits at the C-level in POL courses]"}, "title": "POLD53H3  Political Disagreement in Canada ", "code": "POLD53H3"}, "PSYD17H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYC12H3", "PSYB64H3", "PSYB65H3"], "str": "PSYC12H3 and [PSYB64H3 or PSYB65H3]"}, "title": "PSYD17H3  Social Neuroscience ", "exclusions": {"list": ["PSY473H", "PSY373H"], "str": "PSY473H, (PSY373H)"}, "description": "This course provides an overview of the emerging field of social neuroscience. It explores how integrating theory and methods from cognitive psychology, physiology, and neuroscience can be used to address fundamental questions in social psychology and, ultimately, broaden our understanding of mind, brain, and behaviour in a social world.", "code": "PSYD17H3"}, "PSYB10H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB10H3  Introduction to Social Psychology ", "exclusions": {"list": ["PSY220H"], "str": "PSY220H"}, "description": "Surveys a wide range of phenomena relating to social behaviour.Social Psychology is the study of how feelings, thoughts, and behaviour are influenced by the presence of others. The course is designed to explore social behaviour and to present theory and research that foster its understanding.", "code": "PSYB10H3"}, "PHYC83H3": {"breath_req": "Natural Sciences", "description": "An introduction to the basic principles and mathematics of General Relativity. Tensors will be presented after a review of Special Relativity. The metric, spacetime, curvature, and Einstein's field equations will be studied and applied to the Schwarzschild solution. Further topics include the Newtonian limit, classical tests, and black holes.", "prerequisite": {"list": ["MATB42H3", "MATB44H3", "PHYB54H3"], "str": "MATB42H3 and MATB44H3 and PHYB54H3"}, "title": "PHYC83H3  Introduction to General Relativity ", "code": "PHYC83H3"}, "PSYD11H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYC12H3", "PSYC14H3"], "str": "PSYB10H3 and [PSYC12H3 or PSYC14H3]"}, "title": "PSYD11H3  Psychology of Interpersonal Relationships ", "exclusions": {"list": ["PSY420H", "PSY424H", "PSYD15H3"], "str": "PSY420H, PSY424H, (PSY324), PSYD15H3 if taken in Fall 2010, Winter 2011, or Summer 2011."}, "description": "This course focuses on social psychological theory and research pertaining to close interpersonal relationships. The course will cover topics including perceptions of and interactions within close relationships, development and maintenance of relationships, and relationship conflict and dissolution.", "code": "PSYD11H3"}, "PSYC09H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and an additional 0.5 credit at the B-level in Psychology"}, "title": "PSYC09H3  Applied Multiple Regression in Psychology ", "exclusions": {"list": ["MGEC11H3"], "str": "MGEC11H3"}, "description": "An introduction to multiple regression and its applications in psychological research. The course covers the data analysis process from data collection to interpretation: how to deal with missing data, the testing of assumptions, addressing problem of multicolinearity, significance testing, and deciding on the most appropriate model. Several illustrative data sets will be explored in detail. The course contains a brief introduction to factor analysis. The goal is to provide the students with the skills and understanding to conduct and interpret data analysis in non-experimental areas of psychology.", "code": "PSYC09H3"}, "PSYC56H3": {"breath_req": "Natural Sciences", "description": "Studies the perceptual and cognitive processing involved in musical perception and performance. This class acquaints students with the basic concepts and issues involved in the understanding of musical passages. Topics will include discussion of the physical and psychological dimensions of sound, elementary music theory, pitch perception and melodic organization, the perception of rhythm and time, musical memory, musical performance, and emotion and meaning in music.", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3", "PSYB07H3", "STAB22H3", "STAB23H3"], "str": "[PSYA01H3 and PSYA02H3] and [PSYB07H3 or STAB22H3 or STAB23H3] and [an addtional 0.5 credit from the PSYB50-series courses]"}, "title": "PSYC56H3  Music Cognition ", "code": "PSYC56H3"}, "POLB91H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB90H3", "POLB90H3", "POLB91H3"], "str": "POLB90H3  Note: It is strongly recommended that students take POLB90H3 and POLB91H3 in consecutive sessions."}, "title": "POLB91H3  Comparative Development in Political Perspective ", "exclusions": {"list": ["POL201Y"], "str": "POL201Y"}, "description": "This course examines the role of politics and the state in the processes of development in less developed countries. Topics include the role of the military and bureaucracy, the relationship between the state and the economy, and the role of religion and ethnicity in politics.Area of Focus: Comparative Politics", "code": "POLB91H3"}, "PSYB55H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PSYA01H3", "PSYA02H3"], "str": "PSYA01H3 and PSYA02H3"}, "title": "PSYB55H3  Introduction to Cognitive Neuroscience ", "exclusions": {"list": ["PSYC55H3", "PSY493H"], "str": "PSYC55H3, PSY493H"}, "description": "The course explores how the brain gives rise to the mind. It examines the role of neuroimaging tools and brain-injured patients in helping to uncover cognitive networks. Select topics include attention, memory, language, motor control, decision-making, emotion, and executive functions.", "code": "PSYB55H3"}, "PHYD26H3": {"breath_req": "Natural Sciences", "description": "A course introducing some of the key physical processing governing the evolution of planets and moons. Topics covered will include: planetary heat sources and thermal evolution, effects of high temperature and pressure in planetary interiors, planetary structure and global shape; gravity, rotation, composition and elasticity.", "prerequisite": {"list": [], "str": "Completion of at least 1.0 credit at the C-level in PHY or AST courses"}, "title": "PHYD26H3  Planetary Geophysics ", "code": "PHYD26H3"}, "PHLB02H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines ethical issues raised by our actions and our policies for the environment. Do human beings stand in a moral relationship to the environment? Does the environment have moral value and do non-human animals have moral status? These fundamental questions underlie more specific contemporary issues such as sustainable development, alternative energy, and animal rights.", "exclusions": {"list": ["PHL273H"], "str": "PHL273H"}, "title": "PHLB02H3  Environmental Ethics ", "code": "PHLB02H3"}, "POLC94H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course explores the gendered impact of economic Globalization and the various forms of resistance and mobilization that women of the global south have engaged in their efforts to cope with that impact. The course pays particular attention to regional contextual differences (Latin America, Africa, Asia and the Middle East) and to the perspectives of global south women, both academic and activist, on major development issues.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3"], "str": "POLB90H3"}, "title": "POLC94H3  Globalization, Gender and Development ", "code": "POLC94H3"}, "PSYA01H3": {"breath_req": "Natural Sciences", "description": "This course provides a general overview of topics including research techniques in psychology, evolutionary psychology, the biology of behaviour, learning and behaviour, sensation, perception, memory and consciousness. The most influential findings from each of these areas will be highlighted.", "exclusions": {"list": ["PSY100H", "PSY100Y", "PSY101H"], "str": "PSY100H, PSY100Y, (PSY101H)"}, "title": "PSYA01H3  Introductory Psychology: Part I ", "code": "PSYA01H3"}, "POLC97H3": {"breath_req": "Social & Behavioural Sciences", "description": "This course examines various forms of protest politics in the contemporary Middle East. The course begins by introducing important theoretical debates concerning collective action in the region - focusing on such concepts as citizenship, the public sphere, civil society, and social movements. The second part of the course examines case studies of social action - examining the roles played by crucial actors such as labour, the rising Islamist middle classes/bourgeoisie, the region's various ethnic and religious minority groups, and women who are entering into the public sphere in unprecedented numbers. The course concludes by examining various forms of collective and non-collective action in the region from Islamist social movements to everyday forms of resistance.Area of Focus: Comparative Politics", "prerequisite": {"list": ["POLB90H3", "POLB91H3", "POLB92H3"], "str": "POLB90H3 and [POLB91H3 or POLB92H3]"}, "title": "POLC97H3  Protest Politics in the Middle East ", "code": "POLC97H3"}, "PSYD18H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3"], "str": "PSYB10H3 plus two C-level half-credit in PSY"}, "title": "PSYD18H3  Psychology of Gender ", "exclusions": {"list": ["PSY323H"], "str": "PSY323H"}, "description": "This course focuses on theory and research pertaining to gender and gender roles. The social psychological and social-developmental research literature concerning gender differences will be critically examined. Other topics also will be considered, such as gender-role socialization.", "code": "PSYD18H3"}, "POLC70H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB72H3", "PHLB17H3"], "str": "POLB72H3 or PHLB17H3"}, "title": "POLC70H3  Political Thought: Foundations of Justice, Citizenship and Power ", "exclusions": {"list": ["POL200Y", "POLB70H3"], "str": "POL200Y, (POLB70H3)"}, "description": "This course introduces students to central concepts in political theory, such as justice, rights, and the state. Readings will include classical and medieval texts, such as Plato's Republic and Aristotle's Politics.Area of Focus: Political Theory", "code": "POLC70H3"}, "PSYD15H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB10H3", "PSYC12H3", "PSYC14H3"], "str": "PSYB10H3 and [PSYC12H3 or PSYC14H3]"}, "title": "PSYD15H3  Current Topics in Social Psychology ", "exclusions": {"list": ["PSY326H", "PSY420H"], "str": "PSY326H, PSY420H"}, "description": "An intensive examination of selected issues and research problems in social psychology.", "code": "PSYD15H3"}, "PSCD11H3": {"breath_req": "Arts, Literature & Language", "prerequisite": {"list": [], "str": "Any 14.5 credits"}, "title": "PSCD11H3  Communicating Science: Film, Media, Journalism, and Society ", "exclusions": {"list": ["PSCA01H3"], "str": "(PSCA01H3)"}, "description": "Communicating complex science issues to a wider audience remains a major challenge. This course will use film, media, journalism and science experts to explore the role of science and scientists in society. Students will engage with media and academic experts to get an insight into the 'behind the scenes' world of filmmaking, media, journalism, and scientific reporting. The course will be of interest to all students of environmental science, media, education, journalism and political science.", "code": "PSCD11H3"}, "PHYD57H3": {"breath_req": "Natural Sciences", "description": "Intermediate and advanced topics in numerical analysis with applications to physical sciences. Ordinary and partial differential equations with applications to potential theory, particle and fluid dynamics, multidimensional optimization and machine intelligence, are explained. The course includes programming in Python, and C or Fortran, allowing multi-threading and vectorization on multiple platforms.", "prerequisite": {"list": ["PSCB57H3"], "str": "PSCB57H3"}, "title": "PHYD57H3  Advanced Computational Methods in Physics ", "code": "PHYD57H3"}, "PHLC92H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of some central philosophical problems of contemporary political philosophy.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses, of which 0.5 credit must be from the Value Theory area of focus  see Table 1.0 for reference]"}, "title": "PHLC92H3  Political Philosophy ", "code": "PHLC92H3"}, "POLB72H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any 4.0 credits"}, "title": "POLB72H3  Introduction to Political Theory ", "exclusions": {"list": ["PHLB17H3"], "str": "PHLB17H3"}, "description": "This course presents a general introduction to political theory and investigates central concepts in political theory, such as liberty, equality, democracy, and the state. Course readings will include classic texts such as Plato, Aristotle, Hobbes, Rousseau, and Marx, as well as contemporary readings.Area of Focus: Political Theory", "code": "POLB72H3"}, "PSYD66H3": {"breath_req": "Natural Sciences", "description": "An extensive examination of selected human brain and behaviour topics introduced in PSYB65H3. The neural bases of mental functions such as language, learning, memory, emotion, motivation and addiction are examples of the topics that may be included. Students will be expected to read and discuss current empirical research in this field.", "prerequisite": {"list": ["PSYB65H3"], "str": "PSYB65H3"}, "title": "PSYD66H3  Current Topics in Human Brain and Behaviour ", "code": "PSYD66H3"}, "PHLB35H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course is an introduction to the major themes and figures of seventeenth and eighteenth century philosophy, from Descartes to Kant, with emphasis on metaphysics, epistemology, and ethics. ", "exclusions": {"list": ["PHL210Y"], "str": "PHL210Y"}, "title": "PHLB35H3  Introduction to Early Modern Philosophy ", "code": "PHLB35H3"}, "PMDC42Y3": {"breath_req": "Natural Sciences", "description": "Provides students with the necessary theoretical concepts and applied knowledge and skills for managing a variety of pre-hospital medical and traumatic emergencies. Particular emphasis is placed on advanced patient assessment, ECG rhythm interpretation and cardiac emergencies, incorporation of symptom relief pharmacology into patient care and monitoring of intravenous fluid administration. Students must pass each component (theory, lab and field) of the course to be successful. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB30H3", "PMDB32Y3", "PMDB36H3", "BIOB11H3"], "str": "PMDB30H3 and PMDB32Y3 and PMDB36H3 and BIOB11H3"}, "title": "PMDC42Y3  Pre-hospital Care 3: Theory, Lab and Field ", "code": "PMDC42Y3"}, "PHYB01H3": {"breath_req": "Natural Sciences", "description": "A conceptual overview of some of the most interesting advances in physics and the intellectual background in which they occurred. The interrelationship of the actual practice of physics and its cultural and intellectual context is emphasized. (Space time; Symmetries; Quantum Worlds; Chaos.)", "prerequisite": {"list": [], "str": "4.0 credits"}, "title": "PHYB01H3  Modern Physics for Non-Scientists ", "code": "PHYB01H3"}, "PSYC02H3": {"breath_req": "Natural Sciences", "description": "How we communicate in psychology and why. The differences between scientific and non-scientific approaches to behaviour and their implications for communication are discussed. The focus is on improving the student's ability to obtain and organize information and to communicate it clearly and critically, using the conventions of the discipline.", "prerequisite": {"list": ["PSYB01H3", "PSYB04H3", "PSYB07H3", "STAB23H3", "STAB22H3"], "str": "[PSYB01H3 or PSYB04H3] and [PSYB07H3 or STAB23H3 or STAB22H3]"}, "title": "PSYC02H3  Scientific Communication in Psychology ", "code": "PSYC02H3"}, "PHYD37H3": {"breath_req": "Natural Sciences", "description": "A course describing and analyzing the dynamics of fluids. Topics include: Continuum mechanics; conservation of mass, momentum and energy; constituitive equations; tensor calculus; dimensional analysis; Navier-Stokes fluid equations; Reynolds number; Inviscid and viscous flows; heat conduction and fluid convection; Bernoulli's equation; basic concepts on boundary layers, waves, turbulence.", "prerequisite": {"list": ["PHYB54H3", "MATC46H3"], "str": "PHYB54H3 and MATC46H3"}, "title": "PHYD37H3  Introduction to Fluid Mechanics ", "code": "PHYD37H3"}, "PHLB99H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Philosophical writing emphasizes clear reasoning. Students will learn to analyze texts, to discern and assess argument structure, and to develop techniques for writing a clear well-argued analysis of a subject matter. These key writing skills lie at the core of philosophical method and they are also applicable across subject areas and disciplines. This course is strongly recommended for philosophy specialists and majors, open to philosophy minors, and open to all other students by permission of the instructor.", "prerequisite": {"list": ["PHLB50H3", "PHLB55H3"], "str": "0.5 credit in PHL courses, excluding [PHLB50H3 and PHLB55H3]"}, "title": "PHLB99H3  Writing for Philosophy ", "code": "PHLB99H3"}, "PSYC08H3": {"breath_req": "Quantitative Reasoning", "prerequisite": {"list": ["PSYB07H3", "STAB23H3", "STAB22H3"], "str": "[PSYB07H3 or STAB23H3 or STAB22H3] and [an additional 0.5 credit at the B-level in Psychology]"}, "title": "PSYC08H3  Advanced Data Analysis in Psychology ", "exclusions": {"list": ["STAC52H3", "PSY202H"], "str": "(STAC52H3), PSY202H"}, "description": "This course is a continuation of PSYB07H3. The primary focus of this course is on the understanding of Analysis-of-Variance and its application to various research designs. Examples will include a priori and post hoc tests. Finally, there will be an introduction to multiple regression, including discussions of design issues and interpretation problems.", "code": "PSYC08H3"}, "PHLC99H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course aims to foster a cohesive cohort among philosophy specialists and majors. The course is an intensive seminar that will develop advanced philosophical skills by focusing on textual analysis, argumentative techniques, writing and oral presentation. Students will work closely with the instructor and their peers to develop a conference-style, research-length paper. Each year, the course will focus on a different topic drawn from the core areas of philosophy for its subject matter. This course is strongly recommended for students in the Specialist and Major programs in Philosophy.", "prerequisite": {"list": [], "str": "Any 4.5 credits and [an additional 1.5 credits in PHL courses]"}, "title": "PHLC99H3  Philosophical Development Seminar ", "code": "PHLC99H3"}, "PHLB60H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "A consideration of problems in metaphysics: the attempt to understand 'how everything fits together' in the most general sense of this phrase. Some issues typically covered include: the existence of God, the nature of time and space, the nature of mind and the problem of the freedom of the will.", "exclusions": {"list": ["PHL231H"], "str": "(PHL231H)"}, "title": "PHLB60H3  Introduction to Metaphysics ", "code": "PHLB60H3"}, "POLD78H3": {"breath_req": "Social & Behavioural Sciences", "description": "This seminar course is intended for students interested in deepening their understanding of methodological issues that arise in the study of politics or advanced research techniques.", "prerequisite": {"list": ["POLC78H3"], "str": "POLC78H3 and [1.0 credit at the C-level in POL courses]"}, "title": "POLD78H3  Advanced Political Analysis ", "code": "POLD78H3"}, "PHLA10H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to philosophy focusing on issues of rationality, metaphysics and the theory of knowledge. Topics may include: the nature of mind, freedom, the existence of God, the nature and knowability of reality. These topics will generally be introduced through the study of key texts from the history of philosophy.", "title": "PHLA10H3  Reason and Truth ", "code": "PHLA10H3"}, "PMDB32Y3": {"breath_req": "Natural Sciences", "description": "Provides the necessary knowledge, skill and value base that will enable the student to establish the priorities of assessment and management for persons who are in stress or crisis due to the effects of illness or trauma. The resulting patho-physiological or psychological manifestations are assessed to determine the degree of crisis and/or life threat. Students must pass each component (theory, lab and clinical) of the course to be successful. This course is taught at the Centennial HP Science and Technology Centre.", "prerequisite": {"list": ["PMDB22H3", "PMDB25H3", "PMDB41H3", "PMDB33H3"], "str": "PMDB22H3 and PMDB25H3 and PMDB41H3 and PMDB33H3"}, "title": "PMDB32Y3  Pre-hospital Care 2: Theory, Lab and Clinical ", "code": "PMDB32Y3"}, "PSYC12H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB10H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB10H3 and [an additional 0.5 credit at the B-level in PSY courses]"}, "title": "PSYC12H3  The Psychology of Prejudice ", "exclusions": {"list": ["PSY322H"], "str": "PSY322H"}, "description": "A detailed examination of selected social psychological topics introduced in PSYB10H3. This course examines the nature of attitudes, stereotypes and prejudice, including their development, persistence, and automaticity. It also explores the impact of stereotypes on their targets, including how stereotypes are perceived and how they affect performance, attributions, and coping.", "code": "PSYC12H3"}, "POLC37H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["POLB70H3", "POLB71H3", "POLB72H3"], "str": "[(POLB70H3) and (POLB71H3)] or POLB72H3 or [1.0 credit at the B-level in IDS courses]"}, "title": "POLC37H3  Global Justice ", "exclusions": {"list": ["PHLB08H3"], "str": "(PHLB08H3)"}, "description": "This course examines theoretical debates about the extent of moral and political obligations to non-citizens. Topics include human rights, immigration, global poverty, development, terrorism, and just war.Area of Focus: Political Theory", "code": "POLC37H3"}, "POLD90H3": {"breath_req": "Social & Behavioural Sciences", "description": "While domestic and international political factors have discouraged pro human development public policies in much of the global south, there have been some important success stories. This course examines the economic and social policies most successful in contributing to human development and explores the reasons behind these rare cases of relatively successful human development.Areas of Focus: Comparative Politics; Public Policy", "prerequisite": {"list": ["IDSB01H3", "IDSB04H3", "POLB90H3", "POLB91H3"], "str": "[1.0 credit from: IDSB01H3, IDSB04H3, POLB90H3, POLB91H3] and [2.0 credits at the C-level in any courses]"}, "title": "POLD90H3  Public Policy and Human Development in the Global South ", "code": "POLD90H3"}, "PPGC66H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["POLB50Y3"], "str": "[POLB50Y3 or equivalent] or [1.5 credits at the B-level in CIT courses]"}, "title": "PPGC66H3  Public Policy Making ", "exclusions": {"list": ["POLC66H3"], "str": "(POLC66H3)"}, "description": "This course provides an introduction to the study of public policy. The course will address theories of how policy is made and the influence of key actors and institutions. Topics include the policy cycle (agenda setting, policy information, decision making, implementation, and evaluation), policy durability and change, and globalization and policy making.  Areas of Focus: Public Policy, Comparative Politics, Canadian Government and Politics ", "code": "PPGC66H3"}, "PHYB10H3": {"breath_req": "Natural Sciences", "prerequisite": {"list": ["PHYA21H3", "MATA36H3", "MATA37H3"], "str": "PHYA21H3, [MATA36H3 or MATA37H3]"}, "title": "PHYB10H3  Intermediate Physics Laboratory I ", "exclusions": {"list": ["PHYB23H3"], "str": "(PHYB23H3)"}, "description": "Experimental and theoretical study of AC and DC circuits with applications to measurements using transducers and electronic instrumentation. Practical examples are used to illustrate several physical systems.", "code": "PHYB10H3"}, "PSYC35H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["PSYB07H3", "STAB22H3", "STAB23H3", "PSYB30H3"], "str": "[PSYB07H3 or STAB22H3 or STAB23H3] and PSYB30H3 and [an additional  0.5 credit at the B-level in PSY courses]"}, "title": "PSYC35H3  Advanced Personality Psychology ", "exclusions": {"list": ["PSY337H"], "str": "PSY337H"}, "description": "This course is intended to advance students' understanding of contemporary personality theory and research. Emerging challenges and controversies in the areas of personality structure, dynamics, and development will be discussed.", "code": "PSYC35H3"}}