{"WSTD10H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["WSTB05H3"], "str": "3.5 credits in WST courses, including [WSTB05H3 and 0.5 credit at the C-level]"}, "title": "WSTD10H3  Story Telling and Social Change ", "exclusions": {"list": ["HISC28H3", "HISD25H3", "WSTC02H3", "HISD44H3", "CITC10H3"], "str": "HISC28H3, HISD25H3, WSTC02H3 (Fall 2013), HISD44H3 (Fall 2013), CITC10H3 (Fall 2013)"}, "description": "With a focus on telling women's complex stories of life in Scarborough, this applied research course introduces students to the theory, methods and practice of feminist oral history. The course involves working and studying in the classroom and in the community. 15 hours of community work expected.", "code": "WSTD10H3"}, "WSTC22H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines narrative, documentary and experimental films by a selection of global women directors from a social, critical and historical perspective. We will analyse the filmic representations of race, class, gender and sexual orientation, and explore how cinema made by women can challenge or perpetuate notions of gender.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "Any 5 credits, including [WSTA01H3 & [WSTA03H3 or (WSTA02H3)]] or [any ENG, FRE or GAS cinema class]"}, "title": "WSTC22H3  Women and Film ", "code": "WSTC22H3"}, "WSTB12H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3", "WSTB05H3", "WSTB11H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3) or WSTB05H3 or WSTB11H3 or one half credit from the list provided in requirement #6 in the Major in Women's and Gender Studies]"}, "title": "WSTB12H3  Women, Violence and Resistance ", "exclusions": {"list": ["NEW373H", "WGS373H"], "str": "(NEW373H), WGS373H"}, "description": "An analysis of violence against women and recent forms of resistance to violence. A historical, cultural, and structural approach to studying gender-based violence. Family, state, economic and ideological aspects will be addressed. Initiatives toward making communities safer, including strategies for prevention and education will be examined. ", "code": "WSTB12H3"}, "WSTB06H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Because of gendered responsibilities for creating homes, migrant women create and experience diasporic relations (to family and friends elsewhere) in distinctive ways. This course uses methods and materials from literature, history and the social sciences to understand the meaning of home for migrant women from many different cultural origins.", "prerequisite": {"list": [], "str": "1.0 credit at the A-level in AFS, CLA, GAS, HIS or WST courses"}, "title": "WSTB06H3  Women in Diaspora ", "code": "WSTB06H3"}, "WSTC24H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Across cultures, women are the main preparers and servers of food in domestic settings; in commercial food production and in restaurants, and especially in elite dining establishments, males dominate. Using agricultural histories, recipes, cookbooks, memoirs, and restaurant reviews and through exploration of students' own domestic culinary knowledge, students will analyze the origins, practices, and consequences of such deeply gendered patterns of food labour and consumption.", "prerequisite": {"list": [], "str": "8.0 credits, including 0.5 credit at the A or B-level in WST courses and 0.5 credit at the A or B-level in FST courses"}, "title": "WSTC24H3  Gender in the Kitchen ", "code": "WSTC24H3"}, "WSTA01H3": {"breath_req": "Social & Behavioural Sciences", "description": "An introduction to the study of women around the world from an interdisciplinary perspective. Issues to be addressed will include: women's diversity locally and globally, patriarchal foundations, the dynamics of socialization, and the transmission and perpetuation of images of women.", "exclusions": {"list": ["NEW160Y", "WGS160Y", "WGS101H"], "str": "(NEW160Y), WGS160Y, WGS101H"}, "title": "WSTA01H3  Introduction to Women's and Gender Studies ", "code": "WSTA01H3"}, "WSTC31H3": {"description": "An examination of a current topic relevant to women's and gender studies.Students will have the opportunity to explore recent scholarship in a specific content area which will vary from year to year. Participation in a related project/practicum in the community may be incorporated into the course.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 & [WSTA03H3 or (WSTA02H3)]"}, "title": "WSTC31H3  Selected Topics in Women's/Gender Studies ", "code": "WSTC31H3"}, "WSTD30H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "1.0 credit at the B-level and 1.0 credit at the C-level in WST courses, or other Humanities and Social Sciences courses"}, "title": "WSTD30H3  Asians and Aliens: Techno-Orientalism and Global Asian Futurity ", "exclusions": {"list": ["GASD30H3"], "str": "GASD30H3"}, "description": "This course examines how popular culture projects its fantasies and fears about the future onto Asia through sexualized and racialized technology. Through the lens of techno-Orientalism this course explores questions of colonialism, imperialism and globalization in relation to cyborgs, digital industry, high-tech labor, and internet/media economics. Topics include the hyper-sexuality of Asian women, racialized and sexualized trauma and disability. This course requires student engagement and participation. Students are required to watch films in class and creative assignments such as filmmaking and digital projects are encouraged.  Same as GASD30H3", "code": "WSTD30H3"}, "WSTD07H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "At least 2 C-level courses in History and/or Women's and Gender Studies."}, "title": "WSTD07H3  Themes in the History of Childhood and Culture ", "exclusions": {"list": ["HISD07H3"], "str": "HISD07H3"}, "description": "A comparative analysis of transnational histories and cultural and gendered ideologies of children and childhood through case studies of foundlings in Italy, factory children in England, orphans and adoption in the American West, labouring children in Canada and Australia, mixed-race children in British India. Same as HISD07H3", "code": "WSTD07H3"}, "WSTC02H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTB05H3", "WSTB11H3"], "str": "WSTA01H3 and WSTA03H3 and WSTB05H3 and WSTB11H3 and 1.0 credit taken from the courses listed in requirement 6 of the Major in Women's and Gender Studies"}, "title": "WSTC02H3  Feminist Qualitative Research in Action ", "exclusions": {"list": ["WSTD02H3"], "str": "(WSTD02H3)"}, "description": "Students will design and conduct a qualitative research project in the community on an issue related to women and/or gender. The course will also include an overview of the various phases of carrying out research: planning the research project, choosing appropriate methods for data collection, analyzing the data and reporting the results. Students should expect to spend approximately 10 hours conducting their research in the community over the course of the semester.", "code": "WSTC02H3"}, "WSTB13H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 or [WSTA03H3 or (WSTA02H3)]"}, "title": "WSTB13H3  Gender, Media and Culture ", "exclusions": {"list": ["NEW271Y", "WGS271Y", "WGS205H"], "str": "(NEW271Y), WGS271Y, WGS205H"}, "description": "An interdisciplinary approach to feminist critiques of the media. Gendered representation will be examined in media such as film, television, video, newspapers, magazines and on-line technologies. Students will also develop a perspective on women's participation in, and contributions toward, the various media industries.", "code": "WSTB13H3"}, "WSTB11H3": {"breath_req": "Social & Behavioural Sciences", "description": "An overview of the complex interactions among race, class, gender and sexuality in traditional and modern societies. Drawing on both historical and contemporary patterns in diverse societies, the course offers feminist perspectives on the ways in which race, class, gender, and sexual orientation have shaped the lives of women and men.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)]"}, "title": "WSTB11H3  Intersections of Inequality ", "code": "WSTB11H3"}, "WSTD04H3": {"description": "An advanced and in-depth examination of selected topics related to women and gender, equity, diversity and human rights in the context of local and global communities, and diaspora. The course will be in a seminar format with student participation expected. It is writing intensive and involves a major research project.", "prerequisite": {"list": [], "str": "8.0 credits including 2.0 credits in WST courses"}, "title": "WSTD04H3  Senior Seminar in Gender, Equity and Human Rights ", "code": "WSTD04H3"}, "WSTD46H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "Any credit in Canadian history"}, "title": "WSTD46H3  Selected Topics in Canadian Women's History ", "exclusions": {"list": ["HISD46H3"], "str": "HISD46H3"}, "description": "Weekly discussions of assigned readings. The course covers a broad chronological sweep but also highlights certain themes, including race and gender relations, working women and family economies, sexuality, and women and the courts. We will also explore topics in gender history, including masculinity studies and gay history._Same as HISD46H3", "code": "WSTD46H3"}, "WSTA03H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An introduction to feminist theories with a focus on the diverse, multidisciplinary and multicultural expressions of feminist thought. An overview of the major themes, concepts and terminologies in feminist thinking and an exploration of their meanings.", "exclusions": {"list": ["NEW160Y", "WGS160Y", "WGS200Y", "WGS260H"], "str": "(NEW160Y), WGS160Y, WGS200Y, WGS260H"}, "title": "WSTA03H3  Introduction to Theories of Feminism ", "code": "WSTA03H3"}, "WSTD11H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An advanced and in-depth seminar dedicated to a topic relevant to Womens and Gender Studies.Students will have the opportunity to explore recent scholarship in a specific content area, which will vary from year to year. Participation in a related project/practicum in the community may be incorporated into the course.", "prerequisite": {"list": ["WSTB11H3"], "str": "WSTB11H3 and 1.0 credit at the C-level chosen from among the courses that can be used to satisfy requirement 6 of the Major in Women's and Gender Studies"}, "title": "WSTD11H3  Special Topics in Womens and Gender Studies ", "code": "WSTD11H3"}, "WSTC10H3": {"breath_req": "Social & Behavioural Sciences", "description": "How development affects, and is affected by, women around the world. Topics may include labour and economic issues, food production, the effects of technological change, women organizing for change, and feminist critiques of traditional development models.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3", "IDSB01H3", "IDSB02H3"], "str": "[WSTA01H3 and [WSTA03H3 or (WSTA02H3)]] or IDSB01H3 or IDSB02H3"}, "title": "WSTC10H3  Women and Development ", "code": "WSTC10H3"}, "WSTC12H3": {"breath_req": "Arts, Literature & Language", "description": "An exploration of the ways in which women from different countries construct the gendered subject in their representations of childhood, sexuality, work, maternity and illness. Texts will be read in English and an emphasis will be place on the cultural contexts of gender, ethnicity and class.", "prerequisite": {"list": ["ENGB50H3", "WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "ENGB50H3 or [WSTA01H3 and [WSTA03H3 or (WSTA02H3)] and any ENG or FRE literature course]]."}, "title": "WSTC12H3  Writing the Self: Global Women's Autobiographies ", "code": "WSTC12H3"}, "WSTC28H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3"], "str": "WSTA01H3 or WSTA03H3, and one full credit at the B-level in ANT, LIN, SOC or WST"}, "title": "WSTC28H3  Language and Gender ", "exclusions": {"list": ["JAL355H", "LINC28H3"], "str": "JAL355H, LINC28H3"}, "description": "An introduction to the research on differences between women and men in how they use language and how they behave in conversational interaction, together with an examination of the role of language in reflecting and perpetuating cultural attitudes towards gender. Same as LINC28H3", "code": "WSTC28H3"}, "WSTC16H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "Examining popular media and history students will investigate themes of criminality, gender and violence in relation to the social construction of justice. Some criminal cases involving female defendants will also be analyzed to examine historical issues and social contexts. Debates in feminist theory and criminology will be discussed.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "[WSTA01H3 and [WSTA03H3 or (WSTA02H3)]] or 1.0 full credit in Sociology"}, "title": "WSTC16H3  Criminal Women: Gender, Justice and the Media ", "code": "WSTC16H3"}, "WSTC20H3": {"breath_req": "Social & Behavioural Sciences", "description": "An examination of the impact the environment has on women's lives around the world. Current and historical perspectives. Topics will include: the impact of environmental degradation on women's bodies; planning for safer places; global sustainable development; ecofeminism; the gender division of spaces.", "prerequisite": {"list": [], "str": "1.5 credits in WST, 1.0 credits of which must be at the B- and/or C-level."}, "title": "WSTC20H3  Women and Environments ", "code": "WSTC20H3"}, "WSTC11H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["WSTC10H3"], "str": "WSTC10H3"}, "title": "WSTC11H3  Applied Study in Women and Development ", "exclusions": {"list": ["WSTC10Y3"], "str": "(WSTC10Y3)"}, "description": "An examination of a critical problem within the global context as it affects women in their communities. The class as a whole will determine the issue under consideration.", "code": "WSTC11H3"}, "WSTD01H3": {"description": "An opportunity to undertake an in-depth research topic under the supervision of a Women's and Gender Studies faculty member.A substantial essay/project on the approved topic will have two evaluators - the course coordinator and the supervising faculty member.This course is only open to Women's and Gender Studies Major program students with a strong record who are completing the last 5 credits of their degree. A proposal must be presented for approval to the course coordinator in the term prior to the start of the course.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3", "WSTB05H3"], "str": "At least 12.0 full credits including WSTA01H3 and [WSTA03H3 or (WSTA02H3)] and WSTB05H3 and 1.5 full credits taken from the courses listed in #3 and #7 in the Major Program."}, "title": "WSTD01H3  Senior Project in Women's and Gender Studies ", "code": "WSTD01H3"}, "WSTD03H3": {"description": "An advanced and in-depth examination of selected topics related to health, sexualities, the gendered body, and the representations and constructions of women and gender. The course will be in a seminar format with student participation expected. It is writing intensive and involves a major research project.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3", "WSTB11H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)] and WSTB11H3; and two C-level courses from requirement #6 of the Major in Women's and Gender Studies"}, "title": "WSTD03H3  Senior Seminar in Sex, Gender and the Body ", "code": "WSTD03H3"}, "WSTC32H3": {"description": "An examination of a current topic relevant to women's and gender studies. Students will have the opportunity to explore recent scholarship in a specific content area which will vary from year to year. Participation in a related project/practicum in the community may be incorporated into the course.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)]."}, "title": "WSTC32H3  Selected Topics in Women's/Gender Studies ", "code": "WSTC32H3"}, "WSTC23H3": {"breath_req": "Social & Behavioural Sciences", "description": "An opportunity for students in the Major and Minor programs in Women's and Gender Studies to apply theoretical knowledge related to women and gender to practical community experience through an unpaid practicum placement in a community, educational or social organization.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3", "WSTB05H3", "WSTB11H3", "WSTC02H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)] and WSTB05H3 and WSTB11H3 and WSTC02H3"}, "title": "WSTC23H3  Community Engagement Practicum ", "code": "WSTC23H3"}, "WSTC13H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "1.5 credits in WST courses including 0.5 credit at the B- or C-level"}, "title": "WSTC13H3  Women, Gender and Islam ", "exclusions": {"list": ["WSTC30H3", "WGS301H"], "str": "WSTC30H3 (if taken in the 2008 Winter Session), WGS301H"}, "description": "Explores historical and contemporary debates regarding the construction of gender in Islam. Topics include the historical representations of Muslim woman, veiling, sexuality, Islamic law and Islamic feminism. This course situates Muslim women as multidimensional actors as opposed to the static, Orientalist images that have gained currency in the post 9/11 era.", "code": "WSTC13H3"}, "WSTD16H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "1.0 credit at the B-level and 1.0 credit at the C-level in HIS, WST, or other Humanities and Social Sciences courses"}, "title": "WSTD16H3  Socialist Feminism in Global Context ", "exclusions": {"list": ["HISD16H3"], "str": "HISD16H3"}, "description": "A comparative exploration of socialist feminism, encompassing its diverse histories in different locations, particularly China, Russia, Germany and Canada. Primary documents, including literary texts, magazines, political pamphlets and group manifestos that constitute socialist feminist ideas, practices and imaginaries in different times and places will be central. We will also seek to understand socialist feminism and its legacies in relation to other contemporary stands of feminism. Same as HISD16H3 Transnational Area", "code": "WSTD16H3"}, "WSTC40H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3"], "str": "1.5 credits, including [WSTA01H3 or WSTA03H3] and [0.5 credit at the B- or C-level in WST courses]"}, "title": "WSTC40H3  Gender and Disability ", "exclusions": {"list": ["WGS366H"], "str": "WGS366H"}, "description": "This course introduces debates and approaches to the intersection of disability with social determinants of gender, sexuality, class, race and ethnicity. Students will examine international human rights for persons with disabilities, images and representations of gender and the body, research questions for political activism, and social injustice.", "code": "WSTC40H3"}, "WSTB10H3": {"breath_req": "History, Philosophy & Cultural Studies", "prerequisite": {"list": [], "str": "1.0 credit at the A-level in AFS, GAS, HIS, WST, or other Humanities and Social Sciences courses"}, "title": "WSTB10H3  Women, Power and Protest ", "exclusions": {"list": ["WSTA02H3"], "str": "(WSTA02H3)"}, "description": "An examination of local and global movements for change, past and current, which address issues concerning women. This course will survey initiatives from the individual and community to the national and international levels to bring about change for women in a variety of spheres. ", "code": "WSTB10H3"}, "WSTB05H3": {"breath_req": "Social & Behavioural Sciences", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 or WSTA03H3 or (WSTA02H3)"}, "title": "WSTB05H3  Power and Knowledge in Approaches to Research ", "exclusions": {"list": ["WGS202H", "WGS360H"], "str": "WGS202H, WGS360H"}, "description": "Using an intersectional lens, various methods and methodologies of research will be explored. Concepts of paradigm, power, knowledge-creation, objectivity and ethics will be examined. Students will gain critical reading skills and learn the fundamentals of conducting research. There is an experiential learning component.", "code": "WSTB05H3"}, "WSTC14H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "An examination of the impact of social policy on women's lives, from a historical perspective. The course will survey discriminatory practices in social policy as they affect women and immigration, health care, welfare, and the workplace. Topics may include maternity leave, sexual harassment, family benefits, divorce, and human rights policies.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)]"}, "title": "WSTC14H3  Women, Community and Policy Change ", "code": "WSTC14H3"}, "WSTC25H3": {"breath_req": "History, Philosophy & Cultural Studies", "description": "This course examines how sexuality and gender are shaped and redefined by cultural, economic, and political globalization. We will examine concepts of identity, sexual practices and queerness, as well as sexuality/gender inequality in relation to formulations of the local-global, nations, the transnational, family, homeland, diaspora, community, borders, margins, and urban-rural.", "prerequisite": {"list": [], "str": "1.0 credit at the A-level and 1.0 credit at the B-level in WST courses, or other Humanities and Social Sciences courses"}, "title": "WSTC25H3  Sex, Power, and the Globalized World ", "code": "WSTC25H3"}, "WSTC30H3": {"description": "An examination of a current topic relevant to women and gender studies. Students will have the opportunity to explore recent scholarship in a specific content area which will vary from year to year. Participation in a related project/practicum in the community may be incorporated into the course.", "prerequisite": {"list": ["WSTA01H3", "WSTA03H3", "WSTA02H3"], "str": "WSTA01H3 and [WSTA03H3 or (WSTA02H3)]"}, "title": "WSTC30H3  Selected Topics in Women's/Gender Studies ", "code": "WSTC30H3"}}